{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "B-ACTOR",
    "1": "B-CHARACTER",
    "2": "B-DIRECTOR",
    "3": "B-GENRE",
    "4": "B-MOVIE",
    "5": "I-ACTOR",
    "6": "I-CHARACTER",
    "7": "I-DIRECTOR",
    "8": "I-GENRE",
    "9": "I-MOVIE",
    "10": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-ACTOR": 0,
    "B-CHARACTER": 1,
    "B-DIRECTOR": 2,
    "B-GENRE": 3,
    "B-MOVIE": 4,
    "I-ACTOR": 5,
    "I-CHARACTER": 6,
    "I-DIRECTOR": 7,
    "I-GENRE": 8,
    "I-MOVIE": 9,
    "O": 10
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
