{
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 1,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ACTOR",
    "1": "B-CHARACTER",
    "2": "B-DIRECTOR",
    "3": "B-GENRE",
    "4": "B-MOVIE",
    "5": "I-ACTOR",
    "6": "I-CHARACTER",
    "7": "I-DIRECTOR",
    "8": "I-GENRE",
    "9": "I-MOVIE",
    "10": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACTOR": 0,
    "B-CHARACTER": 1,
    "B-DIRECTOR": 2,
    "B-GENRE": 3,
    "B-MOVIE": 4,
    "I-ACTOR": 5,
    "I-CHARACTER": 6,
    "I-DIRECTOR": 7,
    "I-GENRE": 8,
    "I-MOVIE": 9,
    "O": 10
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "transformers_version": "4.57.1",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
