{
    "dataset": "IMDB Movie Reviews (Cleaned)",
    "description": "Movie reviews with only ID and text for NLP tasks",
    "total_reviews": 200,
    "reviews": [
        {
            "id": "neg_200",
            "text": "That reviewers liked this movie surprises me. The plot is a muddle. The characters are wooden. Michael Bowen spends most of the film spying on the other characters and misjudging all of them. No one has any redeeming quality or point-of-interest. This is not an edgy work. It is not imaginative. It is not ironic. It is no clever. There is nothing straight forward about this tedious work. That is missed theatrical release is not surprise. That the \"This Network\" airs it diminishes that venue. I definitely recommend turning to a rerun of the Garden Smart show on PBS or even a good informational if you encountered this mess on late night television. If you encounter it on daytime television, take a long walk. Even if you walk in smog, you will feel better not having suffered through this shambles. Life is short. This movie is long."
        },
        {
            "id": "neg_201",
            "text": "Iberia is nice to see on TV. But why see this in silver screen? Lot of dance and music. If you like classical music or modern dance this could be your date movie. But otherwise one and half hour is just too long time. If you like to see skillful dancing in silver screen it's better to see Bollywood movie. They know how to combine breath taking dancing to long movie. Director Carlos Saura knows how to shoot dancing from old experience. And time to time it's look really good. but when the movie is one and hour it should be at least most of time interesting. There are many kind of art not everything is bigger then life and this film is not too big."
        },
        {
            "id": "neg_202",
            "text": "That's not the sound of bees, that's the effect induced by watching this extremely long, extremely boring, badly acted movie. How I ever made it through all 3 1/2 hours without falling asleep I'll never know. The plot is simple...3 thoroughly unlikable morons talk about sex for 3 1/2 hours. And you thought Rohmer was deadly. This is even worse, if that's possible. > I must really be a masochist if I could watch this entire movie without turning it off...or killing someone."
        },
        {
            "id": "neg_203",
            "text": "Well, as Goethe once said, there really isn't any point in trying to pass a negative judgement that aspires to be objective on \"something that has had a great effect\". \"La Maman et La Putain\" has surely passed into history as an influence on much of what's been done in France and elsewhere in the past thirty years and no one interested in the history of film, certainly, should be dissuaded from watching it. To express a purely subjective judgement, however, I feel compelled to disagree with almost every other review posted here and say to people: \"Don't watch it; it's a waste of hours of your time that will just leave you feeling rather sick and angry.\" And by that I don't mean \"sick and angry\" about \"the human condition\" or anything so general and profound as that, because that is exactly the line that most critics have adopted in their fulsome praise of the film - \"an ordeal to watch in its ruthless dissection of our emotional cowardice and cruelty\" and so on - and, if it really managed to put across a universally or even broadly relevant message of this sort, then the director would have good reason to be satisfied with himself, however pessimistic his conclusions may be. My beef with the film is rather that I don't see this hours-long record of empty vanity and petty treachery as being justified or excused by any GENERALLY relevant message at all. All three main characters are deeply morally unattractive individuals: Alexandre to the greatest degree, of course, because we see by far the most of him and because he seldom shuts up for more than thirty seconds; Marie perhaps to the least degree, because we see the least of her. Alexandre's affected and pretentious monologues have a kind of amusement value, of course, but the amusement wears thin as one comes more and more clearly to realize that Jean-Pierre Léaud is most likely not even acting and that, with absurd remarks like \"un homme beau comme un film de Nicholas Ray\", he really was just reproducing word-for-word opinions that were accepted as authentic and profound by the milieu in which he, along with the director Eustache, had been living for about ten years by the time of the making of the film. I suppose if the tone of relentless superficiality and triviality had been sustained throughout 100% of the film, it might have worked as a long sardonic comedy about a particularly shallow, worthless and despicable post-'68 milieu. What made, however, this viewer at least extremely angry with the director was his granting of at least one lengthy scene each to Alexandre and Veronika in which we are clearly expected to empathize with and feel for them as if they shared a moral universe with us. If a man can get away with living in the flat of and professing to love one woman, sleeping (mostly in this very flat) with another, and running around Paris proposing marriage to yet a third, well, I suppose I can wish him the best of luck in the dog-eat-dog world he's chosen to create for himself. What I can't, however, in all conscience do is listen even for a moment to maudlin monologues from him in which he speaks about his \"anxiety\" and his \"despair\". The same goes double for the even more despicable Veronika, whom we are shown barging drunk into the apartment and even the bed shared by Marie and Alexandre and behaving there with an infantile inconsistency tantamount to the most savage and heartless cruelty. As I say, if \"La Maman et La Putain\" is intended to be nothing more nor other than a portrait of Alexandre, Veronika and Marie, three individuals whom any even halfway decent person would never admit into their company let alone their home, then I suppose there is a kind of legitimacy in praising the director for being \"unflinching\" (though why one should even feel like \"flinching\" once one had consciously opted to create such thoroughly repellent characters to filmically observe I can't imagine). The problem, however, is that the director is clearly convinced - and appears to have succeeded in convincing generations of critics - that Alexander, Veronika and Marie are somehow representative of human beings in general and of the limits of human beings' emotional capabilities. This latter idea, however, is arrant and offensive nonsense. There may indeed be an inherent fallibility and tendency to tragedy in human relations in general and sexual relations in particular. But the nature and degree of this fallibility and tendency to tragedy can only possibly be determined by people who make a sincere and serious effort to make such relations work. It surely needs no cinematic or authorial genius to convey to us the information that a man who behaves like Alexandre is going to end up hated, miserable, and alone, or that women who insist on expecting love from a man like Alexandre are going to end up disappointed and bitter. Watch \"La Maman et La Putain\" if you're historically interested in what passed for culture and human interaction in a certain post-'68 Parisian milieu which was probably, unfortunately, not restricted to just a few particularly anti-social types like these. But please don't make the mistake of believing that what is recorded here has any general relevance for humanity in the way that a film by Jean Renoir or Martin Scorsese might be argued to have."
        },
        {
            "id": "neg_204",
            "text": "The perfect murder is foiled when a wife(played by Mary Ellen Trainor, once the wife to director Robert Zemeckis, who helmed this episode), who murders her husband with a poker, has the misfortune of receiving a visitor as she is about to move the body outside..an escaped insane madman dressed in a Santa Claus suit(played by a deviously hideous Larry Drake). She fends for her life while trying to find a way of hiding her husband's corpse. She decides to use an ax, once she downs the Santa killer who misses several chances to chop off the woman's head, to frame the killer for her husband's murder. Santa killer locks her in a closet and pursues the woman's daughter as she tries desperate to free herself to save the child.<br /><br />This episode of TALES FROM THE CRYPT just recycles tired material involving the old \"Santa kills\" theme while also adding the oft-used(add nauseum)woman-murders-her-husband-for-a-man-she's-been-cheating-with routine. It's essentially Trainor trying to find a way to avoid being caught with a dead body she kills while also keeping a safe distance from a maniac. There's nothing refreshing or new about this plot which pretty much goes through the motions. Not one of the show's highlights."
        },
        {
            "id": "neg_205",
            "text": "I jumped at the chance to view this movie uncut and uninterrupted, remembering rahs and raves for it. But wherever it seemed about to slip into being truly scary, it backed off and went somewhere else. The dripping water throughout the house, the black rain, the prophetic dreams, taking the wrong turn in raw sewage were dropped before they could work up to a scream.<br /><br />What a disappointment. Chamberlain's nearly expressionless mask of a face offered little but confused disbelief, something I found myself mirroring as the film wore on. What could have been eerie Aboriginal chanting and instruments in the background were instead a cacophony seemingly designed to beat terror into one's head. The ideas that modern people can embody ancient gods, that the Aboriginal peoples believe red-haired white men were the first priests, and many other possibilities are passed along more like a shopping list than a hint at another dimension (the Dream Time).<br /><br />[SPOILER] In the final scene, it wasn't clear to me what the director was trying to tell. Is there a big wave? So what? How big? A tsunami? Yeah, okay. That's devastating but not apocalyptic. Is it the end of the world? From a wave? The last wave? That'd have to be a pretty darn big wave. Why? Was the world that bad a place? It didn't seem so awful in this movie. Actually I didn't think the wave came off, since the shadow left Burton's face that had been cast by the wave. Was it only Burton's apocalypse? Heck, that happens every day to people who lose it. It wasn't of any interest if it was only him.<br /><br />The most frightening scene, and the one that gives the best indication of Weir's potential, was in Charlie's apartment where Burton has gone to confront the old man for scaring Burton's wife. Charlie keeps asking him \"Who are you?\" and it becomes truly disturbing after a while. Unfortunately, the movie never followed suit."
        },
        {
            "id": "neg_206",
            "text": "I gave this film 2 stars only because Dominic Monaghan actually put effort through in his acting. Everything else about this film is extremely amateur. Everything associated with the direction of this film was very poorly executed. Not only should the director rethink what she is doing for a life career but maybe she should watch a few films. As Dominic Monaghan is a very credible actor, placing him in a film of this caliber makes him look awful. Whomever the \"actor\" was that played Jack's best friend should never have stepped in front of the camera. I didn't expect much from such a small film, but perhaps a little more time and effort should be put into the characters and their surroundings. Don't waste your time or money on this film (like I did) you will be sorely disappointed."
        },
        {
            "id": "neg_207",
            "text": "This movie is a 90 minute Ramones concert with brief periods of stupidity and absolute boredom. What kind of high school is this anyway?<br /><br />Unless you are a major Ramones fan, DO NOT and I repeat DO NOT waste your time like I did. This is utterly unwatchable from start to finish. This movie should be called Ramone Fever. Everyone appears to like them in this movie. There is not a plot to be found in this flick. As far as teen comedies go, you are scraping the bottom of the barrel with this one."
        },
        {
            "id": "neg_208",
            "text": "Horrible film with bits of the Ramones strewn about. Your worse than average 1970's/80's comedy format of the cool kids taking over the school with some whimsical plan. This movie is terrible. The plot consists of a girl who enjoys the Ramones and a school bent on fighting against their oppressive administration. Forget this movie and watch something like Wild Zero starring Guitar Wolf if you want an entertaining B movie. Terrible acting, terrible writing, terrible plot with the stamp of approval of the Ramones who probably needed some money quick so they said yes to this movie. That is the only logical thing I can think of because this movie blows."
        },
        {
            "id": "neg_209",
            "text": "I could never stand watching Happy Days after Chachi joined the cast, so I knew I was in trouble when the best scene in this movie featured Scott Baio (a skateboard chase scene!). Jodie Foster in her first \"grown-up\" role turns in her usual professional performance but that is no excuse for this boring mess. Two hours out of my life that I'll never get back! No noteworthy characters, unbelievable storyline, questionable editing and horrendous cinematography but worst of all, I couldn't have cared less. The story of California teens in the 1970's, where the kids live miserable lives and all their parents are idiots. Don't waste your time watching this ugly excuse for a movie."
        },
        {
            "id": "neg_210",
            "text": "Maybe you shouldn't compare, but Wild Style and Style Wars are original Hip Hop. Beat Street does have a lot of the original artists of early Hip Hop, but they've been obviously made clear that this could be their big break, of course for some it was and that's nice. But if you view this as original Hip Hop Culture you're wrong. It's overproduced and has a Hollywood sauce. Rather look for the first two movies i mentioned. They have convey the grittiness that comes with life in the ghetto. Yes, the rating for this movie is low, but the reviews are mostly positive or even raving. This is probably because although the story, the acting, the dialogues and the direction all are dreadful, the music and dancing is what the people love about it. Me, i do love the dancing but at the time thought that electro was the death of Hip Hop (i was so glad when round '86 a new generation of now classic Hip Hop artists appeared, like Krs One, Public Enemy, Ultramagnetic Mc's, Jungle Brothers, Bizmarkie to name a few), and i still don't like most of the beats in this movie and that is why it doesn't work for me. I mean, Wild Style has not much of a story but the music there is great and authentic. Of course tastes differ and that's alright. But as far as i'm concerned, this movie is trash except for the break dancing and some of the music and so i can't rate it higher than a 4 out of ten."
        },
        {
            "id": "neg_211",
            "text": "Hilariously obvious \"drama\" about a bunch of high school (I think) kids who enjoy non-stop hip-hop, break dancing, graffiti and trying to become a dj at the Roxy--or something. To be totally honest I was so bored I forgot! Even people who love the music agree this movie is terribly acted and--as a drama--failed dismally. We're supposed to find this kids likable and nice. I found them bland and boring. The one that I REALLY hated was Ramon. He does graffiti on subway trains and this is looked upon as great. Excuse me? He's defacing public property that isn't his to begin with. Also these \"great\" kids tap into the city's electricity so they can hold a big dance party at an abandoned building. Uh huh. So we're supposed to find a bunch of law breakers lovable and fun.<br /><br />I could forgive all that if the music was good but I can't stand hip hop. The songs were--at best--mediocre and they were nonstop! They're ALWAYS playing! It got to the point that I was fast-forwarding through the many endless music numbers. (Cut out the music and you haver a 30 minute movie--maybe) There are a few imaginative numbers--the subway dance fight, a truly funny Santa number and the climatic Roxy show. If you love hip hop here's your movie. But it you're looking for good drama mixed in--forget it. Also HOW did this get a PG rating? There's an incredible amount of swearing in this."
        },
        {
            "id": "neg_212",
            "text": "Closer to reality and containing more depth than \"Breakdance\", Stan Lathan's \"Beat Street\" is still a pretty dull show. Again this pic is really only cashing in on the 'breakin' craze but at least we get a little bit of entertainment from the plot, which concerns the lives of three young friends and a younger brother, all growing up in Queens, New York. Each has their own unique talent. One is a hustler, one a d.j., another an artist who creates 'burners', while little bro' Lee is a hot 'hip hop' dancer.<br /><br />Lathan is unable to generate any real audience interest in the story though, and his young cast are likewise struggling with their characters. Therefore it is left almost entirely to the funky music and the 'fresh' dancing to save the day.<br /><br />Choreography is again sharp for both club and street scenes, but this alone is not enough to lift \"\"Beat Street\" to greater heights. Unfortunately the film really falls flat late on, after showing a glimmer of hope that it just might get interesting.<br /><br />Sunday, August 25, 1996 - Video"
        },
        {
            "id": "neg_213",
            "text": "Yes, indeed, it could have been a good movie. A love biangle, (sorry for the poetical license, but is not a triangle!) an interesting story, unfortunately badly told. The image is sometimes weird, sometimes OK, the picture looks crowded and narrow-sighted. The sound needs more attention (it usually does in Romanian movies), the light and color filters are sometimes badly chosen. The soundtrack is short and is not helping the action. About the acting... sorry but the best actress is the landlady. The others are acting immaturely and cannot convince the viewer. The acting is poetical when it should be realistic, and realistic when it should be poetical. It's a picture for adults, told by the children. Bother only if extremely curious."
        },
        {
            "id": "neg_214",
            "text": "Considering that this movie had a serious and quite successful launching campaign, I would have expected something to be worth the fuzz...from the opening scene on (in which the two brothers \"sensually\" caress each other, laying naked in a bed) it goes rapidly downwards...nothing to get the attention, not a mind-catching thing in the whole plot, baaad baad acting (a few minor exceptions, but artificiality is at its best). Incest and lesbianism are promising themes, but the script analyses none of the two in depth ( mind that a possible excuse of the makers, saying that they aimed for a subtle movie would be hilarious, unless subtle and superficial mean the same thing...). The too curious viewers will not get any interesting scene...at this point, that could have saved some of the movie...so you can imagine how bad it is. Many other things could be said...but please watch the movie yourselves...I am an egoist and I would like as many people as possible to waste about 1 1/2h of their lives...like I did :("
        },
        {
            "id": "neg_215",
            "text": "I am not so much like Love Sick as I image. Finally the film express sexual relationship of Alex, kik, Sandu their triangle love were full of intenseness, frustration and jealous, at last, Alex waked up and realized that they would not have result and future.Ending up was sad.<br /><br />The director Tudor Giurgiu was in AMC theatre on Sunday 12:00PM on 08/10/06, with us watched the movie together. After the movie he told the audiences that the purposed to create this film which was to express the sexual relationships of Romanian were kind of complicate.<br /><br />On my point of view sexual life is always complicated in everywhere, I don't feel any particular impression and effect from the movie. The love proceeding of Alex and Kiki, and Kiki and her brother Sandu were kind of next door neighborhood story.<br /><br />The two main reasons I don't like this movie are, firstly, the film didn't told us how they started to fall in love? Sounds like after Alex moved into the building which Kiki was living, then two girls are fall in love. It doesn't make sense at all. How a girl would fall in love with another girl instead of a man. Too much fragments, you need to image and connect those stories by your mind. Secondly, The whole film didn't have a scene of Alex and Kik's sexual intercourse, that 's what I was waiting for. However, it still had some parts were deserved to recommend. The \"ear piercing \" part was kind of interesting. Alex was willing to suffer the pain of ear piercing to appreciate kik's love. That was a touching scene which gave you a little idea of their love. Also, the scene of they were lying in the soccer field, the conversation express their loves were truthful and passionate."
        },
        {
            "id": "neg_216",
            "text": "I am not so much like Love Sick as I image. Finally the film express sexual relationship of Alex, kik, Sandu their triangle love were full of intenseness, frustration and jealous, at last, Alex waked up and realized that they would not have result and future.Ending up was sad.<br /><br />The director Tudor Giurgiu was in AMC theatre on Sunday 12:00PM on 08/10/06, with us watched the movie together. After the movie he told the audiences that the purposed to create this film which was to express the sexual relationships of Romanian were kind of complicate.<br /><br />On my point of view sexual life is always complicated in everywhere, I don't feel any particular impression and effect from the movie. The love proceeding of Alex and Kiki, and Kiki and her brother Sandu were kind of next door neighborhood story.<br /><br />The two main reasons I don't like this movie are, firstly, the film didn't told us how they started to fall in love? Sounds like after Alex moved into the building which Kiki was living, then two girls are fall in love. It doesn't make sense at all. How a girl would fall in love with another girl instead of a man. Too much fragments, you need to image and connect those stories by your mind. Secondly, The whole film didn't have a scene of Alex and Kik's sexual intercourse, that 's what I was waiting for. However, it still had some parts were deserved to recommend. The \"ear piercing \" part was kind of interesting. Alex was willing to suffer the pain of ear piercing to appreciate kik's love. That was a touching scene which gave you a little idea of their love. Also, the scene of they were lying in the soccer field, the conversation express their loves were truthful and passionate."
        },
        {
            "id": "neg_217",
            "text": "This is a movie that relies solely on the somewhat controversial image of incest and lesbianism to get noticed.That is it.The dialogs are pathetic and the sensuality of the \"sex scenes\" is absolutely absent.The acting and the dialog are more suited for high-school children,yet the subject is intended for adult audiences. It is a gutless and shallow movie.It could have been way better if it had a story and more drama. Ah and on top of that, one more thing: why are inner monologues so excessively used? Makes it seem so cheap.All in all an embarrassing movie for Romanian cinema as well as for mature audiences attempting to view it.I know the means are scarce but, that is not always an excuse for a movie flopping as this one does.And please start using some good actors in your movies and stop recycling them from musicians (Tudor Chirila) - they can't act!"
        },
        {
            "id": "neg_218",
            "text": "***LIGHT SPOILER ALERT*** The story sounds good and if you've read the novel, then you're probably expecting a deep and intense movie that could offer some insight for some interesting and insufficiently explored human relationships.<br /><br />True enough, the script tries to do that, the director tries to do that, but the main cast fails miserably. Maria's acting is so dry that lacks any feeling whatsoever, her most intense moments seem almost comical. Sometimes she seems to be nervous due to the camera. Her only really feeling scene is near the end where she gets dumped by her girlfriend.<br /><br />Ioana seems even more tense than Maria and even worse, she doesn't seem natural at all. Maria had the attitude, even if it was artificially pushed towards being obvious, but she had it and her character received some credibility. And to make matters worse, we don't have an insight on her: where does she come from, how come she got involved in the lesbian relationship, how did the relationship evolve? We only get some bits from her parents and their relationship just seems to 'be' there: it has a content and and end, but no beginning. Just like her partner Maria, she has only once scene that is truly touching, the scene where she dumps Maria's character Kiki.<br /><br />Tudor is the only person in this movie (aside from the landlady, great acting there) who manages to prove some acting talent. He has his character's attitude and it fits him. Only once or twice he seems to falter (the scene at his parents' meal, he tries to be obvious when it wasn't necessary at all).<br /><br />I love the story, Tudor Chirila is OK there, the landlady actually acts and Puya delivers his couple of lines with style, but this doesn't save the movie. Too bad, the entire setting had huge potential and the Romanian cinematography could've used a movie on this theme.<br /><br />Oddly enough, the incestuous relationship between brother and sister seems to have more credibility than the no-background no-feeling (well, Maria's spoken interludes are a nice try in this direction) lesbian relationship of Maria and Ioana. I'm quite sorry for spending money on a ticket, I'd rather had watched it from the comfort of my room."
        },
        {
            "id": "neg_219",
            "text": "it MIGHT have been a good movie if it had explored something more interesting rather than just the surface of a lesbian relationship if this was the meaning of the movie...it is quite predictable not mentioning that the two girls resemble the Russian group t.A.T.u....coincidence? i don't think so. There is nothing original in this movie to support it so they had to use something which is already famous.You know the recipe. The other actors...well,i just don't know what their role is supposed to be. Most of them are well - known people in Romania and i must mention some of them are not even actors(e.g.Mihaela Radulescu).SO to summarize it: \"girl band tatty\"+desperate/publicity needing \"actors\"+ a non-existing plot+ the occasion to use bad language in order to shock= Love sick....too bad...the idea was good,though...and i am seriously holding myself from commenting the title..."
        },
        {
            "id": "neg_220",
            "text": "\"The Crush\" is a pleasant enough 40-something friends romantic chick flick for the first two-thirds or so, as it tries to be a Brit \"Sex and the City\". <br /><br />I particularly enjoyed the turn-around of the trophy young hunk whose character is not much fleshed out (come to think of it we didn't see all that much physical flesh of him either and Kenny Doughty is worth seeing more of). <br /><br />They sure make a lot more deal of young man/older woman than was made of the opposite in either version of \"Sabrina\" (neither movie do I like) or for that matter with the Douglas/Zeta-Jones or Dion/Svengali nuptials.<br /><br />Surrounding Andie MacDowell as an ex pat otherwise are welcome familiars from Brit dramas and comedies, such as tart-tongued Anna Chancellor. <br /><br />The plot twists towards the end feel very deus ex machina. But it wasn't until the credits came up at the end that I realized what might really be wrong. Just as with \"Sex and the City,\" the writer/director is male, here first-timer Scot John McKay, and I think he really wanted to do a script about three gay men, probably about them coming out in relation to their lovers and at work (the characters are a school principal, a cop and a doctor), which would have been a better and more interesting movie. The working title for the film was \"The Sad F*cker's Club\" which would have made its parallels with the gay \"Broken Hearts Club\" even more obvious.<br /><br />(originally written 4/6/2002)"
        },
        {
            "id": "neg_221",
            "text": "I was gifted with this movie as it had such a great premise, the friendship of three women bespoiled by one falling in love with a younger man.<br /><br />Intriguing.<br /><br />NOT! I hasten to add. These women are all drawn in extreme caricature, not very supportive of one another and conspiring and contriving to bring each other down.<br /><br />Anna Chancellor and Imelda Staunton could do no wrong in my book prior to seeing this, but here they are handed a dismal script and told to balance the action between slapstick and screwball, which doesn't work too well when the women are all well known professionals in a very small town.<br /><br />And for intelligent women they spend a whole pile of time bemoaning the lack of men/sex/lust in their lives. I felt much more could have been made of it given a decent script and more tension, the lesbian sub-plot went nowhere and those smoking/drinking women (all 3 in their forties???) were very unrealistic - even in the baby scene - screw the baby, gimme a cigarette! Right.<br /><br />Like I said, a shame of a waste. 4 out of 10."
        },
        {
            "id": "neg_222",
            "text": "As a single woman over 40, I found this film extremely insulting and demeaning to single women over 40, not to mention every other woman, of any age. It was a sad, pathetic attempt by a man to write and direct a \"chick flick\", and it failed miserably. Andy McDowell isn't much of an actress to begin with, but given the non-existent \"plot\" (I hate to even refer to it as a plot) in this, she didn't have a chance. There was no character development, no reason to feel sympathy/empathy for any of the characters, and no attempt to make the film in any way realistic or believable. And then there's the obligatory male-fantasy of an attractive straight woman suddenly deciding to give lesbianism a try -- PLEASE.<br /><br />Not only do I wish I could get my money back for the DVD rental, I also want those 112 minutes of my life back. What a ripoff."
        },
        {
            "id": "neg_223",
            "text": "Not a `woman film' but film for the gang. One of the worst films ever made by a male director about woman. Director Andy McKay simply doesn't know woman. Peaks of bad taste, American Pie's humor style, crude story, no sense, groundless story, refuted characters. Vulgar fantasies came to life on screen. Insulting and definitely not funny. I wonder how three good actresses accepted to take part in it."
        },
        {
            "id": "neg_224",
            "text": "The worst thing about Crush is not that it's acted pretty bad, or that the plot is virtually non-existent, and it's not even that bad that the camerawork could have been better.<br /><br />No, the worst part of this movie is that it has a few absolutely brilliant moments that keep you hoping that there are more to come.<br /><br />But in the end, it's too little, too late. If you are a fan of violin-music and cheap tearjerking scenes of 40+ women crying and hugging and talking about babies and marriage - then by all means, don't miss it.<br /><br />I myself am not exactly thrilled to see the things listed above in a movie, and as a result I had a pretty horrible time. The few absolutely brilliant jokes can not make up for the rest of it.<br /><br />The verdict: 4/10. Guilty of wasting my time.<br /><br />"
        },
        {
            "id": "neg_225",
            "text": "SPOILER: The young lover, Jed, is kicked out by the spinster, Kate (Andie McDowell), because she wrongly believes that Jed is having an affair with one of her two catty girlfriends. Kate thought she caught them en flagrante delicto. Kate throws Jed's shoes out the door. Jed reluctantly leaves, and then sits in the middle of the road to put his shoes on. Then he gets run over (\"Crushed\", one of the meaning of the title) by a truck. And dies.<br /><br />\"And then he gets run over by a truck.\" Can you imagine a screenwriter actually submitting a script with this plot element? Up to then, its a comedy that intends to be frothy, but lacks any real fizz. Everybody but Jed is just annoying. And then they kill Jed, and everybody's sad, until the end where the gals learn to love one another and be supportive, instead of destructive. I give it 2 ugh's."
        },
        {
            "id": "neg_226",
            "text": "Andie McDowell is beautiful as the 40-ish woman whose late start at a serious relationship leads her to a considerably younger man and a subsequenet falling-out with 2 long-time best girldfriends.<br /><br />Seeing a gigolo/gold-digger in the sincere young man, the \"girl-friends\", dead-set on terminating this \"silly relationship\", go over and beyond the call of duty in \"helping out\" their friend (who obviously is blinded by this gigolo's tricky game\".<br /><br />A short succession of situations is absolutely ridiculous. Far fetched no longer covers it. Without these unbelievable scenes, there may have been hope for a sweet love story. Instead, all the viewer is left with is an involuntary shaking of head -- these things just don't happen! Without giving away cliff-hanger details, I warn the viewer of having high expectations for this film; most (like me) will be very disappointed. On a scale of 1 to 10, this one ranks a weak 4 with me. There is much better material out there. This one isn't worth your time."
        },
        {
            "id": "neg_227",
            "text": "Was this meant to be a comedy or a serious drama? This film starts with a light-hearted banter between three women. Fine. It moves into a conflict between the women when one of them meets a man. Fine. There are a few antics between them. Fine. But when the plot thickens and finally becomes black I started to wonder whether I had misinterpreted the first part of the movie. It continues in this vein for a while until, in the end, it tries to go back to the original light-hearted banter. But by now it's too late. It's hard to see why these women would still be talking to one another and the finale is unconvincing. Truly a lesson (for British filmmakers anyway) of how not to make films. Difficult to see how the producers ever convinced themselves this film would work. And the box office proved it to be a real flop, because I'd never heard of this film until this weekend (four years after its release)."
        },
        {
            "id": "neg_228",
            "text": "I thought it was a New-York located movie: wrong! It's a little British countryside setting.<br /><br />I thought it was a comedy: wrong! It's a drama.... Well, up to the last third, because after the story becomes totally \"abracadabrantesque\", the symbolic word for a French presidential mandate. It means, close to nonsense even it the motives would like to bring a sincere feeling.<br /><br />What Do I have left? Maybe, a good duo of actress: Yes, I know, they are 3 friends, but the redhead policewoman is a bit invisible for me. The tall doctoress surprises by her punch, and McDowell delivers a fine acting as usual, all in delicate, soft and almost mute attitude. This gentleness puzzles me, because as other fine artists or directors, the same pattern is repeating over and over. In her case, it's like, whatever the movie, it's always the same character defined by her feelings, her values, who lives infinite different stories. I still don't know how to set the limit (or the fusion) between the artists and the works.<br /><br />Another positive side of this movie is its feminine touch & the interesting different points of view. The women have each their own way of living, even if they are all single. It brings a lot of tolerance and learning to witness how a same and unique reality can be perceived in as many ways as people.<br /><br />Finally, the movie is quite viewable, but the great final cuts the desire of a next vision."
        },
        {
            "id": "neg_229",
            "text": "Caught this on IFC yesterday, and can't believe the positive reviews! Am I the only one who thought these \"ladies\" were anything but? Kate tells Jed she could get fired because she's supposed to be a pillar of the community, but puts out for him! Then they suddenly decide they're in love? And she's SO devastated over his death, she doesn't go to his funeral, much less, tell his family the \"good news\"! By the way, how did an American get to be the headmistress of a very proper British school? Janine should have been kicked off the force for her inexcusable abuse of power, but nothing happens! And she winds up boffing a con she brought in for questioning! And the less said about Molly, the better!<br /><br />As for the guilt Janine and Molly feel over Jed, please! It's the punk's own damn fault he got turned into roadkill! Where's the guilt over poor Gerald, who gets puked on? If only I could do the same to the bozos behind this \"movie\"!"
        },
        {
            "id": "neg_230",
            "text": "This was awful. Andie Macdowell is a terrible actress. So wooden she makes a rocking horse look like it could do a better job. But then remember that turn in Four Weddings, equally as excruciating. Another film that portrays England as full of Chocolate box cottages, and village greens. I mean that school, how many schools apart from maybe Hogwarts look like that? The twee police station looked like the set from Heartbeat ( a nauseating British series set in the 60s).This film just couldn't make its mind up what it wanted to be- a comedy or a serious examination of the undercurrents in women's friendships. If it had stuck to the former then the graveyard sex scenes and the highly stupid storming of the wedding might just have worked( i say just). But those scenes just didn't work with the tragedy in the second half. I also find it implausible that Kate would ever speak to Molly again after her terrible behaviour. A final note- what is a decent actress like Staunton doing in this pile of poo? Not to mention Anna Chancellor. Macdowell should stick to advertising wrinkle cream."
        },
        {
            "id": "neg_231",
            "text": "This starts off bad, what with the three women acting like simpering junior high school wussies sitting around giggling with their gin, endless cigarettes and a caramel chocolate treat for the one who tells the best 'man' story, and then it gets worse -=- spoiler alert =-= what with Andie's character falling for the young organ player who used to be her student when he was 14 (she's the headmistress of an English school, believe it or not), only to have him destroyed thanks to her bitch-from-hell 'girlfriend' . ..and then from there, it's basically unwatchable claptrap: she forgives her 'friend' and has the organ player's love child and the 3 women end up as they started, drinking more gin and smoking more cigarettes blah blah blah. Andie's character throws the caramel chocolates out in the street, in a pathetic attempt to symbolize growth. Have mercy."
        },
        {
            "id": "neg_232",
            "text": "This had to be one of the worst films ever. When Kate shows up and Jed is with a bunch of guys and they all start clapping...so Hollywood. Another bad scene was when Kate was running her hands over the pavement it appeared that she was examining the texture of the pavement. Andie's acting is so bad in this film - I could not connect with them or feel there love for each other. The other 2 women however were very good and overshadowed Andie. Anyway this was such a campy movie. I usually like these type of films but I just couldn't get into this film. Too many unlikely situations and again Andie's acting didn't help the film. Also, she is all gums. Lancome must put her makeup on with a putty knife because she looks glamorous in the commericals."
        },
        {
            "id": "neg_233",
            "text": "This film is a calculated attempt to cash in the success of Sex in the City and Four Weddings and a Funeral. In fact, if they'd called it Sex at a Funeral, they might have done better at the box office.<br /><br />But the film falls between two stools and can't get up. The characters spout improbably bright dialog, but never act in any way remotely recognizable as human. One arbitrary, senseless action follows another to advance what passes for a plot, and one soon tires of the falsity of the whole enterprise.<br /><br />Andie MacDowell gets points for acting her little heart out, but the performing honors are stolen by Imelda Staunton, as of all things, a police detective (don't they have a height requirement over there?). Ms. Staunton seems unable to make a false move. Would that we could say the same about the writer-director.<br /><br />If Notting Hill annoyed you as being bogus, stay away from this one. Phonus bolognus on the half-shell."
        },
        {
            "id": "neg_234",
            "text": "This film was choppy, incoherent and contrived. It was also an extremely mean-spirited portrayal of women. I rented it because it was listed as a comedy (that's a stretch), and because the cover said Andie McDowell was acting up a storm in it. She wasn't. I'm a gal, I watched this film with two guys, and we spent an hour afterwards exclaiming over how bad it was.<br /><br />WARNING: PLOT SUMMARY BELOW! RAMPANT SPOILERS!<br /><br />The movie starts out with a fairly hackneyed plot about an older woman who takes up with a younger man, to the severe disapproval of her two jealous single girlfriends. They want her to marry a boring guy their own age who is kind of in love with her. But she's so happy with her oversexed puppy that you're rooting for them to stick it out, and sure enough, she decides to marry the guy. But her harpy girlfriend, aided by the wishy-washy one, sets up a plot to trick our heroine into thinking the guy is cheating on her. It works. She has a fight with him, he runs out of the house and is crushed by a truck (Remember the movie's title?) So now he's dead, two-thirds of the way through the film. And although our heroine is a school headmistress who spends her time watching over girls, she apparently forgot to use birth control and is pregnant.<br /><br />She's already broken off relations with her girlfriends, because they were so unsupportive. Alone and pitiful, she decides to marry the boring guy. Did I mention that the boring guy who kind of loves her is a minister? She had asked him to marry her to the young guy (nice, huh?), but now she tells him she'll marry him, and apparently he has no objections to being dicked around in this fashion. But her girlfriends rescue her at the altar and take her home, where they not-quite-confess that they were mostly responsible for the love of her life getting smushed. She has the kid. In the final scene, they leave it in a crib inside her house while they go out on the porch to drink, smoke and be smug. I kid you not, it's that bad. I left out the part about the cancer red-herring and the harpy's ridiculous lesbian moment."
        },
        {
            "id": "neg_235",
            "text": "The fine cast cannot uplift this routine tale of a secretary murdered by her married paramour. In fact there are more questions than answers in this one-sided tale of romance and murder; and since we are only provided with the prosecution's side, none of these questions will be answered. This is the type of fare that appeals to the \"He Woman, Man Hater\" clubs of America. As presented, it is the tale of an innocent woman who just happens to be \"caught up\" in a romance with a married, high-profile attorney. Is it possible that IF, she had not been two timing her boy friend and having an affair with a married man, the whole nasty murderous, sordid incident could have been avoided? When you watch this, don't worry about going to the 'fridge, you won't miss anything."
        },
        {
            "id": "neg_236",
            "text": "I very nearly walked out, but I'd paid my money, and my nearly-as-disgusted friend wanted to hold out. After the endearing, wide-eyed innocence of \"A New Hope\" and the thrilling sophistication of \"The Empire Strikes Back,\" I remember awaiting \"Return of the Jedi\" with almost aching anticipation. But from the opening scene of this insultingly commercial sewage, I was bitterly disappointed, and enraged at Lucas. He should have been ashamed of himself, but this abomination undeniably proves that he doesn't have subatomic particle of shame in his cold, greedy heart. Episode I would go on to reinforce this fact -- your honor, I call Jarjar Binks (but please issue barf bags to the members of the jury first).<br /><br />From the initial raising of the gate at Jabba's lair, this \"film\" was nothing more than a two-plus-hour commercial for as many licensable, profit-making action figures as Lucas could cram into it -- the pig-like guards, the hokey flesh-pigtailed flunky, that vile muppet-pet of Jabba's, the new and recycled cabaret figures, the monsters, etc., etc., ad vomitum. Then there were the detestably cute and marketable Ewoks. Pile on top of that all of the rebel alliance aliens. Fifteen seconds each on-screen (or less) and the kiddies just GOTTA have one for their collection. The blatant, exploitative financial baiting of children is nauseating.<br /><br />Lucas didn't even bother to come up with a new plot -- he just exhumed the Death Star from \"A New Hope\" and heaved in a boatload of cheap sentiment. What an appalling slap in the face to his fans. I can't shake the notion that Lucas took a perverse pleasure in inflicting this dreck on his fans: \"I've got these lemmings hooked so bad that I can crank out the worst piece of stinking, putrid garbage that I could dream up, and they'll flock to the theaters to scarf it up. Plus, all the kiddies will whine and torture their parents until they buy the brats a complete collection of action figures of every single incidental undeveloped, cartoonish caricature that I stuffed in, and I get a cut from every single one. It'll make me even more obscenely rich.\"<br /><br />There may have been a paltry, partial handful of redeeming moments in this miserable rip-off. I seem to recall that Harrison Ford managed to just barely keep his nose above the surface of this cesspool. But whatever tiny few bright spots there may be are massively obliterated by the offensive commercialism that Lucas so avariciously embraced in this total, absolute sell-out to profit."
        },
        {
            "id": "neg_237",
            "text": "After being hugely entertained by Mr. Brosnan's performance as a cad in \"The Tailor of Panama\" (which I rate 10/10 across the board: casting, acting, script, story, editing, pace, music, emotional impact, etc.), I enthusiastically anticipated this film. I was hugely disappointed. It is a script reading not a film, vulgar for the sake of being vulgar, bankrupt in every way that \"The Tailor of Panama\" is rich and satisfying. Blame it on the screen writing and directing. I sat in the theater waiting for the \"good part;\" it never came. I neither laughed nor cried, although one line of dialog did make me smile. Worth $7? Hardly."
        },
        {
            "id": "neg_238",
            "text": "A Cinderella story made for adults who live in dreamland. The romance is very unrealistic, fluttery, lovey dovey, perfect etc. The Cinderella plot till the very end and Shahid Kapoor is the only reason for my stars. If you're looking for a dreamy romance with a twist, this is definitely you're movie, but for the rest of us real world people, I'd highly recommend saving your three hour watch time. Wake up people!<br /><br />Four out of the five people that saw the film with me would not recommend the film. We had a great time bashing majority of the unrealistic scenes. Maybe I'm missing something.. I just can't believe a movie like this can beat a classic like HDDCS!!"
        },
        {
            "id": "neg_239",
            "text": "I won't say this movie was bad, but it wasn't good either. I expected something good but I guess Hum Aapke Hain Kaun was much better than this. This was completely old fashioned. At every stage of this movie, I hoped for some twist and what do I get? The girl gets burned and wins her aunt's love. <br /><br />Despite of being engaged, they have to take permission for every little move they make. They are so darn shy even after so many meetings. I expected the aunt to be much more brutal than that. All she did was crib madly. <br /><br />Hey, we have kids too, but we don't watch them and have tears in our eyes always. This movie is a dream. Happy family, one cruel woman, good in-laws and a man who loves her to death. In HAHK Anupam Kher was the poor bride's father and now it's vice versa. And I somehow knew that Mohnish Behl would be in this movie. Anyway I believe I wasted my time. I give it a 2/10."
        },
        {
            "id": "neg_240",
            "text": "I never like to comment on a good film but when it comes to a bad movie, I gotta come really hard on it. Talking about Vivah, this guy, Sooraj Badjatya, seems to have completely lost it. After success of Hum Aapke Hain Kaun, he thought he can make money with cheesy wedding videos. Vivah is so so cheesy that Badjatyas have left Johars and Chopras behind.<br /><br />There was not a single moment during the movie where I can say 'Oh! at least this thing is good'. Aloknath does cliché in a role of Girl's father, Shahid kapoor looks fat and Shahrukhed, Amrita rao is another disaster in addition to ugly looking sets, bad costumes, hackneyed storyline, monstrous stepmother, trying-hard-to-act actors, cacophonous background music, cheap soundtracks.<br /><br />Now the spoiler, I'm warning you guys that as happens in all his other movies, after a calamitous incidence movie ends on a happy note."
        },
        {
            "id": "neg_241",
            "text": "In director Sooraj Barjatya's Vivah,20-something Delhi boy Shahid Kapur finds himself smitten by the demure, small-town girl his father has selected for him to marry. Drawn to her innocence and simplicity, Shahid agrees to the marriage barely moments after he's met her at her home in Madhupur, and the young lady in question Amrita Rao seems equally floored by her charming suitor. The marriage is fixed for six months later, and the couple find themselves in the first throes of young, budding love, their geographical distance notwithstanding. But Amrita, who's been raised by her uncle and her aunt after her parents' death, is struck by a horrible calamity just hours before the marriage. And then, it's up to Shahid to play the honourable lover and to embrace her unconditionally.Much in the same vein as Hum Aapke Hain Koun and Hum Saath Saath Hain, Barjatya's new film Vivah too is on one level a family drama with an extremely idealistic premise. But sadly, the plot of this new film comes off looking way too outdated, even more far-fetched than those regressive Ekta Kapoor soaps. And the problem is clear  you just can't relate to such squeaky-clean characters who don't have one bad bone in their bodies. There are many things that work in favour of and against Hindi films, and timing is one such important factor. Twenty-five years ago, perhaps the plot of Vivah may not have felt like such a stretch, but today it just seems like the product of a mind stuck in a time warp. Perhaps the film's only saving grace is the fact that it oozes sincerity from start to finish, you can make out right away that the filmmaker's intention is not to deceive. Judging both by Barjatya's previous films and by closely examining this new one you can safely declare that Barjatya believes in a perfect world, he believes in his good-as-gold characters, he believes that large families can live together happily under the same roof without the slightest bumps.But alas, he's unable to translate his vision to the screen. It's difficult to overlook how one-dimensional his protagonists are  Shahid and Amrita, both virtuous and virginal  I mean, think about it, the first time they hold hands is an hour and twenty minutes into the film. Barjatya may think he's returning to his Maine Pyar Kiya roots with Vivah, but truth is that the reason we embraced Salman and Bhagyashree in that film, or even Salman and Madhuri in Hum Aapke Hain Koun is because they had such fantastic chemistry. Because although they were created out of the same mould as Shahid and Amrita in Vivah, those pairs had mischief and masti. Shahid and Amrita are just insipid and boring.For a film that relies so heavily on music to narrate its story, the filmmaker chooses a string of 70s-style tunes that only further slacken the film's deadening pace. But if I had to choose just one reason to explain why Vivah doesn't work for me, it's because I'm not sure I can relate to any of the characters who inhabit Barjatya's story. To some perhaps, Vivah will give hope, that a perfect world like this is actually out there somewhere. But I'm a little cynical I guess. So, give me the coquettish Madhuri of Hum Aapke Hain Kaun, give me the bratty Salman of Maine Pyar Kiya, I'll even take that mischievous Karisma Kapoor of Hum Saath Saath Hain. But save me from these dullards. You know, some marriages aren't made in heaven. This one's Vivah!"
        },
        {
            "id": "neg_242",
            "text": "From a poorly contrived plot line that makes almost no sense to bad dialogue and disjointed scenes to the ultimate downer, bad acting (even Peter Falk can't find his way) \"Finding John Christmas\" is better left lost. Ms. Bertinelli's performance is without depth or emotion as are her co-stars, William Russ as brother Hank and David Cubitt as love interest Noah. Jennifer Pisana as Soccoro, the daughter of single dad Noah is almost unbearable to watch let alone listen to singing. But who can blame them with material like this. Michael J. Murray's script is juvenile at best. <br /><br />Each year at this time I search the TV guides and wait anxiously for some of the really classic Christmas and inspirational holiday films to appear on the small screen. Films like \"Miracle on 34th Street\", Ernst Lubitsch's delightful \"The shop around the corner\" and, of course the 1951 version of \"Scrooge\". There's Frank Capra's classics \"It's a wonderful life\" and \"Meet John Doe\". Hey, forget the classics. What about \"Home Alone\" or \" Home for the Holidays\" with Holly Hunter and a great performance by Robert Downey Jr.? <br /><br />My present to you is by way of advice. Your time would be better spent searching out these films than finding \"Finding John Christmas\". Merry Christmas!"
        },
        {
            "id": "neg_243",
            "text": "William Russ is the main character throughout this made for TV movie. He left his family behind to only reappear and begin paying off his debts. But he tries to keep away from his family. Thats where Peter Falk (Colombo) comes in, playing several different roles, to convince him to come home.<br /><br />The story is average and they actually managed to get a former star (Peter Falk) and use him to a fairly nice degree. But William Russ wasn't truly a star. However, it appears his acting is still OK.<br /><br />I found the delivery and story very cheesy in how everything was predictable. In fact, the last 20 minutes I could almost dictate word for word before it happened. A good movie should never be like that.<br /><br />Overall, it was a sub-par movie. In a letter grading system, it would receive a \"D\"."
        },
        {
            "id": "neg_244",
            "text": "The silent one-panel cartoon Henry comes to Fleischer Studios, billed as \"The world's funniest human\" in this dull little cartoon. Betty, long past her prime, thanks to the Production Code, is running a pet shop and leaves Henry in charge for far too long -- five minutes. A bore."
        },
        {
            "id": "neg_245",
            "text": "Beyond a shadow of a doubt Mysterious Planet is one of the worst movies ever made, yet retains an affection in my heart because the poverty of its special effects and astoundingly awful sound track in the first 15 minutes (and to be honest that's all you need to see) combine to create something that is hilariously side-splitting.<br /><br />The opening scene in 'space' is just about as unfathomable as cinematography gets, as washing-up liquid bottles whiz past your eyes to muffled dialogue. Before you've had time to work out whether it's you who's gone mad, the credits roll and the action struggles to life.<br /><br />And aside from the double-headed plasticine giant snail that terrorises our heroes, you also get the added double bonus of having both the original actors voices AND the dubbed voices at the same time. Pure genius.<br /><br />The sad thing for fans of this kind of fare is that I've only ever seen one copy, so the chances of ever seeing it yourself is highly unlikely. Perhaps I own the only copy in existence.<br /><br />"
        },
        {
            "id": "neg_246",
            "text": "This is blatantly a futuristic adaptation of Jules Verne's \"Mysterious Island\". The sound editing is pretty bad. You hear the dialogue on set and you hear the voices being recorded on a recording booth at the same time! This is an amateur film with actors from Boston and shot around New Hampshire. For those living in New Engalnd and who is reading this comment will be wowed with a capital W. This film is full of flaws. You get to hear the director's voice giving directions and giving out directions to the actress. \"OK now stand up.\" As for the other characters. There is this guy who talks with his mind instead of his voice and this blue alien. The alien guy talks with a deep voice. When he is yawning or grunting when he is fighting you hear the actor's voice. As for the special effects, man! This was Brett Piper's early work for crying out loud! The creatures are good but the animation is jerky. Really jerky. Sort of like Karl Zeman animation in JOURNEY TO BEGINNING OF TIME (1955). The special effects are imaginative. Thge music is good. Bottom line, this film makes EQUINOX or PLANET OF THE DINOSAURS look like a Ray Harryhausen epic. Did you know MYSTERIOUS PLANET was a home movie and was on a shoes string budget? A must watch for aspiring film makers."
        },
        {
            "id": "neg_247",
            "text": "It was 9:30 PM last night at my friend's camping trailer and we were so hyped to watch South Park (a new episode). The thing is, in my country, South Park airs at 10:30 PM and we decided to kill time by watching the show now airing, Father of the Pride. I'll start by saying that I have only watched to episodes. The first time I watched it, I found it unfunny and crude for nothing, so I thought ''Holy sh*t, I have a football game early tomorrow, so I have to stop watching stupid cartoons''. But yesterday, I tried to give Father of the Pride a second chance. I find that it's a complete rip-off of The Simpsons, only replacing yellow human characters by lions instead.<br /><br />The second thing is I wonder why it got it's TV-14 rating. I find The Simpsons a lot more vulgar, and the only real vulgarity in this show is a few homosexual (unfunny) jokes. The Simpsons is also a lot more violent (Halloween specials) and crude. I also heard that the creator of the series has also directed Shrek 2, well I've got news for him: Shrek 2 was way better and I think he stayed too much in the family thematic. However, I must admit that Father of the Pride did make me smile (even burst out laughing once) three or four times.<br /><br />All in all, I don't mind Father of the Pride. I don't hate it, but I don't like either. I've seen way better from ''The Simpsons''.<br /><br />3.5/10"
        },
        {
            "id": "neg_248",
            "text": "When will the hurting stop? I never want to see another version of a Christmas Carol again. They keep on making movies with the same story, falling over each other in trying to make the movie better then the rest, but sadly fail to do so, as this is not a good story. Moralistic, old-fashioned, conservative happy-thinking. As if people learn. The numerous different versions of this film prove that we don´t."
        },
        {
            "id": "neg_249",
            "text": "Saw this movie in my English class this afternoon and was surprised by how bad this version was. Don't get me wrong, George C. Scott was terrific as Scrooge, but the rest of the cast fails so very badly. Sometimes I couldn't stop laughing at the stupid acting and the repeated line: \"Merry Christmas to everyone!\" Other times I almost fell asleep.<br /><br />The movie is based on a Charles Dickens short story about a rich guy, who don't think Christmas is nothing but humbug. After 30 minutes, the rich guy is visited by three ghosts, who persuade him to celebrate Christmas after all.<br /><br />I can not understand how this movie, with a script so bad it must have been written in five minutes, can be so well-rated. Instead of this piece of garbage, I recommend to you, the Bill Murray comedy Scrooged. That at least, was funny..."
        },
        {
            "id": "neg_250",
            "text": "Having seen three other versions of the same film, I am afraid for me this is by far the weakest, primarily due to Scott's rather dull and leaden performance. His emotions throughout are so bland it makes it difficult to engage in the film. Alistair Sim portrayed the role infinitely better. When Scrooge was at his meanest, you don't get the sense Scott is saying the dialogue with much conviction and when he undergoes his metamorphosis he is similarly unconvincing. I cannot think of any actors in this film who match those from the Alistair Sim version. Even the musical version (and frankly the Muppets) take on this are better executed. Very disappointing."
        },
        {
            "id": "neg_251",
            "text": "I was sooooo excited to see this movie after finally reading the book this week. My 13 year old son was looking forward to it too. I rented it and snuggled down to enjoy a classic holiday story brought to life on screen.<br /><br />Boy, was I disappointed. This movie veered off from the book more times than is forgivable. George C. Scott is an excellent actor but in this, it seemed that he was fully into character only about 20% of the time. The rest of the time he was quite flat.<br /><br />I realize that this was made in '84, pre-CG effects, for the most part. But it looked to be very B-movie quality, especially the encounter with Jacob Marley.<br /><br />The biggest disappointment was the fact that they left out one of the most moving parts of the story: When the Spirit of Christmas Present takes Scrooge on the whirlwind tour of the world, observing people in the bleakest of circumstances still having the light and love of Christmastime.<br /><br />I will admit that Mr. Scott did a good job with the \"reformed\" Scrooge at the end. That was a refreshing portrayal.<br /><br />I wish that Bob Cratchit had been portrayed as a little more ragged and down-trodden. And Tiny Tim... oh don't even get me started on bad child actors..."
        },
        {
            "id": "neg_252",
            "text": "Uninspired direction leaves a decent cast stranded in a handsome but bland adaptation, in which dialogue seems recited rather than heartfelt, and cash strapped appearances by the ghosts fail to round up any sense of awe or magic; Edward Woodward, as the Ghost of Christmas Present, wobbles around on stilts and seems to be doing an impression of Bernard Cribbins. As Scrooge, George C. Scott is too wry, and he never seems to truly believe in it, which robs his performance of its effect. The scenes in which he's shown his past have as much impact as if he was half-heartedly flicking through his family album. No one else seems to be putting any effort in, except Frank Finlay, who chronically overacts."
        },
        {
            "id": "neg_253",
            "text": "The premise of the movie has been explained and if you've gotten this far you don't me to pretend that I'm a movie critic. With that being said my own opinion of the movie is quite low. I'm a fan of Takashi Miike but this goes down in the category of his not so great work along with DOA 2 and 3, and some others (many).<br /><br />The movie seems to get a free pass because it is a Takashi film and nothing Takashi does can be wrong. This is a highschoolers approach to cinema. For the rest of us we'll find and hour and a half of a kid screaming for no real reason completely annoying (and yes, this does take away from the film), the pace of the film almost reaching levels of rigomortis, and the acting...well...hmmm. <br /><br />If one is a Takashi fan you'll see it regardless to peak your interests. It lacks any originality (see the Neverending Story) or any character development from the lead character in the face of conflict other then a quite superficial one. <br /><br />As it has been pointed out this is the first film Miike has been credited with co-writing, but that doesn't mean much as non of what we'd hope would be Miike's personality would spill over into the screen. All we get are some of the token Miike shots vis the director of photography.<br /><br />The movie had the potential to be something great. The premise is not a difficult one to run wild with. But this one seemed to have been run into the ground.<br /><br />My suggestion is if you're just getting into Miike is go with some of the standards like Gozu, Ichi, and Audition. Then movie into his works like Blue's Harp, Fudoh, Rainy Dog, Bird People of China."
        },
        {
            "id": "neg_254",
            "text": "Ah, Bait. How do I hate thee? Let me count the ways. 1. You try to be funny, but are corny and unenjoyable; every joke is predictable and expected, and when it comes, does not inspire laughter. Instead, I want to hurl. 2. You try to be dramatic, but are unbelievable; the woman overacts to a terrible degree, and the \"bad guy\" looks like Bill Gates, and is about as scary as...well, Bill Gates. (Just try to imagine Bill Gates trying to intimidate somebody with a gun. Doesn't work, does it? A lawyer, maybe, but not a gun. Doesn't fit.) As for Jamie Foxx, well, just watching him try to deliver a dramatic and heartfelt dialogue is ludicrous, and makes me want to hurl. 3. You try to be action-packed, but instead are dull and dragging too many times. And when the action heats up, the tripod for the camera must have been lost, for the scenes wobble more than those in The Blair Witch Project, and I find myself nauseated, and once again I want to hurl. 4. You try to be a good movie, but you failed, you FAILED, YOU FAILED! I would rather walk barefoot across the Sahara with a pack full of beef jerky and no water, no sunscreen, and only Meryl Streep for company. This hell would be lovelier than a single minute more spent watching everyone in Bait overact their way through an idiotically written story with Bill Gates for a bad guy, and let's not even talk about the massive bomb that goes off in a car that Jamie Foxx's character has just driven OFF A CLIFF, but somehow manages to escape...just kill me now, or do the right thing and promise me that somehow I'll never have to watch a movie that is this bad, ever again."
        },
        {
            "id": "neg_255",
            "text": "Are you familiar with concept of children's artwork? While it is not the greatest Picasso any three-year-old has ever accomplished with their fingers, you encourage them to do more. If painting is what makes them happy, there should be no reason a parent should hold that back on a child. Typically, if a child loves to paint or draw, you will immediately see the groundwork of their future style. You will begin to see their true form in these very primitive doodles. Well, this concept of children's artwork is how I felt about Fuqua's depressingly cheap and uncreative film Bait. While on all accounts it was a horrid film, it was impressive to see Fuqua's style begin emerging through even the messiest of moments. If you have seen either Training Day or King Arthur, you will be impressed with the birth of this director in his second film Bait. While Foxx gives a horrid, unchained performance, there are certain scenes, which define Fuqua and demonstrate his brilliance behind the camera. Sadly it only emerged in the final thirty minutes of the film, but if you focus just on those scenes, you will see why Fuqua's name appears on so many \"Best Of\" film lists.<br /><br />I will never disagree with someone that Fuqua's eye behind the camera is refreshing and unique. His ability to place a camera in the strangest of places to convey the simplest of emotions is shocking. I am surprised that more of Hollywood hasn't jumped aboard this bandwagon. Even in the silly feature Bait, you are witness to Fuqua's greatness. Two scenes that come directly to mind are the explosion scene near the middle of the film and the horse scene close to the end. In both of these scenes I saw the director Fuqua at work. Alas, in the rest of this film, all I saw was a combination of nearly every action film created. The likable hero down on his luck that suddenly finds his life turned around by some unknown force is a classic structure that just needs to die in Hollywood. We have seen this two often, and no matter who you are (unless you are Charlie Kaufmann), you cannot recreate the wheel. It is just impossible with this genre, and it is proved with Bait. I was annoyed with Fuqua for just sitting back and allowing this to happen, which could explain why it took me three viewings to finish this film. I was just tired of the structure, and while I hoped that Fuqua would redefine it, he did not.<br /><br />Then, there was the acting. While Jamie Foxx has never impressed me as an actor, I was willing to give this helmed vehicle a try. I wanted to see if he could pull off another dramatic role similar to Collateral. I was under the impression that perhaps this was the film chosen to show producers that Foxx could handle the role in Collateral. Again, I was disappointed. Foxx was annoying. Not in the sense that it was the way that his character was to be, but in the sense that it felt as if neither Fuqua nor Foxx took the time to fully train Foxx on what should be ad-libed and what should be used to further the plot. Instead, we are downtrodden with scene over scene of Foxx just trying to make the audience laugh. Adding second long quips and culture statements just to keep his audience understanding that he was a comedian first, an actor second. Fuqua should have stopped this immediately. Foxx's jokes destroyed his character, which in turn left me with nothing solid to grasp ahold of. Instead of character development, he would crack a joke. Neither style worked, no joke was funny. The rest of the cast was average. By this I mean I have seen them all in similar roles. They were brining nothing new to the table, nothing solid to the story, and nothing substantial to the overall themes of the film. They were pawns filling in dead air space. Fuqua had no control over this mess, and the final verdict only supports that accusation.<br /><br />Overall, this was a sad film. With no creativity in sight and unmanaged actors just trying to upstage themselves, what originally started as a decent story eventually sunk faster into the cinematic quicksand. Foxx was annoying, without character lines, and a complete bag of cheese. In each scene I saw no emotion, and when emotion was needed to convey a message, he chose to take his shirt off rather than tackle the issues. Are my words harsh? I don't think so. When you watch any movie you want to see some creativity, some edible characters, and themes that seem to hit close to home. Bait contained none of these. While I will give Fuqua some credit for two of the scenes in this film, the remaining five hundred were disastrous. Apparently, I took the bait when renting this film, but now having seen it, hopefully I can stop others from taking that curious nibble.<br /><br />Grade: ** out of ***** (for his two scenes that were fun to watch)"
        },
        {
            "id": "neg_256",
            "text": "What? Is Jamie Foxx supposed to be funny?Does he really believe he is funny?Well, it's funny watching his confidence in being funny.The man has no identity whatsoever...I mean you can immediately see who his idols are, Denzel Washington and Martin Lawrence, because he tries really hard to imitate them in most of his movies.The only problem is that he does it bad, uneven, and what comes out are some parts where he somewhat looks like Denzel, with that macho-s**t attitude and then abruptly goes to being Martin Lawrence, the funny and clumsy-silly comic. There's no personal touch to all that, I mean he contributes nothing to the personality he tries to sell, and I'm sure he has nothing to say personally. He really is Mr. Dull-boy in person.<br /><br />I was really hoping Hollywood, and the black community in America would find somebody better to launch into super stardom, like Don Cheadle for example, but perhaps the pathetic Jamie better represents the generation that remixes the old."
        },
        {
            "id": "neg_257",
            "text": "I love Jamie Foxx.<br /><br />And I enjoy 99% of all movies I see.<br /><br />And I walked out of this one.<br /><br />Now, I admit, it may have had something to do with the two middle-aged white women in the back of theatre who laughed at every little thing (\"Oh no, Jamie's knocking on a door! HEE HEE HEE!\"), but... this was just so incredibly annoying. There could be no sustained camera shot, and no camera shot from a conventional angle... everything had to be in-your-face, loud, and annoying.<br /><br />The bad guy tried to be smooth and Malkovich-like, but at this point, it's just old and tired. He brought nothing new or interesting. From all the characters, too many lines you saw coming, too many you've heard before, and too many \"tough guy\" lines... and I don't mind that sort of thing, really, as long as there's a bit of originality to it. In fact, pretty much the entire supporting cast just sucked.<br /><br />I love Jamie Foxx, and I think he's really funny, and I thought he was funny in this movie... but not nearly funny enough for me to endure everything else. <br /><br />This movie needed less shoot-em-up, less annoying camera shots, more emotion, more feeling, and more Jamie Foxx. I gave it a 2."
        },
        {
            "id": "neg_258",
            "text": "This is the first time I ever saw a movie with Jamie Foxx, and I bet it will be my last. I failed to see why he was funny, although people in the audience thought it was very funny when he made a face to the camera, or for saying \"I am going to take a shower\".<br /><br />The plot is completely predictable. The bad guy comes after the good guy. The good guy has a woman, so the bad guy uses her. In between, the officials screwing up. The final scenes are utterly unbelievable. You spend 2 years and millions of dollars chasing a guy, but you don't do your home work to solve a trivial riddle?<br /><br />There's no great acting, there isn't much of a plot or storyline, and the shooting is done MTV style. Don't waste your money on this one.<br /><br />"
        },
        {
            "id": "neg_259",
            "text": "photography was too jumpy to follow. dark scenes hard to see.<br /><br />Had good story line too bad it got lost somewhere. Too noisy for what was really happening Bottom line is it's a baddddd movie"
        },
        {
            "id": "neg_260",
            "text": "Well, i can and will be very short. This is a wrong-balanced, non-convincing film that could have been a little bit better. The script seems to not know which way to go ... from funny to cliche-wise serious... it's a bit silly. That plus too much sentences we have heard before \"the hacker is in florida, or no, he is in madrid, no he is in ... , he is screwing the signal\". <br /><br />4 out of 10"
        },
        {
            "id": "neg_261",
            "text": "Jamie Foxx is fun but this movie has been done before. The bad guy plays a \"malkovichian\" character from \"In the Line of Fire\". The cops will do anything to find the bad guy - and of course the good guy has two sets of bad guys and one set of cops after him - all the while he is just trying to turn over a new leaf..."
        },
        {
            "id": "neg_262",
            "text": "Jamie Foxx is my favorite comedian. However, I feel that he sold out in order to gain his first big budget lead role. Foxx follows in the footsteps of the likes of Chris Tucker, Martin Lawrence and Dave Chapple, who have all seen their talents wasted by stereotyping producers who think black males who commit pretty crimes is a funny concept (See: Money Talks, Blue Streak).<br /><br />Okay I laughed a few times and granted all of these comedians continue to pick up hilarious roles, but I would love to see these guys branch out ala Marlon Wayans portrayal in Requiem to a Dream. Or In Living Color's Tommy Davidson and Damon Wayans moving performances in Spike Lee's satire Bamboozled."
        },
        {
            "id": "neg_263",
            "text": "After a day at work, I sat down to relax and turned on the movie channels. The movie came up on the guide and sounded interesting so I tuned in just before it started. The first 30 minutes were enough to make me interested, but the lack of acting ability in Jamie Foxx and the slow plot movement made me want to get up and find food during the movie. If there is any credit to be given for acting in this movie it should go to David Morse who at least tries to make the movie interesting. All in all, don't plan on impressing your friends by picking this one as a renter for a movie night."
        },
        {
            "id": "neg_264",
            "text": "...that Jamie Foxx would ever deliver such a wonderful, Oscar-winning performance. One of the reasons why I was so impressed with Foxx's performance in \"Ray\" was because from watching his hammy, obnoxious acting in movies like \"Bait\" and \"Booty Call,\" I would never imagine he would ever hold the Oscar. If people told me five years ago that Jamie Foxx was one day going to win an Oscar, I would laugh right in their faces. Who knows? Maybe he's better off sticking to drama, because if you watch \"Bait,\" it's clearly evident that comedy is not his forte. I swear, Jamie mugs so much in this movie that I'm surprised his face didn't fall off. And why does he have to do those stupid voices at every chance he gets? Anyone familiar with comedians like Bob Newhart and Steven Wright knows that doing comedy doesn't require being loud and obnoxious. If a joke is funny, it's funny. If it's not funny, then doing some crazy accent is not going to make it any funnier. The problem I have with some comedians who decide to try acting is that they favor getting laughs over being in character. In real life, normal people don't always have witty comebacks and quips. Like Albert Brooks said in an interview discussing his character in \"Taxi Driver,\" it's important to be funny as your character, rather than be funny as a comedian. A prime example of Jamie violating that rule is the nauseatingly awful scene where his mug shots are being taken, and he starts posing for the photographs like a model. If a regular person were being thrown in jail, would he really be acting goofy while having his mug shots taken? And wouldn't the police try to scold him if he was? There are many scenes like that throughout the film. Another awful sequence is one where Jamie is on the unwittingly on the phone with the villain, and he starts doing a phony Caribbean accent. Not funny! Not to mention Jamie never seems to acknowledge the timing of a joke. Giving a comedic performance requires patience, whereas he goes straight to the punchline, whether it's the right time for it or not. I'm not even a big Mike Epps fan, but even his performance is good in comparison to Jamie's. As a matter of fact, this is the first time I felt somewhat relieved whenever he would appear on screen. Epps has the same flaws when it comes to comedy, but at least he chooses a more low-key approach. One of the few bright spots in this clunker of a comedy is David Morse, a highly underrated actor mostly known for his supporting roles as villains. He seems to be the only actor in the film concerned with grounding it in reality. However, fellow \"Green Mile\" star Doug Hutchison is disgustingly over-the-top as the villain. A big surprise, considering he gave a superb performance in \"The Green Mile,\" also playing a heavy. Antoine Fuqua has proved his directing chops in movies like \"The Replacement Killers\" and \"Training Day.\" Even in \"Bait,\" he shows he can direct a hell of an action sequence. His only problem seemed to be in disciplining Jamie Foxx, who probably improvised half the script with one bad joke after another. Unless you're a die-hard fan of Foxx, please don't take the bait."
        },
        {
            "id": "neg_265",
            "text": "The plot of this terrible film is so convoluted I've put the spoiler warning up because I'm unsure if I'm giving anything away. The audience first sees some man in Jack the Ripper garb murder an old man in an alley a hundred years ago. Then we're up to modern day and a young Australian couple is looking for a house. We're given an unbelievably long tour of this house and the husband sees a figure in an old mirror. Some 105 year old woman lived there. There are also large iron panels covering a wall in the den. An old fashioned straight-razor falls out when they're renovating and the husband keeps it. I guess he becomes possessed by the razor because he starts having weird dreams. Oh yeah, the couple is unable to have a baby because the husband is firing blanks. <br /><br />Some mold seems to be climbing up the wall after the couple removes the iron panels and the mold has the shape of a person. Late in the story there is a plot about a large cache of money & the husband murders the body guard & a co-worker and steals the money. His wife is suddenly pregnant. <br /><br />What the hell is going on?? Who knows?? NOTHING is explained. Was the 105 year old woman the child of the serial killer? The baby sister? WHY were iron panels put on the wall? How would that keep the serial killer contained in the cellar? Was he locked down there by his family & starved to death or just concealed? WHO is Mr. Hobbs and why is he so desperate to get the iron panels?? He's never seen again. WHY was the serial killer killing people? We only see the one old man murdered. Was there a pattern or motive or something?? WHY does the wife suddenly become pregnant? Is it the demon spawn of the serial killer? Has he managed to infiltrate the husband's semen? And why, if the husband was able to subdue and murder a huge, burly security guard, is he unable to overpower his wife? And just how powerful is the voltage system in Australia that it would knock him across the room simply cutting a light wire? And why does the wife stay in the house? Is she now possessed by the serial killer? Is the baby going to be the killer reincarnated? <br /><br />This movie was such a frustrating experience I wanted to call my PBS station and ask for my money back! The ONLY enjoyable aspect of this story was seeing the husband running around in just his boxer shorts for a lot of the time, but even that couldn't redeem this muddled, incoherent mess."
        },
        {
            "id": "neg_266",
            "text": "You'd better choose Paul Verhoeven's even if you have watched it."
        },
        {
            "id": "neg_267",
            "text": "The episodic version of Robert Heinlein's Starship Troopers plays out at a deathly slow pace, following Johnny Rico leaving his parents, the (not very attractive) girl he lusts for, and joining the mobile infantry. The aliens in the show are nothing like the barbaric bugs from the film, instead being squid-like monsters that shoot lasers out of their mouths.<br /><br />Throughout watching this version, I was continually amazed at just how fruity they've managed to make the whole thing. The show is concerned mostly with the relationships between the recruits, and the aching, prolonged gazes they give each other through their battle armour visors, with 80s synth pop sometimes arriving *during* the sparse battle sequences which at last turning up in the final few episodes. In terms of construction, it owes a debt to Top Gun, sharing much in terms of pacing and content (and all that implies)."
        },
        {
            "id": "neg_268",
            "text": "1 How is it that everyone can understand each other perfectly without devices like universal translators or translator microbes? Did the creators of this show realize that people who were taken from different parts of the earth, in different time frames (Attilla the Hun wasn't a contemporary of preliterate Hellenic cultures, nor were the Vikings contemporary to the Pyramid builders) speak different languages and can never develop a language so similar to modern day English(except for the inflections they \"do not\" use), which has been influenced by Latin, ancient Greek, Danish and French? <br /><br />2 Cultural differences can't be overcome so easily, trust has to be won, yet everywhere the team arrives they are welcomed without any suspicion and start ordering people around like they are their appointed leaders. Of course real fans would comment that they are perceived as gods. The people they meet should be shocked by their technology and accuse them of witchcraft and the like.<br /><br />3 Historical background: none. Visually it might vaguely remind you of Greek or Viking culture, but anyone can dress in a bunch of tablecloths or run to a local costume rental for a plastic helmet with horns and claim to look the part. A small-town theater group probably has better props.<br /><br />4 Boring! Another lame Canuck production, which inexplicably ran for ten long years. As a kids show it could make the grade, but anyone who has a little knowledge about human behavior and language couldn't bear to even watch the first twelve episodes of season 1, like I just did. I very much wanted to believe I had found a decent sci-fi show, otherwise I would shut it of and cleansed my computer of this refuge after the first five minutes!"
        },
        {
            "id": "neg_269",
            "text": "Having seen the first ten episodes, I must say this show sucks. <br /><br />What bothers me the most, is that the show was shot in Canada. I know it's cheaper, but they should have shot it in California, so we could have had scenes in the desert. That would have been more true to the movie. The first scene where they are outside in another world is in the mountains, with lots of pinetrees where it looks cold. That does'nt feel very Egyptian. What worked so well in the movie was that it felt like you were in the ancient Egypt. Here it feels like they're running around fighting aliens in a Canadian forrest. And it's so lame that appaerantly, on other planets, the fall comes as well. You can see leaves on the ground in the forrests that all look like forrests outside Vancouver. It just makes the show even more unbelievable and dumb. <br /><br />And then there is Richard Dean Anderson. He is no Kurt Russel. Sure he does a decent job and he tries to copy Russels performance a little bit, but he is just not as cool as Russel. And not nearly as good an actor as Russel. And Russells way of playing O Neill, well he was much more cynical. Andersons O Neil, is way too soft. I liked it that Russels version just did'nt give a s*** and had no trouble detonating the bomb until the very end of the movie. <br /><br />Michael Shanks does a really good job as Jackson though taking over from James Spader.<br /><br />Teal'c is a really annoying character. He is Jaffa. Not a Jaffa. Just Jaffa. Aaaarrgh!! A former bodyguard of a pathetic Ra character, seen only in the pilot and in one other episode so far. Teal'c speaks talks and acts like a robot. I've seen better acting from Jean Claude Van Damme.<br /><br />And the fact that Teal'c and the Ra character and the people they saved in the movie, can speak English all of a sudden is also incredibly dumb. What made the aliens so scary in the movie was that they spoke an ancient language and were real monsters. <br /><br />As for the special effects, they are really good in the pilot. But the very rare effects in the actual show are badly done and looks cheap. Especially a planet they visit with crystals. It's so obvious they walk around on a soundstage with a badly made painting in the background. It's an insult to us viewers that they made it look so cheap. Especially when they could have made it in front of a bluescreen with cgi backgrounds. <br /><br />The X-files had better effects when they aired their first episodes in 1993. That was 4 years before SG-1 started. And they did'nt have the apparent two million dollar budget per episode, that SG-1 supposedly had. They must have spend all the money on catering. Because I don't see it on the screen. <br /><br />Incredibly boring and pointless show, that could have been great if they had shot the show in Hollywood with a bigger budget and better writers and better characters."
        },
        {
            "id": "neg_270",
            "text": "Im watching it now on pink (Serbia TV station) and I must say this is a crap. Shallow, no acting, effects too sloppy I mean, who made this series?<br /><br />This was a stupid attempt of the Studios to make some more money on the success of the film. OK. The film was great in 1994 when it came out. But the series?<br /><br />Some times you can see how idiotic the lines are in the speech of the characters. I mean, did they actually pay someone to write that, was that someones relative at the Studio? This is no SciFi.<br /><br />The film was the bomb, the series suck."
        },
        {
            "id": "neg_271",
            "text": "I cannot believe how popular this show is. I consider myself an avid sci-fi fan. I have read countless sci-fi novels and have enjoyed many sci-fi movies and TV shows. I really wouldn't even consider this true sci-fi. Every episode I have sat through was like a lame, watered down version of a Star Trek episode, minus anything that might make it interesting or exciting.<br /><br />It's basically a bunch of people standing around in ARMY fatigues, talking about something boring, who occasionally go through the Stargate and end up on a planet that looks just like Earth, with people who look and sound just like Humans! It seemed extremely low budget. The characters are all forgettable one dimensional cutouts, and the many attempts at humor fall flat. It reminds me when you see a commercial with a famous athlete in it, trying to be funny, but he is not. It is just sad.<br /><br />The movie was terrible as well. There is so much you can do with a portal through space, yet every place the ARMY people go is BORING! This shows no imagination! I actually thought the TV series \"Alien Nation\" from a few years back (based on the movie Alien Nation) was much better. That show actually had good story lines and decent characters. I wasn't crazy about \"Alien Nation\", but compared to this overrated crap, it was great!<br /><br />Also, unlike the great new \"Battlestar Galactica\" series, \"Stargate\" copied the look and feel of the lame movie too closely! They should have at least updated the cheesy \"toilet flushing\" special effect of whenever somebody goes through the Stargate."
        },
        {
            "id": "neg_272",
            "text": "When I was younger I really enjoyed watching bad television. We've all been guilty of it at some time or another, but my excuse for watching things like \"Buck Rogers in the 25th Century\" and \"Silver Spoons\" is this: I was young and naive; ignorant of what makes a show really worthwhile.<br /><br />Thankfully, I now appreciate the good stuff. Stargate SG-1 is not good. The 12 year-old me would love every hackneyed bit of it, every line of stilted dialogue, every bit of needless technobabble. The writing is beyond insipid; so bland and uninspired it makes one miss Star Trek: Voyager. If your show makes me long for the worst Trek show ever, you're in trouble.<br /><br />The film Stargate is a wonderful guilty pleasure, anchored by two solid performances by James Spader and Kurt Russell, full of fascinating Egyptian architecture and culture, a wonderful musical score, and cool sci-fi ideas. With the exception of a little of the original music, none of what made the film fun appears in this show. Even Richard Dean Anderson, who made MacGyver watchable and Legend interesting, seems like he's half asleep most episodes.<br /><br />The budget must have been very low because the sets sometimes look like somebody's basement. The cinematography isn't much better, as vanilla and dull as the scripts. It amazes me that shows with a lot more style (like Farscape) and substance (like the reimagined Battlestar Galactica) have smaller, less rabid fanbases than this pap. It just doesn't deserve it."
        },
        {
            "id": "neg_273",
            "text": "The sign of a classic movie is that it ages like a fine red wine. This movie is no Cabarnet and certainly no Casablanca. I agree with the other reviewers that the children in the movie are an unfortunate mutation that now plagues us nightly in sit-coms and the dialogue is stilted and preachy. But let's look at the obsolete theme of the movie.<br /><br />With the passage of sixty plus years of history comes wisdom. Since Watch on the Rhine, author Lillian Hellman has been exposed as a Bidenesque plagiarist with her so called real-life story \"Julia\" from her book \"Pentimento\". As one of the most odious of a plethora of Western-based USSR apologists, it is obvious her theme in the play and movie was to stir America to action to save the bloody Soviet dictator Stalin and international communism from the fascists, who had just proved their military superiority in Spain.<br /><br />As one reviewer correctly noted, this is not a pro-American play and movie, as Lillian went to her grave an American-loathing communist. This film chronicles that familiar smug stupidity of the intellectual elites that made up the American Left then, just as now the full mooner Left of The Daily Kos and Michael Moore has bought into the conspiracy theories and once again given aid and comfort to those who would destroy America."
        },
        {
            "id": "neg_274",
            "text": "There seems to be little in the way of middle ground where Watch On the Rhine is concerned. One either likes it very much, applauding its sincerity, its liberal point of view and fine acting, or else loathes its obvious propaganda, mediocre dialogue, cardboard characters and overall tendentiousness. I fall very much in the latter category, and found the film and play,--concerning the activities of European refugees in Washington during wartime--a crushing bore, worthwhile mostly for the acting, and even then only intermittently. That author Lillian Hellman was on the side of the angels is irrelevant. Her plays were written for people who shared her point of view, and she seldom explored ideas that weren't already held by the author and audience except to point out how dreadful the \"other side\" is. Even when I find myself in one hundred percent agreement with what she has to say,--as in Rhine--I still can't stand the way she says it. Her characters are unreal, and while her ear for dialogue shows a certain facility for the way people talk she possesses no real brilliance or originality. She really had nothing new to say. I thoroughly agree with the late Mary McCarthy's long overdue dismantling of Hellman reputation some years ago. For those who think the theatre is dead or in extremis and yearn for the good old days, I urge a peek at Watch On the Rhine, as bad in its way as Angels In America, which only goes to show that the theatre had one foot in the grave sixty years ago."
        },
        {
            "id": "neg_275",
            "text": "It as absolutely incredible to me that anyone could make the comment that this film is not preachy. It is not only oppressively preachy, but absurd, stagebound, dramatically straight-jacketed, and painfully overwrought. Watching it, one feels like an 8 year old child being punished by having to write \"I will not become a fascist\" on the blackboard 100 times.<br /><br />Now I understand that it was made during the height of WW2, and was intended to be a brave condemnation of Hitler and the terrible suffering he brought about, (which anyone would whole-heartedly applaud) and I'm sure it accurately captured the mood of the day. But it is presented in such an immature, over-obvious, sledgehammer way, it fails abysmally as a work of art.<br /><br />The only good performances here are from Paul Lukas, who brings sincerity and intensity to his role as a quietly heroic anti-fascist; and Lucile Watson as the amusingly ill-mannered rich grandmother who slowly comes to realize how dangerous the world has become. Though their rootless upbringing has subjected them to all kinds of hardships, the children are ridiculously shown as robotically well-behaved little snips. They do not even remotely resemble real human beings. And Bette Davis, a great actress, here is so one dimensionally noble I cringed every time she was on screen. Her every word, her every gesture is meant to convey how SUPPORTIVE and UNDERSTANDING she is of the SACRIFICES her husband has to make and the great CAUSE he is fighting for, that she must've been wired to receive a painful electric shock if she dared allowed any hint of doubt or shading to surface in her portrayal.<br /><br />So yes, this is a very IMPORTANT film, just not a very good one."
        },
        {
            "id": "neg_276",
            "text": "The characters are cliched and predictable, with everyone being either snow-white pure or wholly evil. The acting is too stilted for it to be bad in an amusing, over-the-top way. It's doubly disappointing if you're a Bette Davis fan, because her character is not a typically fun Bette-Davis-type character; she just gets to frown pensively a lot.<br /><br />On the whole, neither my wife nor I found the movie to be interesting, moving or enjoyable at all."
        },
        {
            "id": "neg_277",
            "text": "Lillian Hellman's play, adapted by Dashiell Hammett with help from Hellman, becomes a curious project to come out of gritty Warner Bros. Paul Lukas, reprising his Broadway role and winning the Best Actor Oscar, plays an anti-Nazi German underground leader fighting the Fascists, dragging his American wife and three children all over Europe before finding refuge in the States (via the Mexico border). They settle in Washington with the wife's wealthy mother and brother, though a boarder residing in the manor is immediately suspicious of the newcomers and spends an awful lot of time down at the German Embassy playing poker. It seems to take forever for this drama to find its focus, and when we realize what the heart of the material is (the wise, honest, direct refugees teaching the clueless, head-in-the-sand Americans how the world has suddenly changed), it seems a little patronizing--the viewer is quite literally put in the relatives' place, being lectured to. Lukas has several speeches in the third-act which undoubtedly won him the Academy Award, yet for the much of the picture he seems to do little but enter and exit, enter and exit. As his spouse, Bette Davis enunciates like nobody else and works her wide eyes to good advantage, but the role doesn't allow her much color. Their children (all with divergent accents!) are alternately humorous and annoying, and Geraldine Fitzgerald has a nothing role as a put-upon wife (and the disgruntled texture she brings to the part seems entirely wrong). The intent here was to tastefully, tactfully show us just because a (WWII-era) man may be German, that doesn't make him a Nazi sympathizer. We get that in the first few minutes; the rest of this tasteful, tactful movie is made up of exposition, defensive confrontation and, ultimately, compassion. It should be a heady mix, but instead it's rather dry-eyed and inert. ** from ****"
        },
        {
            "id": "neg_278",
            "text": "I'm trying to picture the pitch for Dark Angel. \"I'm thinking Matrix, I'm thinking Bladerunner, I'm thinking that chick that plays Faith in Angel, wearing shiny black leather - or some chick just like her, leave that one with us. Only - get this! - we'll do it without any plot, dialogue, character, decent action or budget, just some loud bangs and a hot chick in shiny black leather straddling a big throbbing bike. Fanboys dig loud bangs and hot chicks in shiny black leather straddling big throbbing bikes, right?\"<br /><br />Flashy, shallow, dreary, formulaic, passionless, tedious, dull, dumb, humourless, desultory, barely competent. Live action anime without any action, or indeed any life. SF just the way Joe Fanboy likes it, in fact. :("
        },
        {
            "id": "neg_279",
            "text": "Wow, here it finally is; the action \"movie\" without action. In a real low-budget setting (don't miss the hilarious flying saucers flying by a few times) of a future Seattle we find a no-brain hardbody seeking to avenge her childhood.<br /><br />There is nothing even remotely original or interesting about the plot and the actors' performance is only rivalled in stupidity by the attempts to steal from other movies, mainly \"Matrix\" without having the money to do it right. Yes, we do get to see some running on walls and slow motion shoot-outs (45 secs approx.) but these scenes are about as cool as the stupid hardbody's attempts at making jokes about male incompetence now and then.<br /><br />And, yes, we are also served a number of leads that lead absolutely nowhere, as if the script was thought-out by the previously unseen cast while shooting the scenes.<br /><br />Believe me, it is as bad as it possibly can get. In fact, it doesn't deserve to be taken seriously, but perhaps I can make some of you not rent it and save your money."
        },
        {
            "id": "neg_280",
            "text": "God, I was bored out of my head as I watched this pilot. I had been expecting a lot from it, as I'm a huge fan of James Cameron (and not just since \"Titanic\", I might add), and his name in the credits I thought would be a guarantee of quality (Then again, he also wrote the leaden Strange Days..). But the thing failed miserably at grabbing my attention at any point of its almost two hours of duration. In all that time, it barely went beyond its two line synopsis, and I would be very hard pressed to try to figure out any kind of coherent plot out of all the mess of strands that went nowhere. On top of that, I don't think the acrobatics outdid even those of any regular \"A-Team\" episode. As for Alba, yes, she is gorgeous, of course, but the fact that she only displays one single facial expression the entire movie (pouty and surly), makes me also get bored of her \"gal wit an attitude\" schtick pretty soon. You can count me out of this one, Mr. Cameron!"
        },
        {
            "id": "neg_281",
            "text": "Awful, simply awful. It proves my theory about \"star power.\" This is supposed to be great TV because the guy who directed (battlestar) Titanica is the same guy who directed this shlop schtock schtick about a chick. B O R I N G.<br /><br />Find something a thousand times more interesting to do - like watch your TV with no picture and no sound. 1/10 (I rated it so high b/c there aren't any negative scores in the IMDb.com rating system.)<br /><br />-Zaphoid<br /><br />PS: My theory about \"star power\" is: the more \"star power\" used in a show, the weaker the show is. (It's called an indirect proportionality: quality 1/\"star power\", less \"sp\" makes for better quality, etc. Another way to look at it is: \"more is less.\")<br /><br />-Z"
        },
        {
            "id": "neg_282",
            "text": "What was an exciting and fairly original series by Fox has degraded down to meandering tripe. During the first season, Dark Angel was on my weekly \"must see\" list, and not just because of Jessica Alba.<br /><br />Unfortunately, the powers-that-be over at Fox decided that they needed to \"fine-tune\" the plotline. Within 3 episodes of the season opener, they had totally lost me as a viewer (not even to see Jessica Alba!). I found the new characters that were added in the second season to be too ridiculous and amateurish. The new plotlines were stretching the continuity and credibility of the show too thin. On one of the second season episodes, they even had Max sleeping and dreaming - where the first season stated she biologically couldn't sleep.<br /><br />The moral of the story (the one that Hollywood never gets): If it works, don't screw with it!<br /><br />azjazz"
        },
        {
            "id": "neg_283",
            "text": "to movie,this movie felt like one of those after school specials,only lower budget and lower everything else.i guess this was supposed to an inspirational movie of some sort,but it didn't work for me.yet some how it comes across as preachy.it has very pale shades of Flash Dance,but so what?there just isn't any excitement in this movie.the dialogue is contrived and clichéd to death.of course,the whole movie feels like a bad 80's cliché.the acting was less than stellar,though that has a lot to do with what the actors were given(or in this case-not)to work with.on top of that is the poor song choices,with really bad lyrics.i felt embarrassed for all the actors involved.they are all talented,but you can't tell from this movie.this is just my opinion of course,but i have to give Flying AKA Dream to Believe a 1/10"
        },
        {
            "id": "neg_284",
            "text": "I only today, picked this up at the 99 cents only store today, and I still think I got ripped off. \"Dream to Believe\" is a pretty boring and unrealistic gymnastics drama and $1 is just too freakin' expensive for this. This film is probably only notable for 2 things: 1. It has a young Keanu Reeves. And 2. It's directed by Paul Lynch, the man who also did Promo Night. Now onto the movie. <br /><br />It's about a girl named Robin (Played by Olivia D'Abo) who is badly injured from a car accident that also cost her father's life. So the accident prevents her from competing in gymnastic tournaments, she is often picked on during her classes and eventually she meets some wild kid named Tommy (Played by Keanu.) Robin, when not in training, works part-time, along with her mother and stepsister, at a Laundromat owned by her abusive stepfather. Eventually she is chosen to compete. <br /><br />Overall, Keanu alone and some catchy 80s tunes are what prevent me from giving this 1 star, and it's also not one of the worst movies ever, but still far from good. The DVD itself is not getting any medals either as it appears to be sourced from an old VHS and towards the end, the sound goes out of sync and when the end credits are almost over, it fades to black, even though sound can still be heard. So this can probably be passed as a bootleg. The DVD artwork makes no sense either as it has what appears to be recent photos of Keanu and Olivia and the background has nothing to do with the movie, as it's also not in the movie itself, so the cover's obviously photoshopped. In any case, avoid at all costs, unless you're a Keanu fanatic. I probably won't be hanging to it any longer. I'm probably gonna give it to The Cinema Snob, who's a great YT critic btw. Hey, if any of you have any crappy movies that they no longer want in their sight, feel free to donate to him to keep his show running."
        },
        {
            "id": "neg_285",
            "text": "It's not really about gymnastics; swap out the occasional training montages and it could just as easily be about archery, or microbiology, or a booger-flicking tournament. Instead, like every other Rocky/Flashdance derivative that flooded the 80s market, it's about conquering adversity with stick-to-it-iveness, rendering all social/personal realities irrelevant by your lonesome - with love interest standing by of course. Ronald Reagan top to bottom, in short; so as a piece of cinema it's down to the details. Some of the actors are quirky enough to liven things up - especially the love interest, brought to you by none other than Mr. Keanu Reeves, warming up for Ted; heroine Olivia D'Abo's hateful alkie dad and big-hair stepsister are more interesting than the sickly mom or her utterly inert bitch-nemeses/teammates, one of whom appears to be made of porcelain. It's my instinct to be appalled by the comic-relief black guys, but on the other hand at least they're in the movie. But D'Abo doesn't quite convince with her awkward-girl shtick, and in the absence of any other narrative focus the lack of interest in the gymnastics themselves really does matter; it's all just bodies hurtling around, and not only is the outcome of the big tournament a foregone conclusion, it's all performed by an obvious double."
        },
        {
            "id": "neg_286",
            "text": "What an insult to Olivia D'Abo who plays the film's heroine, Robin, to have Keanu Reeves appear so large on the box art of the film (and at least on recent reissues, to have only Reeves appear on the box), considering that she was the star. I realize that it is his name that will ultimately sell this long-forgotten After School Special, but at least give the woman some credit. <br /><br />Despite that, this has to be one of the worst teen sports-themed films that I have ever seen, and it strives very hard to add not only every teen and sports movie cliché from the class warfare between the feuding gymnasts to the teen romance. And, in striving to somehow deliver itself as an amateur alternative of Flashdance (with the music in one of the warehouse dance scenes is even quite close to Michael Sembello's notable 'Maniac' which was made famous by Flashdance, or was it the other way around?). It includes similar dance sequences and worse yet, even the 80s dance and sports traditions of corny dance-offs between the heroine and her antagonist(s), the one who doubts her successes and abilities on the team. We saw this in Trashin' (a vert ramp joust) and Rad (BMX dancing at the prom, although it wasn't much for competition, but rather for fun) for example. In fact, this movie is chock full of unrealistic corniness, such as the somewhat homo-erotic rolling in the clothes at the Salvation Army with Robin and her friend from the team.<br /><br />Nonetheless, the film is about a young girl who comes from a rather poor background. To top it off in a massive need to squeeze from audiences as much sympathy as possible, she lives with her ailing mother, her obnoxious sister, and her careless (and slightly abusive) stepfather. Needless to say, homelife is not so appealing. Add to the mix, a talent for gymnastics, but several obstacles to joining the team (including the nuisance of her arrogant, snobby teammates, and a coach who also eventually doubts her abilities to compete well). And, of course, we can't forget that she's got eyes for one of the pretty boy preppies who is dating one of the obnoxious teammates, nor that she doesn't have a steady boyfriend (although Keanu as Tommy later enters the picture). Could this kid be any more pathetic? And it seems that one mess after another comes along to embarrass herself in her painfully long, redundant, and clichéd quest to prove her worth to everyone.<br /><br />But, even the major moments of cheesiness which comprise most of the film, are hardly worth mentioning considering that the biggest distraction to this film is the horrible acting and dialog. (I like how the gym coach suddenly appears at the diner in the middle of the dance-off to scold the teammates). It makes episodes of 'Amazing Stories' look like Shakespeare.<br /><br />I imagine anyone able to locate this film and watch it these days is probably drawn to it mostly because of the nostalgic factor. For that you might be satisfied, but it is also an incredibly forced drama. So, Caveat Emptour."
        },
        {
            "id": "neg_287",
            "text": "As an Altman fan, I'd sought out this movie for years, thinking that with such a great cast, it would have to be at least marginally brilliant.<br /><br />Big mistake.<br /><br />This is one of Altman's big-cast mishmashes, thrown together haphazardly and improvisationally (or so it feels) with the hope that it would all come together in the editing room. It doesn't.<br /><br />As Maltin points out, this turkey is notable only for the debut performance of Alfre Woodard, who outshines the vets all around her. But other than that, avoid at all costs. (Which is pretty easy to do -- it's never been released on video -- to my knowledge -- and its cable appearances have the frequency of Halley's Comet.)"
        },
        {
            "id": "neg_288",
            "text": "There was nothing of value in the original movie, this one was even lamer. The fact that I even found it to rent was absolutely amazing. Anyone connected to this film has to be high on something! So what was the story line? What was with the girl? Was the viewer supposed to get the story line in the first four minutes of the film. Sadly, I tried several times to watch this. I even borrowed a kid from someone to get some feedback. Kid said it was stupid, and he was four years old. I find that possibly some credit could go to the filming director, as possibly some of the shots made the movie more than a B film. That might be pushing it. I did love the theme song. Good thing it was only a dollar, it was worth it. I suppose you might enjoy the film if you were high as the cast and crew would have to be. Is pot legal in France?"
        },
        {
            "id": "neg_289",
            "text": "What made the original Killer Tomatoes fun was it was made by people with no budget who were just being wacky for a couple of days...<br /><br />This was something with a budget, but it just wasn't as much fun. John Astin of Adams Family fame is actually making an effort here to be comedic, but he is supported by lame actors, cheap special effects and unfunny gags.<br /><br />The plot. Dr. Gangrene (Astin) escapes from a French prison and decides he is going to put a pretender on the throne of France... The hero, his French girlfriend and the Gizmo-like \"Fuzzy Tomato\" decide they are going to stop him...<br /><br />Forgettable Direct to Video nonsense..."
        },
        {
            "id": "neg_290",
            "text": "Killer Tomatoes movies have this special kind of humor - you either love it or hate it. I personally like it, but in this fourth movie the feeling is gone. The tomatoes aren't the same, jokes are lame, even the actors aren't as funny. Because that's the only thing this kind of movies are supposed to be - funny.<br /><br />So now following the plot made to laugh, is annoying. They really shouldn't have done the fourth part to the Killer Tomatoes trilogy."
        },
        {
            "id": "neg_291",
            "text": "Film version of Sandra Bernhard's one-woman off-Broadway show is gaspingly pretentious. Sandra spoofs lounge acts and superstars, but her sense of irony is only fitfully interesting, and fitfully funny. Her fans will say she's scathingly honest, and that may be true. But she's also shrill, with an unapologetic, in-your-face bravado that isn't well-suited to a film in this genre. She doesn't want to make nice--and she's certainly not out to make friends--and that's always going to rub a lot of people the wrong way. But even if you meet her halfway, her material here is seriously lacking. Filmmaker Nicolas Roeg served as executive producer and, though not directed by him, the film does have his chilly, detached signature style all over it. Bernhard co-wrote the show with director John Boskovich; their oddest touch was in having all of Sandra's in-house audiences looking completely bored--a feeling many real viewers will most likely share. *1/2 from ****"
        },
        {
            "id": "neg_292",
            "text": "I saw this by chance showing on cable on wanted to like it as I thought Sandra was quite funny from what I remembered. The only facial movement I had throughout the movie was jaw dropping stunned at how awful a movie I just suffered through.<br /><br />The person who said this is one of the funniest movies of all time please point out one line, just one scene, that is even worth a chuckle.<br /><br />She is a much better singer than I remember her to be, but I didn't want to watch a lounge act.<br /><br />I think this is a movie try hard to like since they think they should and don't view it objectively."
        },
        {
            "id": "neg_293",
            "text": "This movie is basically about some girls in a Catholic school that end up getting into trouble because of putting red dye in one in one of their school mates shampoo and after being reprimanded for this act they decide to take off to Florida for a vacation. On their way there they meet up with some guys in a local diner and decide that they would both meet up with each other in another location later on. The girls end up on a road side near the woods and stop for awhile and while one of the girls decides to walk around a bit she sees a murder happen in which the local sheriff himself is involved. She becomes scared and runs to tell the others what happened. The other girls decide to go take a look with her and two of them get killed by the killer. Then the two remaining girls are caught by the killer and are placed in local jail cell. The deputy sheriff meanwhile is keeping watch over the girls and despite their insistence that the sheriff is the killer he ignores them both and acts as ignorant and everybody else in this movie who just can't put two and two together much less some lousy detective work at that. The best part was the rape scene between the killer and one of the girls where he decides to rape her in her jail cell and it seems that the girl actually WANTS to be raped by this man and the bare chest scene I admit was good but before their lips meet he has other things in mind. This movie reminds me of the low-budget thriller \"Blood Song\" with Frankie Avalon staring in it, the same motive just a different character part. It's not a movie worth renting not even for an 80's low-budget movie and the ending was the worst ending I have ever seen in a movie and it left me wanting my money back!"
        },
        {
            "id": "neg_294",
            "text": "SHALLOW GRAVE begins with either a tribute or a rip off of the shower scene in PSYCHO. (I'm leaning toward rip off.) After that it gets worse and then surprisingly gets better, almost to the point of being original. Bad acting and amateurish directing bog down a fairly interesting little story, but the film already surpasses many in the \"Yankee comes down South to get killed by a bunch of rednecks\" genre because it is actually shot in the South.<br /><br />A group of college girls head to Ft. Lauderdale for summer vacation and are waylaid in Georgia by a flat tire after getting off the main road. (Note to Yankees: stay on the highway when you go to Florida.) Sue Ellen (Lisa Stahl) has to pee so she heads into the woods. When she finally finds a good spot to do her business she witnesses the local sheriff (Tony March) strangle his mistress (Merry Rozelle) to death. (Note to Yankees: do not wander off into the woods when in the South; not because you might witness a murder, but you may run across a marijuana plantation.) This is the point where the story, not the movie, actually comes close to being good.<br /><br />While Tony March will never have to practice his Oscar speech, his Sheriff Dean becomes a creepy facsimile of a normal guy torn by what he has done and what he must do. Tom Law is likable as Deputy Scott and is as authentic a Southern deputy as I've seen since Walton Goggins (Deputy Steve Naish) in HOUSE OF 1000 CORPSES.<br /><br />A few scenes in the movie are worth the mention. The girls stop at a BBQ in South Carolina and display their racism when a big black guy checks them out. Sue Ellen runs into a barn to hide behind some hay bales and in a shockingly realistic moment a large snake is hiding in the hay with her.<br /><br />And in the strangest scene, Sheriff Dean makes like he's about to rape Patty (Carol Cadby) and tells her to take off her clothes. Dean has turned the radio up to drown out the noise of what he's about to do. The preacher on the radio needs to go back and read his Bible. His sermon is about how Jezebel is saved by the blood of Jesus Christ. I feel sorry for this preacher's flock. Jezebel was in the Old Testament a few thousand years before Christ was born and by no means is she one of the five people you are going to meet in Heaven."
        },
        {
            "id": "neg_295",
            "text": "I got this movie because I worked at a movie store so I got free rentals. It came in, and the cover made it look alright. Hot chick, carrying a weapon, alright, I'll check it out.<br /><br />Oh man, bad move. This was so horrible, I spent half the movie watching in fast-forward to get to the nudity, which was minimal. I think MAYBE three scenes of partial nudity.<br /><br />Cheesy dialogue, crappy violence, poor excuses of characters. I feel bad putting this movie down, because I know it was made on a cheap budget, but so was \"Clerks\" and it became a cult classic and a franchise.<br /><br />2/10."
        },
        {
            "id": "neg_296",
            "text": "Despite the high ratings given to this film by IMDB users, this is nothing more than your typical girl-with-a-bad-childhood-obsessively-stalks-married-man film. The attractive Justine Priestly's brief nude scenes may attract voyeurs, but the film is hackneyed tripe.<br /><br />* 1/2 out of ****"
        },
        {
            "id": "neg_297",
            "text": "For the record, this film is intriguing but its hardly original. Back in 1998 a movie starring Talia Shire called The Landlady had almost the exact same plot but with younger characters.<br /><br />The story is Amanda Lear has had a bad life, abusive father, horny doctor, mental homes, etc. She's finally released from the happy home under the guidance of her perverted doctor...who she anally abuses and kills the poor guy. (now THAT was original) The doctor had financed a mansion for her before she killed him and buried the sucker in the backyard. After moving in she falls in love with a stud named Richard, who just happens to be married to a blues singer. If you've seen The Landlady you know the rest, she kills or tries to kill anyone that gets in between her and Richard (including a roadie).<br /><br />Much of the idea's came from the previous movie, same idiot sidekick that sticks his nose in, same spying on the guy with a bowl of popcorn, same flying a bodypress. It did have some original material, the beer bottle thing was brutal. The highlight of the movie was Amanda's beautiful breasts in the hot-top scene. Somewhat of a ripoff but not a total waste of time.<br /><br />4 out of 10"
        },
        {
            "id": "neg_298",
            "text": "Daraar got off to a pretty good start. The first scene really left me at the edge of my seat wondering what would happen next. Other than that, the first half of the movie is a total BORE. All the first half of the movie is about is Rishi Kapoor falling head over heels in love with Juhi Chawla. By the way, don't you think he's a little old for her???<br /><br />Things finally start to spice up towards the middle of the film when Juhi tells us about her previous husband; and wow what a lunatic is he! He was an over-protective, neat-freak with a really HOT TEMPER! He used to beat up poor Juhi for no good reason! One of the reasons I really don't like this movie is because I can't stand to see Juhi (my favorite actress) get so abused. This film in general has WAY too much abuse and bloodshed; I find it so sickening!!!<br /><br />Anyway, all I'm trying to say is if you're thinking about renting Daraar, you should put it right back on the shelf where you found it and pick something else!"
        },
        {
            "id": "neg_299",
            "text": "This was the third remake of SLEEPING WITH THE ENIEMY After YAARANA(1995) and AGNISAKSHI(1996)<br /><br />AGNISAKSHI was the only one which worked and was a better film<br /><br />DARAAR is directed by Abbas Mustan who sadly failed in their attempt here<br /><br />the story was good but the handling wasn't that good and the heroine was shown too regressive and the climax too was disappointing<br /><br />Direction is bad Music is good<br /><br />Rishi reprises his role of YAARANA(strangely which also was a remake of SWTE) and looks too fat for the lead and is okay Juhi is decent while Arbaaz tries too hard in his debut and does manage in many scenes to chill the audiences but his voice was terrible Johny is too loud"
        },
        {
            "id": "neg_300",
            "text": "Robert Taylor definitely showed himself to be a fine dramatic actor in his role as a gun-slinging buffalo hunter in this 1956 western. It was one of the few times that Taylor would play a heavy in a film. Nonetheless, this picture was far from great as shortly after this, Taylor fled to television with the successful series The Detectives.<br /><br />Stuart Granger hid his British accent and turned in a formidable performance as Taylor's partner. <br /><br />Taylor is a bigot here and his hatred for the Indians really shows.<br /><br />Another very good performance here was by veteran actor Lloyd Nolan as an aged, drinking old-timer who joined in the hunt for buffalo as well. In his early scenes, Nolan was really doing an excellent take-off of Walter Huston in his Oscar-winning role in The Treasure of the Sierre Madre in 1948. Note the appearance of Russ Tamblyn in the film. The following year Tamblyn and Nolan would join in the phenomenal Peyton Place.<br /><br />The writing in the film is stiff at best. By the film's end, it's the elements of nature that did Taylor in. How about the elements of the writing here?"
        },
        {
            "id": "neg_301",
            "text": "This is the worst documentary to come out of Canada ever!!!! I'm glad to see the guys haven't made another movie. All they want to do is get a movie made and it doesn't have to be the one they wrote. They keep changing the script to suite the person they're pitching. I could not get out of the theatre fast enough when I saw it at that year's Toronto Film Festival. Please never see this film."
        },
        {
            "id": "neg_302",
            "text": "I really wanted to like this movie. I absolutely love kenny hotz, and spenny rice has a charming side to him. Not that I like spenny at all. Spenny ruins this movie. He should of let kenny and his hot girlfriend pitch the movie.<br /><br />Anyways, it's pretty boring aside from a scene with Roger Ebert in it. There really isn't too many celebrities in this movie, and most don't seem to say more than one line. Overall this movie was disappointing. I would only suggest watching it if you got it with the season 1 DVD of kenny vs spenny (it comes for free on the 3rd disc). Regardless of this production, I am still very excited to check out The Papel Chase."
        },
        {
            "id": "neg_303",
            "text": "It's impossible for me to objectively consider this movie. Not that I haven't tried, mind you - but I sit down, and I pop in the aged VHS, and I watch the opening...and suddenly I'm five years old again and clutching my very own Care Bear and watching the movie with open eyes and an eager heart.<br /><br />I can see, objectively, that this movie is a BIZARRE combination of cuddly baby merchandising-mascots and creepy prepubescent children with evil powers that has a thin story and uninteresting animation. But my inner five-year-old goes, \"Yay! Care Bears!\" every time I think about it. So - I'd only (cautiously, reluctantly) recommend this movie for those who saw it during their early youth and can call on the awesome power of nostalgia while watching it (like me) OR those lovably cynical Gen-X/Y-ers who deliberately seek out the wonderfully bad/strange (a category in which this movie...definitely belongs). To those actually looking for a compelling movie or wholesome family entertainment: You might want to keep looking."
        },
        {
            "id": "neg_304",
            "text": "This movie portrays Ruth as a womanizing, hard drinking, gambling, overeating sports figure with a little baseball thrown in. Babe Ruths early life was quite interesting and this was for all intents and purposes was omitted in this film. Also, Lou Gehrig was barely covered and this was a well know relationship, good bad or indifferent, it should have been covered better than it was. His life was more than all bad. He was an American hero, an icon that a lot of baseball greats patterned their lives after. I feel that I am being fair to the memory of a great baseball player that this film completely ignored. Shame on the makers of this film for capitalizing on his faults and not his greatness."
        },
        {
            "id": "neg_305",
            "text": "I'm glad that I saw this film after Mr.Sandler became famous.<br /><br />It is bad....bad,bad,bad. There is no plot. It's like watching a painfully dull home movie.<br /><br />I really enjoy his other films......but if you're a fan like me....stay away from this one. It may change your thoughts on Adam. You may never recover from the horror that is this film....I've had a better time watching old folks play scrabble in a home......."
        },
        {
            "id": "neg_306",
            "text": "Unwatchable. You can't even make it past the first three minutes. And this is coming from a huge Adam Sandler fan!!1"
        },
        {
            "id": "neg_307",
            "text": "...okay, maybe not all of it. Lured by the false promise of bikini-clad women on the movie's cover...but the HORROR...THE HORROR... ...whatever you do, do NOT watch this movie. Gouge out your eyes, repeatedly bash your skull in...do what it takes. Never again--never forget!<br /><br />"
        },
        {
            "id": "neg_308",
            "text": "Mere thoughts of \"Going Overboard\" (aka \"Babes Ahoy\") make me want to weep. Throwing yourself out a window would be better than watching this movie. It's not even a supposed \"so bad it's good\" movie. I would spend money to buy copies of this movie and burn them so that people can't see it. Oh the pain, the pain..."
        },
        {
            "id": "neg_309",
            "text": "Hello. I am Paul Raddick, a.k.a. Panic Attack of WTAF, Channel 29 in Philadelphia. Let me tell you about this god awful movie that powered on Adam Sandler's film career but was digitized after a short time.<br /><br />Going Overboard is about an aspiring comedian played by Sandler who gets a job on a cruise ship and fails...or so I thought. Sandler encounters babes that like History of the World Part 1 and Rebound. The babes were supposed to be engaged, but, actually, they get executed by Sawtooth, the meanest cannibal the world has ever known. Adam Sandler fared bad in Going Overboard, but fared better in Big Daddy, Billy Madison, and Jen Leone's favorite, 50 First Dates. Man, Drew Barrymore was one hot chick. Spanglish is red hot, Going Overboard ain't Dooley squat! End of file."
        },
        {
            "id": "neg_310",
            "text": "I had never heard of this Adam Sandler movie until I saw it on the wall at Blockbuster. Being an Adam Sandler fan at the time, I rented it. HONESTLY I could only watch about 30 mins. of it. It was TERRIBLE. Do whatever it takes to keep this out of the hands of the public. I honestly hope this movie goes OOP soon, and I hope it STAYS THAT WAY!"
        },
        {
            "id": "neg_311",
            "text": "I just finished watching Going Overboard. I have to say that we should send every copy of this film to Iraq and make them watch. I even tried to get a blind women to watch this and she turned it off in like 20 min. Adam Sandler could not find a better project than this? As for the writing, if thats what you want to call it, those responsible should be forced to watch this movie forever in Hell!! I believe that somewhere I read that the budget for this film was $10,000 and they were way under. Did Wallmart get a good deal on this? Every store has a big huge bin of this crap sitting on the sales floor. The only good thing about this movie is you can use the DVD as a coaster, or trade it to a friend, but then they might not be your friend anymore!!"
        },
        {
            "id": "neg_312",
            "text": "If you've ever seen this movie, you'd know that it! If you haven't, and want to see a classic BAD movie, I suggest you see this movie, because it ranks right down with the worst. So, if you're REALLY bored, go rent it. If you want to know what it's like, here's my little summary: Adam Sandler is hired to work on a giant cruise ship with some Ms Universe models and five other people. Adam doesn't like how one passenger is getting all the babes, and he tries to take over with the cheezy jokes. BUT WAIT! It only gets worse! You'll have to rent the movie yourself to see how bad it truly is."
        },
        {
            "id": "neg_313",
            "text": "This is definitely the worst movie Adam's ever done but at this point in his life, he was just happy to have a movie. There are 3 or 4 laughs in it but I used the fast forward button through some of it. Don't waste your time. I only saw it because I wanted to see all of his movies, but it sucked."
        },
        {
            "id": "neg_314",
            "text": "I picked up this movie for $5 dollars at a discount book store, Adam Sandler is a awesome actor and i figured it would be a good movie, well, it wasn't. There was absolutely no story line at all, bad jokes, and the other comedian said \"The F-Word\" every other word he said,cursing usually dosen't bother me but this was over the top. And even worse than the lack of story line was the parts when Sandler would just begin talking into the camera at random parts in the movie, it reminded me of Dora the Explorer when they turn and look at the screen and ask you questions. And last of all is when they would randomly put in Bikini shots of girls at random times in the movie. In my opinion, Don't buy this movie, its a waste of money"
        },
        {
            "id": "neg_315",
            "text": "Watching this stinker constitutes cruel and unusal punishment at the hands of Sandler. Truly a slow and painful death.<br /><br />'Bought the DVD in the $5.88 bin at Wal Mart. But the thought that keeps echoing in my head is, \"How can I get my money back?\"<br /><br />The most unforgivable thing about the movie is that the boat JUST DOES NOT SINK!<br /><br />Best constructive suggestion: Mystery Comedy Theatre. You know that show on the SciFi Channel in which some guy and his muppet-machines spoof the most unwatchable horror flicks (Mystery Science Theatre). IMMEDIATELY, spin off a comedy program and feature this flick. Without a good humorous spoof of this train wreck, I fear that viewers may actually begin following Sandler with ice picks and chainsaws.<br /><br />"
        },
        {
            "id": "neg_316",
            "text": "This movie is by far the worst movie ever made. If you have to create a film costarring the guy who plays Lars in heavyweights than don't make the damn film. I have to say that I could watch Leprechaun in Space 6 times before I could watch the trailer for this POS of a movie. Adam sandler should be restricted from any movie after this disgrace. Watching this movie is like a mix of listening to Cher and willingly putting your dick in a blender. Anyone with half of a brain cell will realize that this movie is not worth a dime. If I had an extra dollar and had to spend it, I'd give it to the support Lorraina Bobbitt foundation before buying this movie."
        },
        {
            "id": "neg_317",
            "text": "This HAS to be the worst movie I've ever attempted to watch. In the first 15 minutes, there wasn't anything to keep my interest in this movie. I was on vacation at the time, and had plenty of time to devote to a just-for-the-fun-of-it movie. The condo we were staying in had this movie in stock -- they must have got it from the $1 store or something.<br /><br />If you like Adam Sandler, this is nothing like any other movie he's made. This started with a bad premise and then just got worse. There's nothing even remotely funny in it.<br /><br />I've watched a lot of movies, including some I didn't care for. But if you decide to waste your time on this movie, don't say I didn't warn you."
        },
        {
            "id": "neg_318",
            "text": "I stole this movie when I was a freshmen in college. I've tried to watch it three times, the second two because friends wanted to see it. \"Sweet, Adam Sandler, I've never heard of this movie, but since he's so funny its gotta be funny.\" Wrong! I can't make myself watch this pile of crap after the dream boxing match/insult war, where burning the guy with a good zinger causes your opponent physical pain. You would think that terrible comedy hurting you is ridiculous, but after watching this you'll know its true. This movie isn't worth the price I paid for it. I've watched a ton of Steven segal movies, and I've even watched Crossroads twice... but I still couldn't watch this."
        },
        {
            "id": "neg_319",
            "text": "A friend of mine bought this film for £1, and even then it was grossly overpriced. Despite featuring big names such as Adam Sandler, Billy Bob Thornton and the incredibly talented Burt Young, this film was about as funny as taking a chisel and hammering it straight through your earhole. It uses tired, bottom of the barrel comedic techniques - consistently breaking the fourth wall as Sandler talks to the audience, and seemingly pointless montages of 'hot girls'.<br /><br />Adam Sandler plays a waiter on a cruise ship who wants to make it as a successful comedian in order to become successful with women. When the ship's resident comedian - the shamelessly named 'Dickie' due to his unfathomable success with the opposite gender - is presumed lost at sea, Sandler's character Shecker gets his big break. Dickie is not dead, he's rather locked in the bathroom, presumably sea sick.<br /><br />Perhaps from his mouth he just vomited the worst film of all time."
        },
        {
            "id": "neg_320",
            "text": "With Adam Sandler.<br /><br />This is without a doubt one of the most idiotic films ever made. It's about cruise ship waiter Shecky (Sandler) wanting to be a comedian on the cruise ship. First off, there is not one funny or clever line in the entire movie honestly. It is so unfunny it's pathetic. There is surprisingly not much crude or sexual humor, but the f-word is plentiful. The budget is really low, and that also ruins the film. It takes place on a cruise ship, but it seems they only had money to rent out a small boat and only had money for 10 ship extras, one of which is Billy Bob Thornton. The opening credits are animated reeeeeaally cheaply, and it is just pathetic. I hate this movie and everyone else that sees this will hate it too.<br /><br />86 mins. rated R for Language."
        },
        {
            "id": "neg_321",
            "text": "Shecky, is a god damned legend, make no mistake. Until recently I worked for a UK HiFi & Video retail chain, running their testing department. We would go through many new starters, they would be expected to to learn how to fault find the various detritus that returns as non functional in one way or another from the stores. Now to tortu^^^^^ test the resolve of these new staff members, we would issue them with a copy of Going Overboard. We had hundreds of copies of this film because whenever someone who had bought a particular model of Goodmans DVD player that had this film as a free gift, got round to sending their DVD player back, they never failed to send Shecky back also. Our new staff would be forced to use only Going Overboard to test these machines for faults until they had found a disc or two of their own to test with.<br /><br />Now, as to why this film is so bad, where do I begin?<br /><br />Adam Sandler, who can be so, so very funny, as in Happy Gilmore, or the Wedding Singer, must have been having one hell of an off day. The rest of the crew stank, and what is it with Billy Zane? His name crops up in several of the worst movies of all time, and he is a decent actor. Crazy. The production quality is absolute zero.<br /><br />I would have been inclined to give this a zero if I could, because they didn't even have the guts to call it by it's full name 'The Unsinkable Shecky Moskowitz' on release. Even so it is worth a watch so you can see just how far Sandler has come, and just how low he can go."
        },
        {
            "id": "neg_322",
            "text": "I saw this movie about 5 years ago, and the memory of it still haunts me to this day. I was fully aware at how awful it was supposed to be going into it, so I have only myself to blame. But like most, I didn't believe all the negativity. Being a Sandler fan, it just seemed inconceivable one of his movies could really be that bad. I figured it was just Sandler haters. I couldn't have been more wrong.<br /><br />What we have here is a comedy that does not contain even 1 second of anything funny. That is actually quite an accomplish. You'd think in a 90 minute comedy, they might have accidentally stumbled upon something even remotely amusing. But no, it's just horrible. It's not \"so bad it's good\", its just bad. You cannot laugh at how bad it is, you can only cry. You wait patiently for a joke that will at least make you chuckle, but they never come.<br /><br />Have you seen the movie The Ring? Where the people watch a video tape and die 7 days later? If this movie was on the video tape, people would die instantly, by their own hand, and there would be smile on their face as they realize their agony has ended, and that would be the first smile since they pressed play.<br /><br />You might be inclined to watch it just to see how bad it is, unable to curb your curiosity. Don't. Please don't. Trust me, I'm doing you a favor. There are 2 types of people in the world, those that think Going Overboard is the worst movie ever made, and those that have not yet seen it."
        },
        {
            "id": "neg_323",
            "text": "This movie was so bad I couldn't sit through it without doing something else. There was no plot and no point. I was thoroughly bored and for a film about a stand up comedian, I couldn't recall one joke or funny line worthy of the description. Politicians with no charisma speaking technical jargon could not be less entertaining.<br /><br />So how was this made? Is there no quality control in film? Watching the girls in bikinis was the only distraction during this horrible experience.<br /><br />It's hard to imagine that Adam Sandler who has become popular and has appeared in fine comedies was able to survive after this kind of exposure. He was not funny in the least in this movie so it proves that the writing is so vital in effective comedy."
        },
        {
            "id": "neg_324",
            "text": "Worst mistake of my life.<br /><br />I picked this movie up at Target for $5 because I figured, \"Hey, it's Sandler I can get some cheap laughs\". I was wrong, completely wrong. Mid-way through the film all three of my friends were asleep and I was still suffering. Worst plot, Worst script, Worst movie I have ever seen. I wanted to hit my head up against a wall for an hour, then I'd stop, and you know why? Because it felt damn good. Upon bashing my head in i stuck that damn movie in the microwave and watched it burn....and that felt better than anything else I've ever done. It took American Psycho, Army of Darkness, and Kill Bill just to get over that crap. I HATE YOU SANDLER FOR ACTUALLY GOING THROUGH WITH THIS AND RUINING A WHOLE DAY OF MY LIFE!!!!!!!!!!!!!!!!!"
        },
        {
            "id": "neg_325",
            "text": "Having decided some time ago to collect the films of Billy Bob Thornton (on the strength of class movies like \"Sling Blade\", \"A Simple Plan\" and \"The Man Who Wasn't There\" amongst others), it was inevitable that there would be the odd turkey in there. What I didn't realise however, was that there could be one THIS bad. I'll give you an idea how incredibly poor this film is - the funniest dialogue in it goes like this: \"Knock Knock\", \"Who's there?\", \"The big stinking man\", \"The big stinking man who?\", \"The big stinking man - is YOU!\". Yes folks, it really is that bad. Billy Bob is only in it for about two minutes (I guess he needed the work at that time in his career), and the rest of the movie is painful. For some reason though, although it's undeniably awful, I don't hate it. That's probably because I save my ire for any high budget, special effects laden junk like \"The Fast and the Furious\" and not a \"no-budget\" flick like this one. 2/10 at a push."
        },
        {
            "id": "neg_326",
            "text": "This early Adam Sandler film could be compared to his life as a comic during the same period in 1989. His character's constant acknowledgement of his hidden comic genius and frustration regarding humorous material seems to come more from Sandler than the script. The film is nothing compared to his blockbuster feature films, such as Big Daddy or even the corny Billy Maddison. Unfortunately, Sandler had not yet found a way to express himself in a consistent, successful and funny manner when this film was made, much like his character. The majority of the film's \"jokes\" come from Sandler having conversations with himself, usually over his unrecognised comic talent and beating himself up because he's too ugly and can't get women. The film is hard to watch too because it doesn't treat itself like a real film. Sandler talks to the camera and the viewers throughout the film, often referring to the film's low budget or questionable content. The film is ultimately awkward and embarrassing to watch. I immediately wanted to forget I even saw this film after it was over, for fear that if more found out about it, it would ruin Sandler's career. Pass this one up at the video store, I rented it for free and it was still a waste of time."
        },
        {
            "id": "neg_327",
            "text": "Even if you're a huge Sandler fan, please don't bother with this extremely disappointing comedy! I bought this movie for $7.99, assuming it has to be at least halfway decent since my man Sandler is in it and because I assumed some women would get naked (judging by the R-rating and scantily-clad women on the cover). Well, there are quite a few scantily-clad women, but none get naked. I'm not sure what point this was in Sandler's career, but I'm guessing it was even before his SNL days. I can be wrong. This is like watching one of his home movies. He might look back at a cheesy movie like this and reminisce about the good ol' times...but we (the audience) are left to dry. This is hardly a \"movie\"! Sandler does a lot of talking to the camera, and even admits at one point that this is \"no-budget\" movie (that's right, not a low-budget movie, a NO-budget movie). So our job is pretty much to laugh AT the quirky characters. There is no steady plot, it's like an extended sketch comedy show--but a crude and badly written one. That guy who played the nasty comedian was completely annoying and it was implausible in the first place that he would receive such a mass audience. And Sandler finds his comic inspiration by saying the one classic Henny Youngman line \"Take my wife, please\" and the audience is on the floor? I'm not even going to TRY to make any logic here. Sure, Sandler's current and recent movies are not known for making a lot of sense (the penguin in \"Billy Madison,\" the midget in \"Happy Gilmore's\" Happy Place) but the comedy works. This is a strictly amateurish work, and even if you're curious about Adam's early days in film--you still won't be interested. You're better off checking out his start on SNL or maybe his underrated role in \"Mixed Nuts.\" Of course, the Sandman is not the only actor wasted in this thankless vehicle. Billy Bob Thornton also makes a short appearance, Billy Zane (\"Titanic\") has a supporting role and the great Burt Young (from the \"Rocky\" movies) has a significant role. <br /><br />This awful comedy will most probably be collecting dust on the 99-cent rental section of your local video store--and rightfully so. <br /><br />My score: 3 (out of 10)"
        },
        {
            "id": "neg_328",
            "text": "I am a HUGE Adam Sandler fan, and one day I was looking at the Cast&Crew selection on one of his DVD's and saw 'Going Overboard' and decided to go out and rent it. So I went out with a few buddies of mine and rented it. We put it on and we were shocked to see an Adam Sandler that didn't hit puberty yet, he looks as if he was 12 when this movie came out. I couldn't even watch 30 minutes of this crap, I didn't laugh, chuckle, or even smirk at this movie, actually the only time I smirked was when I saw how horrid this movie was. I could not believe how hard he tried to make the viewers laugh in this movie...and it didn't work once. Although from seeing the horribly awful camera angles and hearing the disgusting script I realized why I had never heard of this movie,...because it sucks more than anything has ever sucked before. This movie, in my opinion, was the WORST movie EVER made,....EVER!"
        },
        {
            "id": "neg_329",
            "text": "First: I bought it at the video store. Second: I watched it. Third: It was boring. Fourth: It was not funny. Fifth: Most of the antics were lame. And last, but not least: It's not only a bad movie, it's a total fiasco.<br /><br />I am a huge Adam Sandler fan despite this disappointing and forgotten film. I pity it because it was his first movie. Even if you are a huge Adam Sandler fan, don't bother watching this movie. Instead, just take the video, board a yacht, and throw it overboard."
        },
        {
            "id": "neg_330",
            "text": "I wanted to punch the TV. Watching it was torture. I hated it. Never watch this movie. The terrorists are annoying. Adam Sandler is annoying. I normally like him but not in this one. I wanted to break the DVD. This is the most irritating film in the world. The comedian he's jealous of is obnoxious. The only remotely funny part is the rocker with the black teeth getting all the girls. It was so irritating I wanted to punch the TV. DO NOT BUY THIS MOVIE UNLESS YOU WANT TO ANNOY SOMEONE. If you even like Adam Sandler a little bit, Don't buy it. It will just make you hate him. Do yourself a favor, if you see it in the store, hide it to put everyone out of danger of buying it. Its a waste of the $1.99 I paid for it."
        },
        {
            "id": "neg_331",
            "text": "I can say without a shadow of a doubt that Going Overboard is the single worst film i have ever seen, and yes, I have seen Cujo. Adam Sandler is an abomination as Schecky Moskowitz, a wannabe comedian working on a cruise liner. That's the plot.<br /><br /> That's it! Nothing else in the film makes sense, it's all over the place like a mad man's breakfast, and not in a wacky naked gun kind of way, but more of a frustrating, 'throw both shoes at the t.v' kind of way. even General Noriega makes an appearance, for no reason i can comprehend (it certainly wasn't for humour). Add to the mix Miss Australia, who has the worst Australian Accent i've ever heared, and you have something which i won't call the worst film ever made, because Going overboard doesn't even fit the basic definition of a film. I highly recomend seeing this film, as it will elevate the standing of every bad film you ever see. I guarantee the first thing you'll say after seeing a bad film will be \"at least it wasn't as bad as Going Overboard\"."
        },
        {
            "id": "neg_332",
            "text": "I will start this off by saying I couldn't get all the way through it. I picked it up on a rainy day from WalMart like the rest of the reviewers on this site. I figured there wasn't any way I would regret my purchase. Was I wrong or what? Seriously now, who approved this project? They need to be forced to watch this movie over and over until the end of eternity. That's the only fitting punishment I can think of for releasing something this bad. The shooting reminds me of the movies I used to make for class projects on a big old VHS cam. The acting isnt much better. I think the only difference is that there are a few cool cameos. Yay, who cares... Shecky Moskowitz is unfunny, and the ships comedian is an even bigger loser. That's about as much of the plot as I understood.<br /><br />Overall it's the worst movie I've ever seen. I own it on DVD and have given it to many co-workers to watch. Each comes back and laughs and says \"Wow I didnt think I'd ever say I shut off an Adam Sandler movie 15 minutes in....\"<br /><br />My response is always \"Well now you can\"<br /><br />"
        },
        {
            "id": "neg_333",
            "text": "I remember when THE GOLDEN CHILD was released in 1986 it was universally panned by the critics , and I`m talking panned so badly that it more or less ended the glittering career of Eddie Murphy so I guess this movie has something going for it<br /><br />It gets off to a bad start where Buddist monks kneel in front of a child with a blank expression on his face . Bad guys enter the temple<br /><br />Child sits with blank expression<br /><br />Bad guys chop up the monks<br /><br />Child sits with blank expression<br /><br />Bad guys pull out giant bird cage and stick the child inside who now sits with ... Go on guess ? You do get the impression that even if they were taking him for a sleepover at Michael Jackson`s wonderland ranch he`d still give the same blank expression , this movie would be better titled THE WOODEN CHILD<br /><br />The title sequence starts and being a movie from the 1980s a pop soundtrack features heavily . Obviously this might have been cool and funky at the time but now in 2004 it seems very dated . Not only that but it jars completely with the somewhat bloody opening . In fact that`s the main problem ( And boy it`s a serious one ) with this movie - The whole mood seems to change from scene to scene so much so that sometimes it`s like watching scenes from totally different movies spliced together . I blame the director personally but it should also be pointed out that both the screenwriter and producer should share equal blame too . Did anyone know before shooting commenced what type of movie this was going to be ? It`s part fantasy , part martial arts , part buddy movie , part comedy and it`s all crap"
        },
        {
            "id": "neg_334",
            "text": "Bad movie for sure. It's such a ridiculous fantasy with a lot of poor special effects, a lot of hasty scenes (the airport one for example), and a real unfunny time. (Charles Dance) is awful as the evil guy and he is much better in (Last Action Hero). (Eddie Murphy) is doing a non-comic joking, and I heard that this sunk had already succeed, big time success??!! I'll never understand why or how ?! In one TV interview I've heard (Eddie Murphy) himself, when he was nominated for an Oscar 2007, regretted it in a comic way !! <br /><br />One of the comments said (Hey...It's the 1980s !). Well, no my friend. It's the cinematic foolishness which made a lot of RAZZIE movies all over the years whether it's the 1980s or the 1950s ! <br /><br />There are 2 reasons made me write about this movie. The first is that I'll never forget the long tan fascinating legs of (Charlotte Lewis) especially when she was on bed before the bad guys attack her house, wearing just a blue shirt and OH BOY the camera was versifying about her naked legs as it should be. But how odd ! As I've watched her in following movies and she wasn't that beautiful again ?!! Anyhow the second reason is that I've found this movie's title lately at my list of the worst 100 movies ever!<br /><br />The bottom line: Bad movie, Greeeeeat legs."
        },
        {
            "id": "neg_335",
            "text": "Michael Jackson would have claimed a spot for the top-billed character in THE GOLDEN CHILD, and because he loves kids. That didn't work (and why should it?), so instead we have Eddie Murphy out to save the world by rescuing \"Kid Midas\". I would strongly suggest all future scriptwriters to please thoroughly study the actor's inane dialogue in this quirky fantasy - adventure - comedy that's a step closer to ISHTAR. Whatever Murphy says or does can be best liked, but don't get me wrong about his exquisite comical talent; he doesn't belong in this movie, and the same went for DR. DOLITTLE! The violence and visuals combined are reasons to stamp it as a cult camp classic, and that wouldn't have made any sense as Hollywood and movie fanatics kept cashing in on the guy. Speaking of visuals, they were pulled off amazingly well at the time of Ronald Reagan's presidential fame. Murphy is far better at COMING TO AMERICA and 48 HRS, but this stale movie isn't my touch of golden honey for a sweet crunchy taste."
        },
        {
            "id": "neg_336",
            "text": "Why is it that when a star reaches the top of the star chain, they ruin all the good work by making a bad movie? Burt Reynolds peaked, then started making dreadful Hal Needham car chase flicks. Arnold Schwarzenegger became the hottest property in Hollywood, only to invite derision upon himself with the appalling Last Action Hero. And here, loquacious Eddie Murphy erases memories of Trading Places and 48 Hours with this \"family\" adventure flick, which is an unbelievably tedious, childish and generally plain awful misfire in which the chance to see Charlotte Lewis's great big breasts in a tight blouse is the most appealing aspect of the entire film.<br /><br />The story is pure humdrum. It concerns social worker Murphy, contacted by mysterious types and told that he is the Chosen One. Chosen for what, I hear you ask. His job is to rescue a Tibetan boy with mystical powers from a race of demons who want to rule the world. As the main demon, classy actor Charles Dance looks terribly embarrassed to be in the film, but hey, I'm sure he was well paid for sacrificing his talents. Of all Murphy's films, this is easily the worst. I've read some reviews which suggest that it is nice to see Murphy in an atypical role, in a non formulaic kind of film, and while both points are loosely true there's no forgiving the fact that the film - however atypical and non formulaic it might be - is an absolute load of garbage.<br /><br />"
        },
        {
            "id": "neg_337",
            "text": "Well, what's to say. THE GOLDEN CHILD falls in the category \"so bad, it's good\". Eddie Murphy is having some funny (and sometimes quite annoying lines), but you are still entertained. Chales Dance has never been worse than his role as the villain Sardo Numspa (what a f***ed up name is this??).<br /><br />Who should watch THE GOLDEN CHILD... hm... difficult to say, but my best guess would be people who likes embarrassing movies and can be entertained by bad acting, bad plot and an even more embarrassing dialog.<br /><br />4 out of 10"
        },
        {
            "id": "neg_338",
            "text": "Definitely one of funny man Eddie Murphy's lesser films is this nonsense about a kidnapped mystical child, three hundred year old dragons and a \"Chosen One\".<br /><br />Murphy is the \"Chosen One\" in question, and as the opening song suggests, he is \"the best man in the world\". A finder of lost and missing children, he is approached by a mysterious Tibetan woman (Charlotte Lewis) who tells him he is \"The Chosen One\", and that it is his destiny to find and rescue \"The Golden Child\". For if the child were to die, compassion would die with him, as he is the bearer of compassion.<br /><br />If all this hocus pocus rubbish hasn't ruined it for you now, it surely will once the movie begins. Suffice to say the plot is abominable and destroys the whole film. Meant to be another vehicle for Murphy's egotistical brand of humour (the comedy isn't so great mind you), the movie fails on many levels. Even Charles Dance as the evil Sardo Numspa can't do much for proceedings. Very silly and disappointing.<br /><br />Sunday, December 12, 1993 - T.V."
        },
        {
            "id": "neg_339",
            "text": "Unlike \"The Adventures of Buckaroo Banzai\", or \"Big Trouble in Little China\", or \"Conan the Barbarian\", which are horrible films that have a certain coolness and self-deprecating humor that turn them into cult sensations, The Golden Child is just plain bad.<br /><br />The premise itself is not unworkable, and there are some funny moments. But here the Eddy Murphy \"flip attitude\" just deflates any feeling of tension or danger in the story. And the special effects are silly enough to do more damage to that tension. The \"mystic secrets\" of Tibetan Buddhism are lampooned rather than drawn upon to compel.<br /><br />Without a feeling that anything is at stake, or that the characters are faced by real danger, why should we care?<br /><br />Who should see this film:<br /><br />-- big fans of Eddy Murphy who can't help themselves<br /><br />-- I can't think of anyone else<br /><br />I'll give this film a 4 out of 10 for the occasional joke that worked."
        },
        {
            "id": "neg_340",
            "text": "I am guessing the reason this movie did so well at the box office is of course Eddie Murphy. I think this was his first movie since \"Beverly Hills Cop\" so at the time he was hot. Considering that one made over two hundred million and it was R and this one made about 80 million and it was pg does say it was not all that popular. I have never been a big Eddie Murphy fan, so that is probably another reason I didn't care for it much at all. This one has Eddie as some sort of finder of lost kids. He must find the golden child or the world is in terrible peril. The plot is very bad, but as bad as it is it does not compare to the special effects. I had seen better stuff done in the 70's than some of the stuff this one offers, Ray Harryhausen did better stuff. Still the main reason you see a movie like this is because of Eddie, unfortunately he is not very funny in this one at all and it just seems stupid to put him in the \"Raiders of the Lost Ark\" type scenes. I guess they were hoping for a fish out of water effect, but to me it just did not work."
        },
        {
            "id": "neg_341",
            "text": "Oh man. If you want to give your internal Crow T. Robot a real workout, this is the movie to pop into the ol' VCR. The potential for cut-up lines in this film is just endless.<br /><br />(Minor spoilers ahead. Hey, do you really care if a film of this quality is \"spoiled?\") Traci is a girl with a problem. Psychology has developed names for it when a child develops a sexual crush on the opposite-sex parent. But this girl seems to have one for her same-sex one, and I don't think there's a term for that. It might be because her mother Dana is played by Rosanna Arquette, whose cute overbite, neo-flowerchild sexuality and luscious figure makes me forgive her any number of bad movies or unsympathetic characters. Here Dana is not only clueless to her daughter's conduct; she seems to be competing for the gold medal in the Olympic Indulgent Mother competition. <br /><br />It's possible that Dana misses Traci's murderous streak because truth be told, Traci seems to have the criminal skills of a hamster. It's only because the script dictates so that she manages to pull off any kind of a body count.<br /><br />A particularly hilarious note in this movie is the character of Carmen, a Mexican maid who is described by Dana as around so long she's like one of the family although she dresses in what the director thought would say, \"I just fell off the tomato truck from Guadalajara.\" Carmen is so wise to Traci's scheming, she might also wear a sign saying, \"Hey, I'm the Next Victim!\" Sure enough, Traci confronts Carmen as Carmen is making her way back from Mass, and bops her with one of those slightly angled lug wrenches that car manufacturers put next to your spare as a bad joke. I rather suspect than in real life those things are as useless as a murder weapon as they are for changing a tire. <br /><br />In another sequence, Arquette wears a flimsy dress to a vineyard, under cloudy skies, talking to the owner. Cut to her in another flimsy dress under sunny skies, talking to the owner's brother. Then cut to her wearing the first dress, in the first location, under cloudy skies - but it's supposed to be later. You get the picture. We're talking really bad directing.<br /><br />As for skin, don't expect much, although Traci does own a nice couple of bikinis. <br /><br />For those looking for a trash wallow, 8. For anybody else, 1/2."
        },
        {
            "id": "neg_342",
            "text": "This movie is so bad, I knew how it ends right after this little girl killed the first person. Very bad acting very bad plot very bad movie<br /><br />do yourself a favour and DON'T watch it 1/10"
        },
        {
            "id": "neg_343",
            "text": "A truly, truly dire Canadian-German co-production, the ever-wonderful Rosanna Arquette plays an actress whose teenage daughter redefines the term \"problem child\" - a few uears prior to the \"action\" the child murdered her father, and mum took the fall for the offspring. Now she's moved up to the Northwest US to start over, but her child still has a problem in that she's devoted to her mother. So devoted in fact that she kills anyone who might be seen as a threat to their bond.<br /><br />Unfortunately Mandy Schaeffer (as the daughter) murders more than people - she delivers such a terrible performance that she also wipes out the movie, though the incoherent script, useless direction and appalling music (check out the saxophone the first time she displays her bikini-clad bod) don't help any; we're supposed to find her sexy and scary, but she fails on both counts. Almost completely unalluring and not even bad enough to be amusing (not to mention the fact that Arquette and Schaeffer don't really convince as mother and daughter), all condolences to Miss Arquette and Jurgen Prochnow, both of whom are worthy of far more than this, and both of whom (particularly Rosanna) are the only sane reasons for anyone to sit through this farrago.<br /><br />One of the production companies is called Quality International Films - not since the three-hour \"Love, Lies And Murder\" (from Two Short Productions) has there been such a \"You must be joking\" credit."
        },
        {
            "id": "neg_344",
            "text": "Let me be really clear about this movie. I didn't watch this movie because of the plot, I watch it for the saucy sex scenes. That being said, this movie is so god damn awful I flip between pure joy of seeing a godly body of Traci (Mandy Schaffer) and cringing my eyeballs out for the disaster of a plot.<br /><br />Spoiler Alert The first scene of the movie already had me cringing.. you see a woman painting something by the lakeside, in pure bliss and serene, then a beautiful girl approach and ask if she could paint beside her. When they both finished, they show each other what they had done... and the woman painted A VINEYARD WHEN SHE IS FACING INFRONT OF THE LAKE. What kind of screwball director would make this kind of mistake?? And in another scene, Traci gets to kill her teacher's lover by smash him with the sail pole, and then she swims away, and none of the town's police suspected her once. I mean HELLOOOOO? MANDY DID NOT WEAR A GLOVE DID SHE? HER FINGER PRINTS ARE ALL OVER THE GOD DAMN BOAT!! After that, it gets worst, whenever Mandy is around, there is the \"chilling\" sound effect played which sounds like a cat in hissy fit. It's also a real pity Rosanna Arquette's is in this movie. I feel real sorry for her to have to star in this super low budget soft-porn no brainer. Same goes for Jürgen Prochnow, who also has the misfortune to star in this movie. All in all, 2/10."
        },
        {
            "id": "neg_345",
            "text": "This can't be Mandy Schaffer's last film. Somebody, do something! :-(<br /><br />Argh.<br /><br />What little life this one might have had, the directing finished off. Don't blame the cast; they did OK. Even the winemaker's younger brother was pretty well done, and he didn't even get into the movie until halfway through. And please, please put Mandy in some more movies! She's too beautiful to bury her career at such a young age. Ya' breakin' my haht, heah....<br /><br />Two specific criticisms, in case anyone cares (apparently nobody liked this movie very much). First, the way Traci kept popping up at just the right melodramatic moment, in order to see whatever she was supposed to see, and never got seen in return, was very annoying. Hollywood: please stop giving villains perfect timing luck which runs out exactly when the climax arrives. It's dumb. Write better scripts so you won't have to use that lame plot device any more. If your script isn't good enough to stand up without that, then don't produce it.<br /><br />Second, Carmen wouldn't have fallen for that fake injury trick that Traci pulled. She already had Traci fingered. More bad writing/directing there.<br /><br />I could trash this movie further but mercy forbids it. Actually I didn't hate it as much as the others seem to have. It just didn't have much of a reason for being made, unless it was purely a vehicle to show off the lovely Mandy. Oh, and to whoever didn't think she was sexy... the character wasn't very well written, but how can you say she wasn't sexy?!? One or the other of us needs glasses, and I don't think it's me.<br /><br />MORE MANDY. (Not to be confused with \"Moore, Mandy\" -- although I'd like to see her again too. ;-)<br /><br />P.S. Did I mention I hope Mandy makes me more movies? <:-D"
        },
        {
            "id": "neg_346",
            "text": "Because IT IS, that's why! This is the same jealous-daughter-kills-people flick we've seen a billion times. Rosanna Arquette makes anything worth watching, and Mandy Schaffer's brief nude scene (after teasing via scantily clad attire throughout the film) at the end almost make this trite blarney worthwhile, but not quite.<br /><br />* out of ****"
        },
        {
            "id": "neg_347",
            "text": "This is just a case of a previously worthless island changed into something worthwhile. Jesus Christ people lets throw a big fit over 2000 islanders big deal.This is just a case of a previously worthless island changed into something worthwhile. Jesus Christ people lets throw a big fit over 2000 islanders big deal.This is just a case of a previously worthless island changed into something worthwhile. Jesus Christ people lets throw a big fit over 2000 islanders big deal.This is just a case of a previously worthless island changed into something worthwhile. Jesus Christ people lets throw a big fit over 2000 islanders big deal."
        },
        {
            "id": "neg_348",
            "text": "This movie is a crappy and forgettable Sean Connery vehicle. The performances are generally crappy especially by Capshaw, Fishburne, and the usually solid Ed Harris. Connery seems miscast as a Harvard Academic. The movie absolutely gets worse as it goes along. It is a third rate mystery that becomes extremely contrived by the time it unravels. The movie squanders an excellent supporting cast. George Plimpton also turns up in a minor role to add some gravitas to Connery as they debate the death penalty. The violence and the atmosphere pepper a third rate mystery/thriller that is manipulation to the highest degree. The scripting and direction are extremely poor. Connery's charisma and screen presence are the film's only virtue. Manipulative, Violent, and Ridiculous. 2/10 Avoid It."
        },
        {
            "id": "neg_349",
            "text": "A pot - boiler if ever I saw one. A supposed thriller borrowing from \"A Time to Kill\", \"Silence of the Lambs\", even an inverted \"In the Heat of the Night\" with a little reverse murder, a la \"Strangers on a Train\" thrown in, it fails abysmally where all the above, to a large degree, succeeded. Namely, in delivering thrills. The plot seems condensed from a bigger book, making the plot developments obvious and uninvolving, while the direction lacks pace and verve. To rein in any kudos, a major twist had to be delivered along the way and here it fails palpably too. Connery is clearly slowing down in his old age, barely bothering with his attempt at a US accent and besides seems too old to be the husband of Hope Lange and the father of those gosh - darn kids of his. He even has a father in law who seems younger than him. Laurence Fishburne barely gets the chance to inhabit his role and you're confused from the outset as to whether he's a bad guy or a good guy. Someone once said that flashbacks shouldn't lie - they do, confusedly, here. The rest of the playing is merely average by a reasonable cast in their underwritten stereotyped roles. The supposed climax managed too, to roll by leaving me firmly entrenched in the back, not as should have been the aim, front edge of my seat. Mediocre sloppy Hollywood film making for sure."
        },
        {
            "id": "neg_350",
            "text": "The performances of Fishbourne (who appears strangely funny somehow) and (short featured)Ed Harris are remarkable, unlike Connery's who doesn't appear to find sense in his role and ends up in the motorial behaviour of a 80yr old man. In fact the screenplay doesn't make sense; imagine a 60 min. happy ending-plot plus a sudden turn appendix without any argumental structure in respect to the characters. It's more an accident than a screenplay and may be good for examination purposes at screen-wrights' schools. The more you remind the details the stronger this impression gets. The capital punishment is not an issue here, although it is a subject from the beginning; it sort of fades away without further comment. The subject-matter and environment could have been good."
        },
        {
            "id": "neg_351",
            "text": "1st watched 2/16/2002 - 4 out of 10(Dir-Arne Glimcher): Mystery??/Thriller with too many ridiculous plot twists. Despite the very talented cast this movie is way too predictable and just downright under-estimates it's audience. The movie-going public is not stupid and I hope will not keep filling certain stars pockets again and again despite what they are involved with. We think that this movie is going to be about something with Connery's conviction against capitol punishment in the beginning but it turns out to be nothing but a standard, contrived for the audience's sake, run of the mill, let's never get it over with, thriller. We are pulled into every silly switch in character, as they are portrayed to us when it's needed in the story, and we're ready for this thing to be over way before it ends. Yes there is some good acting here, especially from Blair Underwood, Fishburne, and Ed Harris in a psycho-supporting role but the story does not work from almost the beginning to the very long-awaited end."
        },
        {
            "id": "neg_352",
            "text": "Seems that the cast should ensure at least an average movie. And so I sat down for 102 minutes of unbelief. Beside Ed Harris no-one seems to own the skills of acting. Even Sean Connery, who I normally worship, must have had an off-day during the entire filming of Just Case. Not once in during the whole movie one actor could convince me.<br /><br />This made this movie look cheap and unreal.<br /><br />The story makes up a little. It is thrilling, and the plot is unexpected.<br /><br />Conclusion only watch this movie if you really have nothing more useful to do."
        },
        {
            "id": "neg_353",
            "text": "As other reviewers have noted the film dies in the last 1/2 hour. However before that it suffers from predictability and a stunningly vapid performance by Kate Capshaw, who clearly never found her character and ruins every scene she's in. Connery is fine as is Fishbourne, but most scenes are manipulated for effect rather than truth which overlays the entirety with a sense of unreality. And the ending is simply bizarre. The film makers apparently knew when they pieced this mess together that all they needed were sweet potatoes and pumpkin pie to have Thanksgiving dinner, so to compensate they added an overloud \"dramatic\" score. Every little jump is accompanied by a crescendo of orchestration, to the point where it becomes laughable. If you want an example of major league bad film this is one to see, otherwise skip it."
        },
        {
            "id": "neg_354",
            "text": "Look carefully at the wonderful assortment of talent put together to make this movie: Connery, Fishburne, Capshaw, Harris, Underwood, Beatty, Thigpen, even cameos by Slezak, Lange, and Plimpton. They prove, in spades, the adage that a good cast cannot save a bad script. The story line requires so many leaps of faith from the audience that its implausibility should have exceeded even Hollywood standards. It's not particularly original, and the \"twists\" are downright cruel."
        },
        {
            "id": "neg_355",
            "text": "Just Cause is one of those films that at first makes you wonder quite why it was so heavily slated when it came out - nothing special but competent enough and with an excellent supporting performance from Ed Harris. Then you hit the last third and everything starts to get increasingly silly until you've got a killer with a flashlight strapped to his forehead threatening to fillet Sean Connery's wife (a typically mannered and unconvincing Kate Capshaw) and kid (a very young Scarlet Johannsen) in an alligator skinner's shack. <br /><br />The kind of movie that's probably best seen on a plane, and even then only once."
        },
        {
            "id": "neg_356",
            "text": "The form of the film is that of a suspense shocker. There are surprises, twists and turns, reverses and excitements. At times, this is truly an \"edge-of-the-seat\" film. But it disappoints, and disappoints severely.<br /><br />The villain of the piece is not believeable; his character does not hold together. I refuse to \"spoil\" the film, but will only say that the character we meet at the beginning just could not be he whom we see at the end.<br /><br />The second major disappointment of the film is that--finally, it becomes little more that a bloody slasher film. There is little qualitative difference between this and one of the \"Friday the 13th\" films. Not that every film need always be totally tasteful, but this film does drip gore on occasion.<br /><br />Though the film features the magnificent Sean Connery, even he does not measure up to his usual standard, and often just seems to be walking through the paces."
        },
        {
            "id": "neg_357",
            "text": "JUST CAUSE showcases Sean Connery as a Harvard law prof, Kate Capshaw (does she still get work?) as his wife (slight age difference) and Lawrence Fishburne as a racist southern cop (!) and Ed Harris in a totally over the top rendition of a fundamentalist southern serial killer.<br /><br />Weird casting, but the movie plays serious mindf** with the audience. (don't read if you ever intend to seriously watch this film or to ever watch this film seriously due to the spoilers) First of all, I felt myself rolling my eyes repeatedly at the Liberal stereotypes: the cops are all sadistic and frame this black guy with no evidence. The coroner, witnesses and even the lawyer of the accused collaborate against him (he is accused of the rape and murder of a young girl) because he is black.<br /><br />Connery is a Harvard law prof who gives impassioned speeches about the injustices against blacks and against the barbarous death penalty. He is approached by the convicted man's grandmother to defend him and re-open the trial.<br /><br />Connery is stonewalled (yawn...) by the small town officials and the good IL' boys club but finds that the case against Blair, the alleged killer, now on death row, was all fabricated. The main evidence was his confession which was beaten out of him.<br /><br />The beating was administered by a black cop (!) who even played Russian roulette to get the confession out of him. Connery finds out that another inmate on death row actually did the murder and after a few tete a tetes with a seriously overacting, Hannibal Lecter-like Ed Harris, he finds out where Harris hid the murder weapon.<br /><br />He gets a re-trial and Blair is freed.<br /><br />I think... film over....<br /><br />Then suddenly! It turns out that Blair IS a psychotic psycho and that he used \"white guilt\" to enlist Connery. He concocted the story with Ed Harris in return for Blair carrying out a few murders for Harris.<br /><br />now Blair is on the loose again, thanks to Connery's deluded PC principles! The final 30 min. are a weird action movie tacked onto a legal drama, Connery and Fishburne fighting the serial killer in an alligator skinning house on stilts (yes, you read that right) in the everglades.<br /><br />That was one weird film.<br /><br />So the whole system is corrupt and inefficient, the cops are all just bullies and Abu Graib type torturers, but the criminals are really psychotics and deserve to fry.<br /><br />Truly depressing on every level! The system is completely rotten and the PC white guilt types who challenge it are seriously deluded too.<br /><br />Two thumbs down. Connery obviously had to make a mortgage payment or something."
        },
        {
            "id": "neg_358",
            "text": "Paul Armstrong is a liberal, Scottish-born, professor of law at Harvard, known for his passionate opposition to the death penalty, who is hired to take on the case of Bobby Earl, a young black man from Florida who has been convicted of the rape and murder of Joanie Shriver, an eleven year old white girl. Earl claims that his confession to the crime was obtained under duress by a sadistic police officer and that the real murderer is Blair Sullivan, a serial killer already under sentence of death for several other murders. Armstrong visits Sullivan in his cell on death row, hoping to persuade him to confess to Joanie's murder, thereby saving Earl from the electric chair. <br /><br />At first all goes well. Sullivan confesses and Earl is released from prison when the appeal court quashes his conviction. As this development takes place only a little after halfway through the film, it is at this point that alarm bells will start ringing in the mind of the viewer. \"Warning! Major plot twist ahead!\" And so it proves. The anticipated twist soon materialises. Earl, it transpires, is actually guilty of the crime of which he has just been acquitted, and probably of several others as well, but hatched a diabolical plan together with Sullivan in order to secure his freedom; Sullivan will confess to Joanie's murder if Earl will murder his parents. (Just why Sullivan wanted his parents dead is never precisely explained). Armstrong now finds that he is himself in danger from the man whose life he has just saved; Earl has a grudge against Armstrong's wife, herself a lawyer, who acted as Counsel for the prosecution in an earlier case when Earl was accused of rape. <br /><br />\"Just Cause\" is an example of the auto-cannibalism in which Hollywood sometimes likes to indulge, cobbling together one film by recycling themes and plot devices from a number of others. The first half owes an obvious debt to films like \"Intruder in the Dust\" and \"To Kill a Mockingbird\"; about the only difference is that the Sheriff who beats a confession out of Bobby Earl is himself black, whereas in earlier films he would have been white. (Police brutality is now an equal opportunities activity). The central twist in the plot was borrowed from Costa-Gavras's \"Music Box\", although in that film the revelation does not occur until the very end. The finale, in which a lawyer, his wife and their young daughter are in danger from a former client, is an obvious plagiarism of the two versions of \"Cape Fear\", which also take place in the swamplands of the American South. Ed Harris' characterisation of Sullivan as a Bible-quoting religious maniac is a direct imitation of Robert de Niro's character in the Scorsese version of \"Cape Fear\", made four years before \"Just Cause\". <br /><br />(There is a postscript. Just as \"Just Cause\" borrowed heavily from several other movies, seven years later its central plot twist was, in its turn, to be blatantly plagiarised in the Ashley Judd vehicle \"High Crimes\"). <br /><br />The trouble with this style of film-making-by-numbers is that the resulting films are generally much less distinguished than those which inspired them. The whole is normally very much less than the sum of the parts, and \"Just Cause\" is a much lesser film than any of those which were cannibalised to make it. Harris is normally a gifted actor but this is one of his weakest performances, largely because he is not so much playing a character as playing de Niro playing Max Cady. Blair Underwood is OK as Bobby Earl the (supposedly) innocent young man of the early scenes, but unconvincing as Bobby Earl the murderous psychopath of the later ones. Sean Connery as Armstrong and Laurence Fishburne as the black Sheriff are rather better, but neither is good enough to save the film. (Connery and Harris were to act together in another, better, film, \"The Rock\", the following year). <br /><br />There is another problem with \"Just Cause\". The first half of the film looks like a standard liberal \"issue\" movie, anti-death penalty, anti-racist and critical of heavy-handed policing. The second half looks more like the work of a die-hard reactionary, preaching the message that all criminals are evil bastards, that the only way to deal with them is to fry them in the chair, that liberal lawyers are the useful idiots of the criminal fraternity and that police officers who beat up suspects are to be commended as heroes. The filmmakers seem to have been blissfully unaware that the plot twist casually introduced into the middle of their film had the (presumably unwanted) effect of reversing its political stance, or if they were aware of the problem they ignored it. A suitably convoluted plot was obviously thought to be more important than political consistency. 4/10"
        },
        {
            "id": "neg_359",
            "text": "I've seen my fair share of badly thought-out endings and final twists to films, but I don't recall any film that committed outright suicide like this one did.<br /><br />The film makers were clearly hoping that the great twist would 'surprise' us all.... and it did, but perhaps not in the way the directors had hoped. I was left feeling surprised that Connery, Harris, Fishburn and Capshaw had anything to do with this turkey, individually or collectively.<br /><br />The film up until the final thirty minutes was rather engaging and I like the way the story was unfolding and the nature of the film overall. But once the twist was revealed, the plot holes and inconsistencies were remarkable, the underlying motive for revenge was ill-conceived and the ways things so neatly worked out for Bobby Earl was ridiculously far-fetched. What's worse is that, once the twist was revealed, the remainder of the film became excruciatingly predictable.<br /><br />Harris gave a terrific performance and Connery is like Morgan Freeman in that he never gives a bad performance, even if the movie ain't that great! So all in all, it starts well and the unfolding keeps the viewer interested. The last 30 minutes is one of the most memorable nose dives in the history of cinema."
        },
        {
            "id": "neg_360",
            "text": "I read the book and really enjoyed it from beginning to end. However, when I saw the movie I was very disappointed. First of all, no disrespect to Deborah Raffin but she was too mature to play a woman of 24/25. The late Christopher Reeve was also miscast-same reason. Will, according to the book,was around 30. I would have love to see a little more exploration of his military life, his friend Red, Elly's trip to see him as that was an important part of the characters' storyline development. Also Miss Beasley was miscast as the book mentioned her being a Plus Size lady. I know the movie didn't have the budget of the \"Bridges Of Madison County\" which I believe was released around the same time. <br /><br />But to me this was a very poorly made, low budget, miscast movie. As someone mentioned, I wish that Miss Spenser would come out of retirement and write screenplays for her books as they ought to be. She knows her characters better than anyone, I hope that she would consider doing the casting too. The movie let me down!"
        },
        {
            "id": "neg_361",
            "text": "After reading the book, I loved the story. Watching the movie I was disappointed that so many changes were made. It is understandable that books and movies differ but it was two different stories, only the names and some of the book's story remained. Read the book and you'll have a better understanding of the movie. The book gives you a better development of the characters. These characters are extremely interesting and make you care about them. The locations were indeed in line with the book's descriptions. Some characters not included. Television has microwaved so many great books and stories, this is a perfect example of that. Input from the author doesn't always insure a good movie but it can help sometimes."
        },
        {
            "id": "neg_362",
            "text": "Not to be confused with the Madonna film \"The Next Best Thing\", \"The Last Big Thing\" is a silly, campy, off-the-wall comedy about a man who yearns to start a magazine called \"The Next Big Thing\" which reviews a variety of up and coming artists. This low budget indie makes \"Chuck and Buck\" look like a masterpiece. Fraught with lousy acting, poor sets and costuming, etc., \"...Thing\" has earned some awful reviews and to date has only been nominated for one fringe award. Pass on this one."
        },
        {
            "id": "neg_363",
            "text": "what ends up killing this movie is its self-consciousness, among other things. here's a short list: 1. irreverent behavior. when the beatles came over and injected their brand of \"quirky, irreverent\" behavior/humor, it was greeted as fresh. that was over 4 decades ago. get over it.<br /><br />2. false sophistication. spewing out base, quasi-socio-political-isms is hard ground to make work comically. ask woody allen.<br /><br />3. the post-modern \"i'm hard on this phony world and yes, i recognize it in myself\" snake eating itself - used as illustration with another animal in the film itself! - is such a retread.<br /><br />4. smarmy, smug drollness.<br /><br />5. amateurish writing, acting, direction... ever seen student films? a victim of itself, about the only thing i can say positive is that it at least has a sense of itself, and sheesh, now i'm getting caught up in the self-reflexive thing that it posits as worthwhile, of value.<br /><br />but towards... what? ultimately, it just rings as hollow as any other pretentious piece - hey, ever see woody allen's take on bergman, ie: \"Interiors\"??? well, this just does it more amateurishly."
        },
        {
            "id": "neg_364",
            "text": "Larry Buchanan. Yep, same guy who did \"Attack of the THE Eye Creatures\" and two (count 'em: TWO) conspiracy movies about Marilyn Monroe. He's to blame, here.<br /><br />Adding onto his ever-growing pile of folders left over from Oliver Stone's \"eh-I-grew-out-of-it\" conspiracy drawer, here's \"Down On Us (i.e.- \"Beyond the Doors\") which is the working definition of historical inaccuracy.<br /><br />Forget everything you THOUGHT you knew about Jimi Hendrix, Janis Joplin and Jim Morrison, says Big Lar', cuz this is the real deal! Y'see, the three big names in rock of the '60s were KILLED BY THE GOVERNMENT because they were subversives or counter-productive to Truth, Justice and the American Way, or sumpthin' like that there. I knew it all along.<br /><br />Anyway, three people (Chatman, Meryl, Wolf) who look eerily like their real life shadows (that is, if you completely close your eyes, turn your backs and walk five miles away from them) show that instead of their recorded deaths, the good old US of A put hits out on them! Yep, it's the truth!<br /><br />Man, I cannot believed I watched this movie. It's facts, when not stretching credibility to the snapping point, are ludicrous; the acting makes TV commercials look like high drama and if you honestly watch it through to the end, you deserve the \"twist\" ending. You really, really do; I swear. Genius.<br /><br />But like the man said: \"Rock and roll is dead - long live rock and roll.\"<br /><br />Not this flick, though.<br /><br />No stars for \"Down on Us\". And that's the movie audience describing the film, by the way...."
        },
        {
            "id": "neg_365",
            "text": "Bad plot, bad dialogue, bad acting, idiotic directing, the annoying porn groove soundtrack that ran continually over the overacted script, and a crappy copy of the VHS cannot be redeemed by consuming liquor. Trust me, because I stuck this turkey out to the end. It was so pathetically bad all over that I had to figure it was a fourth-rate spoof of Springtime for Hitler.<br /><br />The girl who played Janis Joplin was the only faint spark of interest, and that was only because she could sing better than the original.<br /><br />If you want to watch something similar but a thousand times better, then watch Beyond The Valley of The Dolls."
        },
        {
            "id": "neg_366",
            "text": "Bad Actors, bad filming, choppy dialog, shallow characters, but then again it was a bad premise in the first place. Basically, an 11 year old who is bullied because he has very little money is given a blank check by a moronic criminal. Of course, the 11 year old happens to possess enough technology and intelligence to purchase a house, cash a check for 1,000,000 dollars, and even foil three bumbling idiots, reminiscent of the three stooges. <br /><br />Preston Blake is an annoying, obnoxious, boy, who decides that, when written a blank check by a complete stranger, he will take advantage of the situation as best as he can. In other words, he wanders into a bank, <br /><br />hands a teller a check he makes in his printer, and miraculously walks out with a million bucks in cash. Preston is also apparently capable of reaching incredible speeds on his bicycle, due to the fact that a man driving a Jaguar after Preston and his 10-speed could not catch him, even when Preston jumped a row of cars.<br /><br />Of course, with every hokey adventure movie, there has to be hot heroine. In this case our hot heroine is a child molesting FBI agent who dates the eleven year old Preston, and promises another date when he turns 17. <br /><br />However, the absolute worst aspect of this film was not its casting, nor its sloppy dialog, such as \"The only other way I could think of skinning a cat is to stick a hose up it's butt and then pick up the fur\". It was, rather, the entire fact that nobody in the entire film seemed to realize that the FBI does not give a damn about random people . What I have failed to explain is that Preston uses the alias \"Macintosh\" to masquerade as an entrepreneur of sorts. Of course, the FBI finds this intriguing and sends our young heroine after Preston, who uses his 11-year old wit to first scream when lobsters fall on his face, then treat her to hamburgers, finishing with a ridiculous romp through a cemented area where water jettison's from the ground. Our heroine fails to realize during this whole adventure that the criminal the FBI is pursuing is slipping and sliding right behind the two, as they make their way to Preston's limousine, complete with a 1-dimensional driver who never fails to provide cheap, 3rd rate laughs that the whole family can choke on.<br /><br />Overall: 1/10 is incredibly gracious for this film. I don't see how it only has a 4.4/10."
        },
        {
            "id": "neg_367",
            "text": "A young boy comes into a lot of money and promptly begins to live it up. Unfortunately, the man whose money it really is happens to be very bad. He wants his loot back. When he discovers who has the bucks, he begins trying to get it back. He keeps getting foiled by this little kid who is just lucky enough to keep from falling into the evil man's hands. Sounds familiar, I'll bet. Very predictable, not interesting at all. Come up with something a bit different, ok guys?"
        },
        {
            "id": "neg_368",
            "text": "This movie is really goofy! I saw it as an 11 year old, and even then I thought it was pretty ridiculous! I would only recommend this film to kids under the age of 12. I really didn't care for it, but I do think that it answers some very good questions that kids need to be aware of, such as: 1)Does money buy happiness? 2)Should I lie (to my parents) about things I think they wouldn't approve of? 3)Does money buy friendships? 4)Is money everything? 5)Shouldn't I tell my parents when someone is trying to hurt me? Granted, these are very unrealistic situations, but I do think that if parents discussed these issues with their children, maybe they should watch this video as well, in order to show/scare their kids that lies have the potential to get you hurt."
        },
        {
            "id": "neg_369",
            "text": "I almost called HBO and demanded my money back for the month just because they've been airing this movie. I can just see the movie execs sitting around going, \"Okay, we need to come up with something that's just like Home Alone, only we'll add a bunch of cash for the kid, hire cut-rate actors, and oh yeah, we'll make it a lot less funny!\"<br /><br />Okay, maybe not the last part, but that's basically what you've got here. Not even worth seeing if someone else rents it. And as a movie for kids? Forget it. I wouldn't let my kids see this, not necessarily because of bad-taste jokes, but because I wouldn't want them to say, \"What were you thinking showing us that lame piece of garbage, Dad?!?!\""
        },
        {
            "id": "neg_370",
            "text": "Blank Check is easily one of the worst films of the nineties. The plot is completely pointless; its overtones of lonliness are pathetic. Do you really believe a twelve year old acting as a personal assistant for a millionaire could accomplish everything in this film, like buying a mansion for a mere $300 grand. The notion, let alone the bargain-basement price, will only be believed by the most gullible viewers. Please, respect your intelligence and don't watch this awful, awful film."
        },
        {
            "id": "neg_371",
            "text": "The worst movie I have seen in a while. Yeah its fun to fantasize, but if that is what you are looking for, I suggest you see Brewsters Millions. This was just terrible and corny and terrible at being corny. Unless you are five or like terrible movies, don't see this one."
        },
        {
            "id": "neg_372",
            "text": "I saw this movie once a long time ago, and I have no desire to ever see it again.<br /><br />This movie is about Preston Waters, a hard-lucked preteen, who always seems to be overlooked by his family and who always seems to be short on cash. All this changes when a bank robber runs over Preston's bike and passes him a blank check as compensation. Preston uses the check to withdraw $1 million from the bank (ironically, the money belongs to the bank robber who gave him the check). Preston then buys a mansion and says that he's working as the assistant of a mysterious and wealthy backer named Mr. Macintosh (named after his computer). After that, he just goes crazy with the money.<br /><br />On paper, this sounds like a great idea. However, on screen, it is one of the emptiest movies I've ever seen. For one thing, it's too unbelievable. I know some parts of the movie were meant to be incredible, but I draw the line at a twelve-year-old boy going out with a thirty-year-old woman, and being put in charge of a imaginary person's small fortune. Also, this was a shallow movie with weak acting, a predictable plot line and characters who are less than memorable. The characters were either cheesy, over the top, annoying, or underdeveloped. But \"Juice\" was a funny character.<br /><br />If you're looking for a good movie to watch with your family, skip this one."
        },
        {
            "id": "neg_373",
            "text": "Blank Check is a movie that I saw on TV one day and like most movies they air on TV Blank Check wasn't that good. First of all no one I have ever met has seen Blank Check and that includes people that grew up in the 90s. Also Blank Check won't be remembered in the 00s either simply due to the fact that it will be overshadowed by pixar's films. I wouldn't call Blank Check a bad film but its not really entertaining either. (Or at least it isn't to anyone over the age of 6) Blank Check isn't a entertaining film because nothing about it is original. Everything just makes you go \"what haven't I seen this before?\" Blank Check rips off and tries to cash in on everything from Richie Rich to Home Alone (Which strangely enough both have Macaulay Culkin in it) Blank Check isn't a bad movie, but it deserves to fade into obscurity."
        },
        {
            "id": "neg_374",
            "text": "Blank check is one of those kids movies that could have been a great suspense thriller for the kids but instead it's a tired lame home alone ripoff that isn't worth a dime. Quigley is a criminal who just escaped from jail and gets his hidden million dollars from a big score and then we meet Preston a frustrated kid whose room is taken over by his brothers to start a business and obviously dad treats his brothers better because they make money the same day he goes to a kid's birthday party and since his dad is a cheapo he goes on little kids rides while the other kids go on roller coasters then he receives a birthday card and a check of 11 bucks how cheap is this family? So he goes to the bank to open an account and meets the gorgeous Shea Stanley were her parents mets fans? he finds out he needs 200 to open a account meanwhile quigley gives his million to his banker friend and finds out the bills are marked so he will send a lackey named juice to get the unmarked ones when Preston leaves his bike gets run over by quigley he's about to write a check when he spots the cops and bolts back home his parents scolded him about his busted up bike and gets grounded what? their kid got almost run over and they worried about a bike? So Preston forges a million dollar check via his computer and comes back only to be escorted to the banker thinking that he's juice he gives Preston the money but the real juice came and realized they been duped by a kid! So Preston buys a mansion under the name Macintosh gets a limo driver who says unfunny jokes and goes on a epic shopping spree then he spots Shea and talks about opening his account kid you're loaded and you're talking about opening an account? We soon realized Shea is actually an FBI agent tracking down quigley and his two other accomplice's then he told his cheapy dad he's got a job working for Mr Macintosh and spends the day riding go karts playng vr games and hanging out with his limo driver buddy then he goes out on a date with Shea in a fancy restaurant what a 10 year old wining and dining a 20 something FBI agent? Afterwards he takes her to a street geyser and playing around in the water messing up Shea's 300 dollar dress yet she takes it well if this was a bit realistic she would slap him for messing up her expensive dress so quigley and the others still mad interrogates a little kid and quickly spills the beans and Preston is being chased by quigley in a scene taken from the original script and afterwords he is hosting Mr Macintoshs birthday which is really his birthday when he discovers he couldn't pay for the party he sits in his chair and dad talks to MacIntosh which he doesn't know it's his son he's talking to and talks about Preston should be a real kid and has his whole childhood ahead of him and wants Preston to go home early what? an hour ago you were grilling him about his finances! so Preston asks everyone to leave and sits alone pondering when quigley and the others break in to the house to make Preston pay and so he faces then in a finale that rips off home alone quigley gets spun around in a ball while Preston is driving a go kart juice gets hit in the groin and more antics ensue until the trio get Preston cornered and when it seem all hope is lost Shea and a bunch of SWAT guys come to save the day and so quigley and his crew get sent to jail but is there any hope for Preston and Shea? there is and she kisses him in the lips what? what? what? A grown woman kissed a kid in the lips. come on is she mentally disabled? I mean an FBI agent who knows the country's laws would risk her career to kiss a kid? she could get arrested on the spot! and the most creepiest part of all is that isn't goodbye and she'll see him in 6 or 7 years! oh dear and so he comes home to his family celebrating his birthday so the moral of the story is love and respect can be bought? What are they smoking? The bottom line is that is a waste of time the morals are whacked it's flat as a tortilla the kid is annoying the villains are lame the comic relief isn't funny the brothers are unlikable the dad is even worse the romantic subplot is creepy the plot's shallow and the only saving grace is the cinematography from bill pope which went on to shoot the matrix trilogy and two of the spider-man films so people don't waste your money and go watch home alone instead. <br /><br />This has been a Samuel Franco review."
        },
        {
            "id": "neg_375",
            "text": "Two years ago, on Berlin Film Festival we watched the Amos Kollek movie \"Sue\" in the Panorama program, with a wonderful Anna Thomson in the leading part. It's a film about loneliness and sex, and how the one thing is compensated by the other. In the same section on the Festival now we have to complain the superfluous antithesis of Sue, \"Extension du domaine de la lutte\", which now tries to convince us that loneliness and having NO sex is one and the same problem. But unfortunately we can't sympathize with \"our hero\" (how he is called by the story-teller), because he is unnecessarily and incomprehensibly tired of company and himself. Own fault, I'm sorry. I can't understand him. Not enough, the writer/director/actor want us admitting to him, that it's not his destroyed self-consciousness or the passivity of his personality, what brought him so far, but the rotten society and its image of sexuality. Yes, there are some deeper insights about gender relations, but we won't follow him so far... And the point is, that there is rather any sign of reflection about his own portion to the fate, having no sex. Who didn't notice yet, it's a quite depressing film...<br /><br />In the beginning, there had been some starts to be more accurate in sketching the situation. At the bed store the \"hero\" speaks about the hindrances buying a new bed. Perhaps it's too broad getting up the stairs, you have to stay at home half a day... THIS is a satire about a character, who doesn't know taking the life and heart in hands, DOING something... The movie doesn`t follow this path, but handles his characters with helplessness. Nobody believes, that \"our hero\" is able to instigate Tisserand for a murder. Too dull, too kind, too - passive (not to mention Tisserand's complex; he has an inhibition, but he couldn't be, of course, a murderer of women!). To finish: There are women and the world, it's not a device of a modern sexualized society. Help you as you can, but don't follow the messages and the \"wisdom\" of this movie, which announces bankruptcy to human relationships, without seizing the real conflicts within."
        },
        {
            "id": "neg_376",
            "text": "The French film \"Extension Du Domaine De La Lutte\" directed by iconoclast film maker Philippe Harel is based on the book of the same name written by a controversial writer Michel Houellebecq.He has also worked on this film's scenario.According to British cinema magazine Sight and Sound,it is also known as \"Whatever\".This film has been hailed as a breath of fresh air for French cinema due to its not so common theme of sexual politics and its implications on two stupid information technology workers.The film is marred by its much too evident voice over which introduces us to the main character.This makes us viewers feel as if we are watching a book that is bring read. The basic premise of problems related to loneliness due to chronic sexual drought is fine but the film goes out of hand once the hero starts recounting the misery faced by him and his friend.Instead of sticking to its main topic the film veers in other directions leading to its downfall.Beware:some women viewers might find not only the film but even its two heroes as moronic misogynists."
        },
        {
            "id": "neg_377",
            "text": "Don't even ask me why I watched this! The only excuse I can come up with that I was sick with Bronchitis and too weak to change the channel. :) It's too terrible for words, the movie that is, not the Bronchitis. The acting is deplorable, Richard Grieco hams it up as a trigger-happy, gun-slinging serial killer with a penchant for knocking off cops. Nick Mancuso phones in a performance as the cop on his trail and Nancy Allen manages to put in the only sympathetic role in the entire film. The script is dismal, peppered with clichéd lines, \"Are you ready, Pardner?\" purrs Richard Grieco to every single one of his victims. Dire. Avoid."
        },
        {
            "id": "neg_378",
            "text": "... but the keyword here is \"usually.\" I have been known to adore movies EVERYONE thinks are dumb. But in the world of B-rated movies, THIS one is Z-rated. Absolutely ridiculous. The thing I respect about most of my favorite B-rated movies are that they don't take themselves too seriously. The makers of movies like that sort-of treat the movie lightly, even if it's a heavy topic. I get the impression, however, that the producers of this movie took themselves way to seriously, like they were putting together a 10-star classic, complete with poor attempts at poignant lines and dumb camera shots. Nevertheless, despite all this, I STILL gave it 4 out of 10 stars, as I am biased towards movies like this. If you're a B-rated fan, however, I would try too hard to find this one."
        },
        {
            "id": "neg_379",
            "text": "The TV guide calls this movie a mystery. What is a mystery to me is how is it possible that a culture that can produce such intricate and complex classical music and brilliant mathematicians cannot produce a single film that would rise above the despicable trash level this film so perfectly represents. This is Bollywood at its best/worst, I honestly cannot tell the difference. Nauseatingly sweet, kitschy clichés on every level, story-line, situations, dialog, music and choreography. To put it bluntly, you must be a retard to enjoy it. I watched it to satisfy my cultural curiosity, but there were times when I had to walk away from it, because I could not take it any more. The only redeeming quality of the movie is the exquisite beauty of the leading actresses. <br /><br />"
        },
        {
            "id": "neg_380",
            "text": "I wonder if there is any sense of sense in this movie. Its a big joke. Good.. Its entertaining .. You get to see the most stupid plot played very seriously in the form of a film .. I wonder which audience group this movie is basically targeted to.<br /><br />Priety (a pros) plays a surrogate mom for a happy couple Salman/Rani who want a child but can't. I wonder how it would be if this drama was a real-life take-off from a real couple's life.<br /><br />Rani appears happy with another pretty lady in her house who has been brought in to make a child for her & Salman. She cares for Priety and tries pushing her husband Salman to Preity so they may have some romance. When will the audience get fed up of Salman's nakhras.<br /><br />Though a good past-time, this movie is unbearable. Absurd."
        },
        {
            "id": "neg_381",
            "text": "This movie is traditional bollywood fare as far as the star power, sentimentality and love triangle of emotions. What really bothered me about this movie was the makers' absurd notion of surrogate mother. A whore who conceives a child with someone after have sex with the man (of the family desiring a child) is not a surrogate mother. Neither is she a good candidate for a surrogate mother. I have seen Indian movies and television shows that made 10 to 15 years ago that dealt with this issue more intelligently. The whole concept of the movie is ridiculous and absolutely implausible. I realize that most bollywood movies aren't meant to be plausible, but they don't pretend to be either. This movie wants us to emote along with the characters, but this can't done with such a ridiculous, contrived conflict. I would have expected better from Abbas and Mustan."
        },
        {
            "id": "neg_382",
            "text": "Hail Bollywood and men Directors !<br /><br />Really this is the ultimate limit in utter sacrifice made by Indian Woman !!<br /><br />Viewing the current state of affairs in India where The wives are becoming more vicious day by day and are very possessive about their husbands - the Directors ..also can be called Uncle Scars (refer movie The Lion King) came up with a very new concept on how both the kept and the wife can live together happily ever after sharing everything between themselves ...including the spermikins !!<br /><br />Story line : Married couple - very happy - but accidentally a mishap happens and wife has a miscarriage - lost the foetus along with the capacity of ever becoming a mother !<br /><br />Now in in India, the in- laws usually drive away the daughter- in- law if she fails to give them an heir ! So the wife hits upon a major plan - surrogate mother...but the scientists intervened - \"Sure artificial insemination\" - NO said the artist (Director actually) - \"Neighbourhood will come to know that the daughter - in - law is barren so they are going for surrogate mother !!<br /><br />Neighbours ! society !! gosh the same ones who watch Fashion TV day and night - watching girls between the age group of 14 to 40 ...al in bras and panties - well those neighbors suddenly take an upper hand in family planning and decision making !!<br /><br />SO the wife sends away her husband to a beer bar where girls are dancing on the stage - all mostly uneducated and illiterate - but men love such women as they can satisfy their egos a lot !<br /><br />He hires the lead dancer in the pub - asks her to bear his baby - in exchange for money - she agrees - she comes home - becomes pregnant - wife and kept - both co-exist in the same house - in the mean time the prostitute also gets a taste of household life - so much caring people around - she misses them all and cries silently !! In the mean time - no one in the family comes to know that the real daughter in law is roaming around with a pillow beneath her petticoat !!- the mother or other elderly people never took her for check-ups - nor did they try to feel the baby's movements in the womb !!"
        },
        {
            "id": "neg_383",
            "text": "The plot line of No One Sleeps is not a bad idea, and the subject matter is of quite a bit of interest. But, throughout watching this film, we were saying aloud, \"These filmmakers go to the trouble of finding good locations, the lighting is good, makeup and hair are good...why is the sound so bad?\" Throughout the film the sound was echoy, garbled and much of the dialog was unintelligible.<br /><br />There is some good acting in this film, and I think Jim Thalman is really a good actor. This story, with some of the same actors, would have been worth doing as a high-budget film.<br /><br />I just can't reiterate enough - if you have a limited budget, dedicate more to good sound. Sound is as much a part of a film as the image, and it's worth doing right. Could've earned a 6."
        },
        {
            "id": "neg_384",
            "text": "I don't give much credence to AIDS conspiracy theories but its sociologically interesting to see the phenomenon dramatized. In the early years of the AIDS epidemic, the suffering and paranoia of the scared and dying often generated such dark fantasies. This was especially true in the politically radical and sexually extreme demi-monde of San Francisco. The city, renowned for its beauty, has rarely appeared uglier than in this film. A sense of darkness and decomposition pervades every scene.<br /><br />While the acting and plot can't be said to be well-done the films unique cultural context and oppressively dark mood at least partly saves the film from being a complete loss. Actually, I found the most interesting performance to be Irit Levi as a crusty and cynical Jewish, lesbian (?) police detective. She's interesting, though not necessarily convincing.<br /><br />Highlights: the film's use of the garishly tragic Turandot is an effective motif and there is a sublime silent cameo by iconic performance artist, Ron Athey."
        },
        {
            "id": "neg_385",
            "text": "Poorly written conspiracy drama/mystery about the possibility that AIDS was introduced to the public by the government. Wlaschiha plays a gay researcher looking for answers--that within this foggy plot would be hard for anyone to find. Despite the cinematography itself being commendable, the camera hungers for characters of true depth instead of the shallow, amateur acting it unfortunately has to convey. Grade: D+"
        },
        {
            "id": "neg_386",
            "text": "Jochen Hick wrote and directed this little thriller of a suspense film based on the concept that the AIDS virus was a sheep virus mutated by the government to rid the world of gays and was apparently tested on convicts in the years before the outbreak of the hideous disease. Were it not for the poignancy of the concept of the film, this would fall into the category of the many films about the ruination of the world by a rampant non-prejudicial infective organism.<br /><br />Stefan (Tom Wlaschiha) journeys from Berlin to San Francisco to investigate his father's scientific suppositions about the induced sheep virus and its effects of the convicts in whom it was infused. He meets with some disdain and resistance to a dead theory, but also encounters some folks who know of the theory and support his investigation. Simultaneously with his visit a series of serial murders takes place, each victim killed in a similar manner and each murder apparently accompanied by strains of music from Puccini's opera 'Turandot' which just happens to be opening at the San Francisco Opera. A police investigator Louise Tolliver (Irit Levi) and her companion cop (Kalene Parker) follow the murders while Stefan makes the rounds of the sex clubs and bars in San Francisco trying to locate men who may have been guinea pigs for his father's theory. He encounters a strange lad Jeffrey (Jim Thalman) with whom he has a cat and mouse attraction and a prominent Doctor Burroughs (Richard Conti) who seems oddly involved in the cast of suspects. How this all come to an end is the play of the film, a story as much about the search for self identity between Stefan and Jeffery as it is a case for investigation of murders.<br /><br />While Tom Wlaschiha, Jim Thalman and Richard Conti do well with their roles (they are the only three who have any prior acting experience in the film!), the quality of the film sags considerably by the less than acceptable minimally talented Irit Levy and Kaylene Parker: when on screen the credibility of the story drops below zero. There are some small cameos by other actors that brighten the screen for the moments they inhabit, but in all the film is drowned by the incessant replay of 'Nessun dorma' as sung by Mario del Monaco from a recording o the opera - and that seems to be the reason for making the film! Good idea for a film and some good characterizations by the actors, but there is no resolution of the initial premise that started the whole thing. Grady Harp, February 06"
        },
        {
            "id": "neg_387",
            "text": "One has to wonder if at any point in the production of this film a<br /><br />script existed that made any sense. Was the rough cut 3 hours<br /><br />long and was it trimmed into the incoherent mess that survives? <br /><br />Why would anyone finance this mess? I will say that Tom<br /><br />Wlaschiha is a good looking young man and he does what he can<br /><br />with the dialogue and dramatic (?) situations he is given. But<br /><br />characters come and go for no apparent reason, continuity is<br /><br />non-existent, and the acting, cinematography, and direction are (to<br /><br />put it politely) amateurish. Not One Sleeps is an unfortunate<br /><br />choice of title as it will probably prove untrue should anyone<br /><br />actually attempt to actually watch this film."
        },
        {
            "id": "neg_388",
            "text": "I can't stand most reality shows and this one is worst than the one with Paris Hilton, and sure it's his company. But \"you're fired\" or \"you're hired\", for how many seasons now? After watching the show I wouldn't want to work for the guy with his ego and all and I think watching paint dry has more entertainment valve.<br /><br />I'd love to hear just one person get up and say \"Donald I quit and take some of your money and buy a decent hairdo\". I see he's even trying to buy fame in the wrestling WWE. I hope he gets hurt so I don't have to see his pathetic face anymore. It must be sad to want fame so bad and have no talent and make an ass of yourself trying to buy it. I'd give this show a negative mark if I could but it gets a 1 and it doesn't deserve that."
        },
        {
            "id": "neg_389",
            "text": "I bet you Gene Simmons and Vincent Pastore negotiated in advance how many episodes they would be willing to appear in. Isn't just too contrived for Gene to switch to the ladies team and then throw himself on his sword? And Big Pussy? What the hell was that \"look at me, I'm a rat!\" double episode crap? All that cliché mafia banter- COME ON! The big names voted off just happened to already have received money for their charity and got a custom tailored exit. Hmm... This is not reality but staged drama! Mark Burnett's other show, \"Survivor\" also raised questions for me when Johnny Fairplay stages his departure when he clearly had just a short time before his child is to be born.<br /><br />Yuk!"
        },
        {
            "id": "neg_390",
            "text": "I LOVED the Apprentice for the first two seasons.<br /><br />But now with season 5? (or is it 6?) things are getting just plain too tiring.<br /><br />I used to like the show, but its become Donald Trumps own ego fest. Granted its his company you'll be working for, but come on! some of the things says \"You're FIRED\" is just insulting.<br /><br />after watching the show, I would not want to work for him. not because he is arrogant, pompous or such. Its just that the show is unrealistic and the way he handles things makes me just squirm. Good Entertainment? YES, but tiring as the back stabbing gets so tiring.. its not team work, its not personal, its just business. watch your back jack."
        },
        {
            "id": "neg_391",
            "text": "For the first couple of seasons, I thought The Apprentice was a highly engaging and exciting show. The combination between reality TV and a 16 week job-interview was innovative, and the producers of the show managed to keep the show relevant and not too \"out there\".<br /><br />The new season 6 is nothing more than a big joke and it has absolutely nothing to do with business - at all. In the earlier seasons they used to put a lot more emphasis on the business-related tasks - now the focus is mostly in the boardroom where the contestants are expected to do EVERYTHING to keep them on the show (that means lying, trash-talking, backstabbing etc.). The boardroom can be entertaining to watch, but it's entertainment at it's low-point - Sometimes you wonder if you are watching a repeat of an old Jerry Springer episode. The tasks on the show are, at most, boring and mostly a showcase for the companies who are dumb enough to pay NBC for the publicity. And what is the deal about half of the contestants living in tents in season 6? That is just plain stupid and has nothing to do with business in real-life. <br /><br />I have absolutely NO respect for any of the contestants this season, they all seem like idiots to me. In earlier seasons at least some of the contestants had a bit of integrity, now it seems like the contestants would kill their own mother to keep them on the show. It also seems like Donald Trump's massive ego becomes bigger and bigger for every season that pass by and to be honest, I can't see why anyone with a common sense would want to work for him. His rationality in the boardroom mostly doesn't make any sense at all and sometimes it seems he just like to trash people for what it's worth.<br /><br />R.I.P The Apprentice. Please NBC, for God's sake, get the show off the air as soon as possible. It's just too embarrassing to watch. The Apprentice was once a great TV-show, but now it's just a big fat joke."
        },
        {
            "id": "neg_392",
            "text": "Besides being boring, the scenes were oppressive and dark. The movie tried to portray some kind of moral, but fell flat with its message. What were the redeeming qualities?? On top of that, I don't think it could make librarians look any more unglamorous than it did."
        },
        {
            "id": "neg_393",
            "text": "For anyone craving a remake of 1989's Slaves of New York. What are there, seven of you? Here it is... was.<br /><br />This undercooked movie has studiously vapid characters (Well they're club-kids, ya big jerk!) that are in holding patterns. The big question seems to be, just how long can a young adult remain juvenile? It took three people to write this 'story'? Good god, it was easier to come up with Citizen Kane. Rather than take viewers back, this movie should just embarrass anyone who was a scene-ster in the early 90s.<br /><br />The idea that a fifty year old woman envies a bunch of self-absorbed kids from a different era is the world as only self-absorbed, twenty-somethings could imagine it. The odd sidebar about library work is not the sub-plot one expects from the equivalent of Parker Posey's Breakin 2: Electric Bugaloo. Her \"I'm serious about graduate school!\" while a stripper grinds on her is hysterical. Posey's shtick is always amusing, but there are projects that are beneath her. I was asleep before it crossed the 40 minute mark."
        },
        {
            "id": "neg_394",
            "text": "I cheer for films that fill in subject matter gaps in world cinema. So after watching the trailer for \"Water Lilies,\" I expected to like this film because I thought I'd stumbled on something unique: a movie that honestly portrays teen lesbian love - sort of a female version of \"Beautiful Thing.\" <br /><br />The main characters are young French women 15 years old. Marie is slender, reticent and pretty in a tomboyish way; Floriane is outgoing, athletic and beautiful; and Anne is loyal, pudgy and behaviorally immature. The erotic interrelationship between Marie and Floriane is always simmering in this movie, if not at the surface, then just below it. <br /><br />\"Water Lilies,\" however, is not about the dawning of lesbian love upon two teens; it is about sexual frustration, suffering, ennui, teens working at cross-purposes and - in at least two instances - joyless, mechanical sex. It also proves that screenwriters and film-makers mar their own creations when they become too manipulative.<br /><br />In the extra features on the \"Lord of the Flies\" DVD, director Peter Brook says, \"French cynicism starts with the arousal of sex,\" meaning the French regard children as angels while they regard adolescents and adults with a pervasive cynicism. Part of the downfall of this film is film-maker Celine Sciamma has gulped a mighty dose of this cynicism.<br /><br />\"Where is the joy?\" I asked myself while watching this film. Yes, first love can be painful and frustrating, but it can also be joyful and triumphantly erotic in a fresh, life-affirming way. These positive aspects are missing from this movie; there is no balance.<br /><br />Organically, this movie wants to be a poignant celebration of first love. But Sciamma is too impressed with her own cynicism and cleverness and ruins the film. First, what is the point of showing only the plump girl nude? I know there is an established tradition of tasteful teen nudity in European cinema, as evidenced by films like \"The Slingshot; The Rascals; The Devil, Probably; The Little Thief; Murmur of the Heart; Friends; Beau Pere\" and \"Europa, Europa\"; but this instance is a petty authorial intrusion - \"See, audience, I can make a film where I show only the unattractive person nude.\" Either no nudity or evenly distributed nudity would've been an honest way to go.<br /><br />There is a scene in a club where Floriane and Marie are dancing. What follows next is not just Floriane cynically manipulating Marie; it is film-maker Sciamma cynically manipulating her audience.<br /><br />Perhaps the biggest betrayal of authenticity and organic honesty takes place when Floriane warns Marie she's about to request something that is \"not normal.\" Marie understandably asks, \"Who cares about being normal?\" Then Sciamma plays false with her audience and the hurtling momentum of the movie, because Floriane's request is a phony, derivative and substitute question - not the authentic, heartfelt question the movie, Marie's character and the viewers who've invested their time deserve. <br /><br />Here are also two moments which clank falsely on the viewer's nerves: 1) Since when do the French - of all people - take baths wearing bathing suits, and with a turtle to boot? 2) What teen - of any nationality - would chomp down on an apple core that's been thrown in the garbage in order to get a taste of the beloved's mouth?<br /><br />The three main actresses are promising and, if they find better vehicles for their talents, may become excellent actors. Louise Blachere (Anne) is the best actress in terms of technique and could have a successful career in supporting roles. Adele Haenel (Floriane) could become a leading lady, or a bombshell, or both. Pauline Acquart (Marie) possesses an intensity and magnetism which are unmistakable. In the future, she could play everything from an emotionally crippled librarian to a mysteriously sensual seductress to a reluctant politician riding a meteoric rise in acclaim.<br /><br />All in all, \"Water Lilies\" was very disappointing. Will an honest film-maker please make an authentic movie about two young women falling in love! No - not necessarily for the sake of this middle-aged guy - but so young lesbian girls can have something of quality they can watch and identify with. And yes, to fill a subject matter gap in world cinema."
        },
        {
            "id": "neg_395",
            "text": "When I ordered this from Blockbuster's website I had no idea that it would be as terrible as it was. Who knows? Maybe I'd forgotten to take my ADD meds that day. I do know that from the moment the cast drove up in their station wagon, donned in their late 70's-style wide collars, bell-bottoms and feathered hair, I knew that this misplaced gem of the disco era was glory bound for the dumpster.<br /><br />The first foretelling of just how bad things were to be was the narration at the beginning, trying to explain what cosmic forces were at play to wreak havoc upon the universe, forcing polyester and porno-quality music on the would-be viewer. From the opening scene with the poorly-done effects to the \"monsters\" from another world and then the house which jumps from universe to universe was as achingly painful as watching an elementary school production of 'The Vagina Monologues'.<br /><br />Throughout the film, the sure sign something was about to happen was when a small ship would appear. The \"ship\" was comprised suspiciously of what looked like old VCR and camcorder parts and would attack anyone in its path. Of course if moved slower than Bob Barker's impacted bowels, but it had menacing pencil-thin armatures and the ability to cast a ominous green glow that could stop bullets and equipped with a laser capable of cutting through mere balsa wood in an hour or two (with some assistance).<br /><br />Moving on... As the weirdness and bell bottoms continue... We found out that they're caught in a \"Space Time Warp\". How do we garner this little nugget of scientific information? Because the oldest male lead tells his son that, in a more or less off-the-cuff fashion, like reminiscing about 'how you won the big game' over a cup of joe or an ice-cold bottle of refreshing Coca-Cola. Was pops a scientist? Nope, but he knew about horses and has apparently meddled as an amateur in string theory and Einstein's theories.<br /><br />The recording I watched on DVD was almost bootleg quality. The sound was muddy and the transfer looked like it had been shot off a theater screen with the video recorder on a cell phone, other than that, it was really, really, really bad. (There's not enough 'really's' to describe it, really).<br /><br />I know some out there love this movie and compare it to other cult classics. I never saw this film on its original release, but even back then I think I would've come to the same conclusion: bury this one quick."
        },
        {
            "id": "neg_396",
            "text": "I saw this when it was in the theater, it started out so strong I mean back in 1980 this was a bold movie and the special effects were excellent AT THE time. Now you would have to of been at least 30 or so in 1980 to really understand this point because studying film historically misses the mind set at the time the expectations, and other related psychological factors. Now as I said the movie was engaging suspenseful and very entertaining. It builds to an excellent climax then.... IT ends I mean the person that described it as having a water balloon break in your hand before throwing it, besides being a very poetic description. In my experience, it was just not strong enough. My wife and I were well... how can I say this? We were upset, I mean we paid money, invested the time to watch the movie which was excellent. \"We both felt we were robbed with an ending that convinced us both the production company must of run out of money and could not raise enough to finish it correctly. In fact my wife said it best, it did not end, IT JUST STOPPED!"
        },
        {
            "id": "neg_397",
            "text": "Okay, now what the hell is this supposed to be? Is it a family fantasy movie to cash in further on the huge success of Spielberg's \"Close Encounters of the Third Kind\"? Or a throwback to the glorious days of prehistoric epics such as \"When Dinosaurs Ruled the Earth\" and \"The Lost World\"? Perhaps it's an intellectual & philosophical masterpiece we all fail to comprehend? Yes, that must be it! Whatever it is, the creators of \"The Day Time Ended\" (good old John 'Bud' Cardos of \"Kingdom of the Spiders\" and writer David Schmoeller of \"Tourist Trap\") must have been sniffing quite a lot glue when they penned down the ideas for this demented hodgepodge of genres. The story doesn't make the slightest bit of sense and the narrative structure is incoherent as hell but, hey, who cares as long as it's got papier-mâché dinosaurs, miniature spacecrafts, headache-inducing light & laser shows and spontaneously combusting supernovas! The voice-over introduction is practically inaudible, but no worries as it's all gibberish! Did you know that the definition of 'time' isn't what we all think it is? Time doesn't necessarily pass by chronologically, it is one giant paradox! Words that were spoken thousands of years ago are still floating around now and even things that will happen in the future are already surrounding us. I have absolutely NO idea what all this means, but apparently it provides an easy excuse to gather tap-dancing midget aliens and well-mannered dinosaurs on screen together. I deliberately say well-mannered dinosaurs, because at a certain point one of the prehistoric monsters politely knocks on the front door before menacing his targets. The crazy plot revolves on a family of weirdos living in their solar-powered house in the middle of nowhere. Grandpa is extremely annoying, the granddaughter even more, granny is a walking & talking advertisement billboard for plastic surgery, the youngest son strangely resembles Prince Valiant and the young mother is  incredibly hot! Chris Mitchum for some reason also pointless wanders around the filming sets as the hot mommy's husband on business travel. The special effects are purely cheesy and absolutely laughable (I sincerely hope that the other reviewer who talked about \"excellent special effects\" was being sarcastic), but the absolute most genius aspect here are the dialogs! Just read this wondrous example of extraordinary writing: <br /><br />Grandpa: \"You know what this is, don't you? This is a time-space warp!<br /><br />Stevie: \"I'm not quite sure if I know what that means, dad\"<br /><br />Grandpa: \"Well, I guess nobody really does\" <br /><br />Make up your mind, gramps! Do you know what it is or don't you? And stop talking about \"The Vortex\" like you're some kind of expert in the field! \"The Day Time Ended\" is an incredibly childish and not-worth-bothering-for fantasy movie, though I can totally understand that some of its fans cherish the film because they saw it at young age and became fascinated with the flamboyant effects. The ending completely comes out of nowhere, like they suddenly ran out of money or like the effects of the mushrooms they were eating wore out unexpectedly."
        },
        {
            "id": "neg_398",
            "text": "C'mon guys some previous reviewers have nearly written a novel commenting on this episode. It's just an old 60's TV show ! This episode of Star Trek is notable because of the most serious babe (Yeoman Barrow's) ever used on Star Trek and the fact that it was filmed in a real outdoor location. Unlike the TNG and Voyager series which were totally confined to sound stages.<br /><br />This use of an outdoor location (and babe) gives proper depth and an almost film like quality to a quite ordinary episode of this now dated and very familiar show.<br /><br />Except a few notable exceptions i.e \"The city on the edge of forever\" , \"assignment Earth\" and \"Tomorrow is Yesterday\" The old series of Star Trek needs to be seriously moth-balled and put out of it's boring misery. Half a dozen good episodes from 79 is quite a poor batting average.<br /><br />This is typical of the boring stuff Gene Roddenberry produced back then actually, contrary to popular belief where some people worshiped the ground he walked on, he actually made a LOT of rubbish! He doesn't deserve to be spoken of in the same breath as Irwin Allen for example.<br /><br />Just look at the set of the bridge of the Enterprise from a modern point of view. They used wobbly plywood for the floor, cafeteria chairs with plastic backs and cheap cardboard above the instrument panels. You can clearly see the folds in the paper ! Every expense spared or what !"
        },
        {
            "id": "neg_399",
            "text": "This picture started out with good intentions, Bacon the scientist out to test the theory of invisibility, and Shue is cute as usual in her role. It all falls apart after that, it's your typical Hollywood thriller now, filmed on a soundstage with special effects galore, minus any kind of humour, wit or soul. In other words, don't waste your time watching this. Get the audiocassette tape with John DeLancie as the Invisible Man instead, also starring Leonard Nimoy. Now that was good, and HG Wells is well served, unlike with this mess."
        }
    ]
}