{
    "dataset": "IMDB Movie Reviews (Cleaned)",
    "description": "Movie reviews with only ID and text for NLP tasks",
    "total_reviews": 201,
    "reviews": [
        {
            "id": "pos_200",
            "text": "Updated from a previous comment. The great and underrated Marion Davies shows her comedic stuff in this late (1928) silent comedy that also showcases the wonderful William Haines. Davies plays a hick from Georgia who crashes Hollywood with help from Haines, a bit player in crude comedies. They appear together in cheap comedies until Marion is \"discovered\" and becomes a big dramatic star.<br /><br />A great lampoon on Hollywood and its pretensions. Davies & Haines are a wonderful team, and the guest shots from the likes of Charlie Chaplin, Douglas Fairbanks, William S. Hart, John Gilbert, Elinor Glyn, Norma Talmadge, Mae Murray, Rod LaRocque, Leatrice Joy, Dorothy Sebastian, Estelle Taylor, Louella Parsons, Renee Adoree, Aileen Pringle, and Marion Davies (you have to see it) are a hoot. A must for any serious film buff or for anyone interested in the still-maligned Marion Davies! Dell Henderson plays the father. Polly Moran is a maid. Paul Ralli is the slimy leading man.<br /><br />SHOW PEOPLE was said to have used the career of Gloria Swanson as its model (I think Mae Murray is closer). Davies and Swanson were friends. But this film's story does parallel the rise of Swanson from one-reel Mack Sennett comedies with Charlie Chaplin to STAR in Cecil B. DeMille films of the late teens and early 20s.<br /><br />Davies and Haines were huge MGM stars and friends. Odd that MGM never teamed them up in a talkie. They're great together! A sweet romance and delightful spoof of early Hollywood. Greta Garbo and Bebe Daniels are mentioned but do not appear."
        },
        {
            "id": "pos_201",
            "text": "The great and underrated Marion Davies shows her stuff in this late (1928) silent comedy that also showcases the wonderful William Haines. Davies plays a hick from Georgia who crashes Hollywood with help from Haines. They appear in cheap comedies until Marion is \"discovered\" and becomes a big dramatic star. A great lampoon on Hollywood and its pretentions. Davies & Haines are a wonderful team (too bad they never made a talkie together) and the guest shots from the likes of Charlie Chaplin, Douglas Fairbanks, William S. Hart, John Gilbert, Elinor Glynn, and Marion Davies (you have to see it) are a hoot. A must for any serious film buff or for anyone interested in the still-maligned Marion Davies!"
        },
        {
            "id": "pos_202",
            "text": "A Give this Movie a 10/10 because it deserves a 10/10. Two of the best actors of their time-Walter Matthau & George Burns collaborate with Neil Simon and all of the other actors that are in this film + director Herbert Ross, and all of that makes this stage adaption come true. The Sunshine Boys is one of the best films of the 70's. I love the type of humor in this film, it just makes me laugh so hard.<br /><br />I got this movie on VHS 3 days ago (yes, VHS because it was cheaper-only $3). I watched it as soon as I got home, but I had to watch it again because I kept missing a few parts the first time. The second time I watched it, it felt a lot better, and I laughed a lot harder. I'm definitely going to re-get this on DVD because I HAVE to see the special features.<br /><br />It's very funny how that happens. Two people work together as entertainers/actors/performers. They get along well on stage, but really argue off stage, they can't survive another minute with each other, then some 15 years later, you want to reunite them for a TV special. You can find that in this film. Matthau & Burns were terrific in this film. It's a damn shame they died. George Burns deserved that Oscar. He gave a strong comic performance. He was also 78 when this movie was filmed. So far, he's the oldest actor to receive an academy award at an old age. Jessica Tandy breaks the record as the oldest actress. Richard Benjamin was also fantastic in this. He won a Golden Globe for best supporting actor. He deserved that Golden Globe. Although many people might disagree with what I am about to say, everybody in this film gave a strong performance. This Comedy is an instant classic. I highly recommend it. One more thing: Whoever hates this film is a \"Putz\""
        },
        {
            "id": "pos_203",
            "text": "The Neil Simon's Sunshine Boys starring Walter Matthau and George Burns is a funny comedy on the strange bond to the life and its shortness, but the laughter always bitter taste. Seeing Willy Clark(Matthau) and Al Lewis(Burns) two big theatrical comedy actors now reduced on the imbecility from the hard and unceasing old age you can feel only anger and blue. Willy not ever surrender and continue to look work, while Al is tired for players and he is retired to the country in the house to his daughter. The couple in his old time was truly funny and harmony, but out the scene was a continue squabble and to quarrel, and for eleven years after their broken they not talk between. Now if they would work, they must return together another time for do one of his best old sketch for a comedy story TV show. The meets is explosive and liberating for the old questions. The Neil Simon's screenplay give a certain corrosive spirit to the story and the melancholy and blue overwhelming the many gags and laughter succeeded to generate a good mix also thanks to a great couple Walter Matthu(Nomination Academy Award as Best Actor) and George Burns(Won the Academy Award as Best Support Actor). The two actors are very believable and real and the their harmony seems almost as they real work together for all that time and that realty they not bear between them. The movie is very touching also for its all consuming reality as the story is narrate and how the report Love-Heat that bind the two actors is totally real part to the strange but at the same time ordinarily comprehensible things to the life. My rate is 7."
        },
        {
            "id": "pos_204",
            "text": "First off, I dislike almost all Neil Simon movies. But there is something about this that is unique, that draws me in, and I would say it is among the most entertaining comedies I have seen. The second time I watched it, the connection was clear. When did Neil Simon meet my grandmothers? <br /><br />Ah, afraid they might sue, so he changed them into men. And how dull would it be if they were only housewives, show biz stars is more fun. Well this is a personal review, and my still living grandmother at age 97 (she even outlived Walter Matthau's magnificent impersonation of her!)would deny it -- but some of you must find resonance in these characters.<br /><br />Secondly, I have little tolerance for George Burns, but somehow he turned in one of the finest supporting performances I can recall (and my late grandmother even enjoyed it, although failing to recognize the remarkable similarities she shared with the film character).<br /><br />Very ethnic in flavor, and over the top, you will either laugh and laugh or turn this off. For me, the pleasure lingers."
        },
        {
            "id": "pos_205",
            "text": "First, an explanation: Despite my headline, I'm giving this film only 8 stars because overall this is NOT one of the best films ever made. All the criticisms registered here have valid points. Also, be warned that to enjoy the script you really need to appreciate Neil Simon's brilliance with finding the wit within real human banter. He does have a distinctively New York ear for dialogue -- especially dry, Jewish, love-suffused sarcasm -- and if you have trouble accepting sarcasm as an expression of love, then you might have trouble accepting the optimism at the heart of this movie.<br /><br />So much for warnings. Here's my main point: Walter Matthau is flat-out perfect, even beyond perfect, in this movie. I have never seen him funnier, or more touching for that matter -- because at the same time that he shows us the hilariousness of this character who refuses to give up his Big Star self-image or insufferable attitudes even as his coherence is in decline, he also shows us the more vulnerable, maybe even heartbreakingly scared person inside the grouch. And he only barely shows us that sad part -- it's just enough to really get to you if you happen to be coping with your own father's or husband's mental decline right now (I mention this as a warning), but artistically, it's just enough pathos to give this character the most authentically deep roots I'm seen in possibly any film performance. This is beyond Method acting -- Matthau's performance is exquisite as character work and a pure delight as comic delivery. This is a masterpiece of comic acting.<br /><br />About Richard Benjamin: I personally find his acting annoying in general, and his work in this movie is no exception -- although he has some fine moments here. (\"Chicken is funny....\" is one of them.) So if you like him, you should like him here, and if you don't this movie won't change your mind.<br /><br />About the 1976 Oscars...I agree that Matthau was unfortunate to be up against Nicholson in \"Cuckoo's Nest\" that year. It was a killer year for leading-actor competition; if only there were separate Oscars for comedy and drama, then I think the Best Actor Oscars would have gone to Al Pacino for \"Dog Day Afternoon\" and to Walter Matthau for \"The Sunshine Boys\" -- not to dis Jack's fine work as McMurphy, but I think that Pacino and Matthau were each CLEARLY more masterful and astoundingly effective and downright legendary in their performances than Nicholson was that year. Also, I believe that Burns got the Supporting Actor Oscar more for sentimental reasons than for the quality of his performance -- I mean, he was good in this movie, but not THAT good. (Burns's fine-as-ever but unexceptional-in-itself return to show biz beat Brad Dourif's truly brilliant debut in \"Cuckoo's Nest,\" not to mention Chris Sarandon's stunning debut in \"Dog Day Afternoon\" -- which I think proves my theory.) <br /><br />Oscar theories aside, here's my bottom line review: If you like Matthau's comic acting, then see this movie and savor his powerhouse tirades and wonderful grandmother-inspired gestures, fleeting facial expressions and seemingly unscripted asides. (But if you're currently dealing with the pain of watching an old person lose his grip, then be warned that this movie might either be the comic relief you need or a dose of reality too painful to watch right now.)"
        },
        {
            "id": "pos_206",
            "text": "I'm 14, so you probably would think I have never heard of George Burns or Walter Matthau or anyone like that. Boy are you wrong. I had heard that George Burns was in this movie and that he won an Academy Award for it. I have been a fan of George Burns since I was ten. I saw the movie Oh, God recently and loved it. This one was also very awesome. George Burns did a great job. So did Walter Matthau(this is the first time I've ever seen him perform). And even though they had really small roles, Phyllis Diller and Steve Allen did a good job. That special they were filming would have been awesome if it was really done. Let me say this, if you are a fan of George Burns or Walter Matthau, you should see this movie right away!"
        },
        {
            "id": "pos_207",
            "text": "At first this looked like a boring comedy like The Odd Couple, but when I got into it it turned out to be a really funny film. Basically forgetful ex-comedians Willy Clark (Golden Globe winner, and Oscar and BAFTA nominated Walter Matthau) and Al Lewis (Oscar winning, and Golden Glove nominated George Burns) were a great comedy duo, and a brought back together to revive their hospital sketch for a TV show. Willy's nephew, Ben Clark (Golden Globe winning Richard Benjamin) is confident they can get together again with no hard feelings for each other, how wrong he is. They cannot get on all the time, they are both forgetful, especially during conversation, but they do it eventually. Also starring Lee Meredith as Nurse in Sketch (Miss McIntosh), Carol DeLuise as Mrs. Doris Green, Al's Daughter, Rosetta LeNoire as Odessa, Willy's nurse and Muppets from Space's F. Murray Abraham as Mechanic. I think the best line of the film is Burns mentioning that Matthau called him \"a son of a bitch bastard\". It was nominated the Oscars for Best Art Direction-Set Decoration and Best Writing, Screenplay Adapted From Other Material, it was nominated the BAFTA for Best Screenplay, and it won the Golden Globe Best Motion Picture - Musical/Comedy, and it was nominated for Best Screenplay. Very good!"
        },
        {
            "id": "pos_208",
            "text": "The Sunshine Boys is a terrific comedy about two ex-vaudevillians who reluctantly reunite for a TV special despite the fact that they despise each other.<br /><br />The comic genius of two masters at work, George Burns and Walter Matthau are stellar! Some of the best scenes are when the duo is fighting over the silliest little trivial things! The material is fast-paced and witty, appealing to all ages.<br /><br />MILD SPOILER ALERT: There are some mildly sad moments toward the end of the movie that deal indirectly with the affects of aging that gives the film a soft, sincere, tenderness that shows to this reviewer that what the pair really need the most for success, are each other.<br /><br />If anyone loves The Odd Couple, you'll adore this movie. An excellent film!"
        },
        {
            "id": "pos_209",
            "text": "Walter Matthau and George Burns just work so well together. The acidity of Willy with the perplexed amnesic Al is a mixture made in heaven. The scene when they meet again in Willy's flat is a gem and the final scene rounds up the film to perfection. Walter Matthau gives a superb performance as the irascible semi-retired comedian as only he can, the intonation in the voice and the exaggerated dramatics coupled with his general misunderstanding of what is going on form a great characterization. George Burns timing is legendary and nowhere was it better than in this film, his calm aplomb with desert dry replies are memorable. Watch for the scene near the end when Al and his daughter ask something of the Spanish caretaker, and Al's reaction - priceless."
        },
        {
            "id": "pos_210",
            "text": "Two great comedians in a great Neil Simon movie based on his hit play.<br /><br />Great combination, especially when the comedians in question are Matthau and Burns. Small wonder why Burns won an Oscar for this; he's as sharp and as funny as ever. And Matthau is every bit his match, if a tad more crotchety.<br /><br />This is familiar Simon territory: two old vaudeville partners reunite for a TV special but still can't stand one another after all these years.<br /><br />It's a delight to watch these two pick at each other, their scenes together make this film an absolute delight. Myself, I especially enjoyed the \"knock, knock, knock / ENTER!\" scene. And if you're a fan of either Burns or Matthau, you'll enjoy it, too.<br /><br />In fact, you'll enjoy the whole movie. <br /><br />Ten stars. Put a little \"Sunshine\" in your life."
        },
        {
            "id": "pos_211",
            "text": "As a study of the frailties of human nature in the context of old age, this film is without parallel. It is, quite simply, brilliant. Full marks to everyone - from the scriptwriter to all involved in the finished product. You can only marvel at the perceptions inherent in the characterisation of the two ageing performers."
        },
        {
            "id": "pos_212",
            "text": "Much like the comedy duo of its title, \"The Sunshine Boys\" has become a forgotten classic 30-odd years later. It's hardly mentioned alongside other great film comedies of the 1970s. This makes no sense given the singular specialness of this film, perhaps the best Neil Simon ever wrote.<br /><br />Walter Matthau plays Willy Clark, once half of a legendary vaudeville comedy known as Lewis and Clark, now a bitter 73-year-old solo act who can't get a job in a potato chip commercial. His nephew and agent Ben (Richard Benjamin) is sure he can get work if Willy will only agree to reunite with his estranged partner Al Lewis (George Burns) for an ABC-TV celebration of show business nostalgia.<br /><br />Nostalgia is what \"Sunshine Boys\" has going for it in spades, right from the start when a series of 1920s film clips showcasing various entertainers from long ago flickers before us to the accompaniment of Cole Porter's \"Be A Clown\". Then there's the film's present-day setting in Manhattan, where flared trousers and wide polyester ties abound. The periods collide in Willy's glorious mess of a Manhattan apartment, where framed photos and cartoons of long-dead celebrities stare out from the walls at lurid tabloid headlines and empty Zabar grocery bags. If you were alive in the 1970s like me, you might even feel like you were in that apartment.<br /><br />Willy clearly has been living there too long. He's sleeping in front of the television when the kettle in the other room boils. Willy wakes up and picks up the phone.<br /><br />\"Hello, who is this?\" A pause. \"Never mind, it's the tea.\"<br /><br />Old men living alone can be sad material in almost anyone else's hands, but Simon's deft wit and unerring feeling for character turns this adaptation of his 1972 stage hit into comedy gold. The amazing thing about \"The Sunshine Boys\" is how much it rubs your noses in Willy's almost existential condition without turning you off at all. \"89 years old and just like that, he dies of nothing'\" Willy says of one old songwriting friend, before deciding the man probably died from writing a song that rhymed \"lady\" with \"baby\".<br /><br />Burns won an Oscar for his understated performance as the gentle but steely Lewis, but it's Matthau who brings this one home, his make-up and proud but ragged bearing really selling you on the idea he was already 73 when he made this. Willy is obnoxious in the extreme, fully deserving Ben's description \"crazy freakin' old man\", but you root for him throughout, enjoying his small victories even when they come at the cost of others' patience. His lines kill you, too, especially when he's trying to kill Lewis, for whom the TV reunion turns out to be a bad idea.<br /><br />\"You're out of touch!\" Willy tells Lewis at one point. \"I'm still in demand. I'm still hot!\"<br /><br />\"If this room was on fire you wouldn't be hot,\" Lewis replies.<br /><br />Director Herbert Ross shoots everything in a very casual and understated way, with low lighting and mid-range shots even in emotional moments so as to leave room for the comedy and the film's overall zen message of grace through quiet acceptance. You never get the feeling you are watching a movie, one of \"The Sunshine Boys\" many charms, and Ross's direction, like the acting of the three principals, goes a long way toward achieving that end.<br /><br />Comedy is hard, especially when the subjects are people watching life pass them by, but \"The Sunshine Boys\" makes it all seem a pleasure, because, for us watching, it is."
        },
        {
            "id": "pos_213",
            "text": "Walter Matthau and George Burns were a famous vaudeville comedy act, Lewis and Clark, who haven't spoken in over 10 years. Burns retired and Matthau took it personally and has held a grudge ever since. Such is the premise of this hilarious Neil Simon play made into a movie. Of course, what makes it so good is Matthau and Burns in their prime, and the material is funnier than anything you can find today. Richard Benjamin shines as Matthau's nephew and agent. There's even old clips of actual stars of the golden era to get you into the groove of the film, and character actor Fritz Feld starts it all off with a \"pop.\" Rosetta LaNoire, who started out in the 30s in theater with Orson Welles and later was Grandma on \"Family Matters,\" is great in a small role.<br /><br />The only problem I had with it (and maybe I'm being too picky and/or serious) is the way Matthau treats Burns when they first meet. Granted, he's had a lot of resentment festering in all these years, but some of the things he does would be considered rude or just plain bad manners taken out of context. Also, I'm used to seeing Matthau act that way in other movies, but not to George Burns. And, Matthau's bellowing tends to get a little old. <br /><br />All in all, if you need a consistently funny film to help and forget your troubles, put in \"The Sunshine Boys.\" They'll lift your spirits and make you think of a simpler time and way of life.<br /><br />Benjamin: \"You have to slide it.\" <br /><br />Matthau: \"Wait, wait. I think you have to slide it.\""
        },
        {
            "id": "pos_214",
            "text": "An old vaudeville team of Willy Clark (Walter Matthau) and Al Lewis (George Burns) were one of the best known but they broke up hating each other. Over 20 years later they agree to get together for a TV special...but find out they STILL hate each other. Willy's nephew/agent (Richard Benjamin) tries to get them to work together.<br /><br />A big hit in its day and it won George Burns an Oscar for Best Supporting Actor. I (somewhat) liked it. It was written by Neil Simon so its non-stop one-liners. Some of it was funny but making jokes of Willy and Al's senility was NOT. Also I never liked Matthau. I never thought he was a good actor and something about him just rubbed me the wrong way. Also his character here is so caustic you get sick of him quickly. All that aside this was fun. Burns is just great tossing off one-liners with ease and even Matthau was good matching him. Their verbal battles are the best sequences in the movie. Also Benjamin is very good as Willy's nephew trying to get the two of them to work with each other. For me it's worth seeing for Burns alone. This jump started his career in a big way and two years later he had ANOTHER hit with \"Oh God\". So, this is good. Just good--not great. Matthau's character really makes this hard to love. I give it a 7."
        },
        {
            "id": "pos_215",
            "text": "The word 'classic' is thrown around too loosely nowadays, but this movie well deserves the appelation. The combination of Neil Simon, Walter Matthau (possibly the world's best living comic actor), and the late lamented George Burns make for a comic masterpiece. It is interesting to contemplate what the movie would have been like had not death prevented Jack Benny from playing George Burns' part, as had been planned. As it is, the reunion scene in Matthau's apartment is not likely to be surpassed as a sidesplitter. Definitely one of my desert island films.<br /><br />\"Enter!!!!!!!!!\""
        },
        {
            "id": "pos_216",
            "text": "question: how do you steal a scene from the expert of expert scene stealers Walther Mathau in full, furious and brilliant Grumpy Old Man mode? answer: quietly, deadpan, and with perfect timing as George Burns does here.<br /><br />I know nothing of Vaudeville but this remains a favourite film, the two leads are hilarious, the script funny, the direction and pacing very fine. Richard Benjamin is very funny as straight man - trying to get at Burns through the window etc. Even the small parts are great.<br /><br />There are so many funny scenes, Mathau messing up the commercial, Burns repeating his answers as if senile...<br /><br />A delight.<br /><br />Enterrrrrr!"
        },
        {
            "id": "pos_217",
            "text": "THE SUNSHINE BOYS was the hilarious 1975 screen adaptation of Neil Simon's play about a retired vaudevillian team, played by Walter Matthau and George Burns, who had a very bitter breakup and have been asked to reunite one more time for a television special or something like that. The problem is that the two still hate each other and want nothing to do with each other. Richard Benjamin appears as Matthau's nephew, a theatrical agent who has been given the monumental responsibility of making this reunion a reality. This warm and winning comedy is a lovely valentine to a forgotten form of entertainment...vaudeville and it works mainly thanks to one of Neil Simon's better screenplays and outstanding work by Matthau, Burns, and Benjamin. Burns won the Best Supporting Actor Oscar for this, but I think Matthau walks away with this film with his flawlessly hilarious performance as Willy Clark. Matthau was nominated for Best Actor but didn't stand a chance against Nicholson for ONE FLEW OVER THE CUCKOO'S NEST; however, in another year, this was an Oscar-worthy performance. Matthau commands the screen and there is not a false note in this beautifully timed performance. The scene where he is auditioning for a potato chip commercial and can't get the name of the product right is a classic. THE SUNSHINE BOYS is a warm and winning Neil Simon comedy which shines thanks to unbeatable chemistry between Matthau and Burns."
        },
        {
            "id": "pos_218",
            "text": "Taking over roles that Jack Albertson and Sam Levene played on Broadway, Walter Matthau and George Burns play a couple of old time vaudeville comics, a team in the tradition of Joe Smith and Charles Dale who seem to have a differing outlook on life.<br /><br />Walter Matthau can't stop working, the man has never learned to relax, take some time and smell the roses. He's a crotchety old cuss whose best days are behind him and his nephew and agent Richard Benjamin is finding less and less work for him. <br /><br />What hurt him badly was that some 15 years earlier his partner George Burns decided to retire and spend some time with his family. A workaholic like Matthau can't comprehend it and take Burns's decision personally.<br /><br />Benjamin hits on a brain storm, reunite the guys and do it on a national television special. What happens here is pretty hilarious.<br /><br />The Sunshine Boys is also a sad, bittersweet story as well about old age. Matthau is on screen for most of the film, but it's Burns who got the kudos in the form of an Oscar at the ripe old age of 79.<br /><br />Burns brought a bit of the personal into this film as well. As we all know he was the straight man of the wonderful comedy team of Burns&Allen who the Monty Python troop borrowed a lot from. In 1958 due to health reasons, Gracie Allen retired and George kept going right up to the age of 100. Or at least pretty close to as an active performer.<br /><br />The Sunshine Boys is based on the team of Smith&Dale however and if you like The Sunshine Boys I strongly recommend you see Two Tickets to Broadway for a look at a pair of guys who were entertaining the American public at the turn of the last century. The doctor sketch that Matthau and Burns do is directly from their material.<br /><br />And I do think you will like The Sunshine Boys."
        },
        {
            "id": "pos_219",
            "text": "Simon's carefully written dialogues are truly electrified by Matthau and Burns. You can literally hear the script crackle. There are few movies out there that can develop such a relationship between the actors and the script. For example, the famed reunion scene could have been a lot duller with less-quality actors involved. Matthau seems to had been born to play Willie Clark (of course, Oscar moreso in the Odd Couple), and with all of the little idiosyncracies and mannerisms that Matthau crams into the character (the line where he is arguing that he is with it since he lives in the city whereas Lewis lives in the country that Lewis is \"out of touch\" is the quintessential example of this) make this one of the best performances I've ever seen of any actor in any role, be it comedic or drama or whatever else. Period. Matthau and Burns work excellently together; the contrast they portray accentuates Simon's superb knack at creating comedic conflict. This movie is simply one of the ultimate \"must-sees\" and does demand a rightful prestigious place in the pages of film history."
        },
        {
            "id": "pos_220",
            "text": "Neil Simon's THE ODD COUPLE set up a model for many of his later plays. Felix Unger and Oscar Madison were the unsuitably paired roommates in the original, the former being picky and neat, the latter being slovenly and loose. Simon would rewrite (less successfully) the play in the 1990s as THE NEW ODD COUPLE, with female roommates. He made it a mixed couple (a woman with her daughter, and a man) in THE GOODBYE GIRLS. He also gave it an additional twist in 1973 with THE SUNSHINE BOYS, a Broadway hit starring Jack Alberson and Sam Levine as Al Lewis and Willie Clark, the aged, semi-retired Vaudevillians. Here the \"apartment\" problem is reduced to a teaming of two men who can't stand each other. The 1976 film starred Walter Matthau as Willie, and George Burns as Al.<br /><br />In actuality, Al probably does not think totally badly of Willie - Willie is pathological on the subject of Al. First Al had little habits, such as accidentally spitting slightly when pronouncing words beginning with the letter \"t\", and slightly jabbing Willie with his index finger, on stage. Secondly, Al retired when his wife died. Willie was not ready to retire (and has been forcing his nephew and agent, Ben (Richard Benjamin) to try to get him jobs in commercials. But Willie can't remember lines unless they are funny, and keeps flubbing them. So he rarely is able to stay to the end of a rehearsal for a commercial.<br /><br />Ben is asked to get the two back together for a live scene of their most famous sketch on a television show about American Comedy. He does bring Al to see Willie, and the sparks begin flying, as neither can figure out what the other is doing (and this is just in rehearsal. On top of that, Willie is insisting on changes (minor ones, but they throw off Al) such as saying \"ENTER!!!\" when Al knocks on the door. The initial rehearsal is a failure, but Ben manages to get them to the taping of the show. The question is if they will complete the scene in the finished program or will Willie wring Al's neck?<br /><br />The three leads, Matthau, Burns, and Benjamin, do very well with the one-liners, frequently reminiscent of vaudeville patter (example: \"Chest pains...I'm getting chest pains Uncle Willie. Every Thursday I come here and get chest pains!\" \"So, come on Fridays!\"). Benjamin strives to prove his deep affection for his uncle, although Matthau's rough outer shell makes it difficult (he only smooths down when he discusses the glory days of vaudeville). Matthau has a little better grasp on reality (at first) than Burns, who seems senile by his repeating himself - but in actuality Matthau's sense of rejection by the world that once applauded him make him less willing to behave properly. Burns is not senile - he takes things slowly. But he seems far happier in accepting his retirement.<br /><br />I call this a final \"Voyage of Discovery\" for our modern Lewis and Clark. Al and Willie transcend their old skits, as they gradually end up realizing that they have more in common in their old age than they thought. Even the irascible Willie admits that Al may be (to him) a pain in the ass, but he was a funny man.<br /><br />Burns was not the original choice for the part of \"Al Lewis\" (supposedly Dale of the team Smith and Dale). Jack Benny was. Benny probably would have done a good job, but ill-health forced him out (he died in 1975). Burns (whose last involvement in any film was in THE SOLID GOLD CADILLAC in 1956 as the narrator) turned in such a fine performance that he got the \"Oscar\" for best supporting actor, and was to have a career in movies in the next decade in such films as OH GOD!; OH GOD, YOU DEVIL; and GOING IN STYLE. He died in 1996 age 100, having proved that he was more than just a brilliant straight man for his wife Gracie Allan."
        },
        {
            "id": "pos_221",
            "text": "I remember originally seeing this film at Radio City Music Hall when it came out. I didn't really understand the humor back then, but this movie can make me laugh out loud.<br /><br />With all due respect to George Burns (RIP), Walter Matthau really deserved the Oscar for this film. His performance is amazing--given the fact that he was 20 years younger than his character, Willie Clark. His mannerisms are first-rate. (\"You know what kind of songs he wrote? Sh*t!\" and when speaking to the Spanish-speaking guy at the front desk: \"No! No! No enchilada!!\") Absolutely hilarious!<br /><br />Kudos to Richard Benjamin, who played straight man to Matthau.<br /><br />I just wish this was on DVD, because my VHS recording is getting a bit old.<br /><br />I had no interest in seeing the remake with Woody Allen, because in no way can it match the original."
        },
        {
            "id": "pos_222",
            "text": "A hilarious Neil Simon comedy that evokes laughs from beginning to end. The late Walter Matthau is the grouchy ex-comedian who is persuaded to join together with his ex-partner (the late Oscar-winner George Burns) for a final reunion show on stage.<br /><br />Benjamin Martin is Matthau's agent and nephew, and the two have just as much chemistry as Matthau and Burns. I love Matthau's grumpy character--he's just the same as he always is, and yet also very different.<br /><br />Burns, as the absent-minded old man, is just as funny as Matthau.<br /><br />Matthau: Want some crackers? I've got coconut, pineapple and graham.<br /><br />Burns: How about a plain cracker?<br /><br />Matthau: I don't got plain. I got coconut, pineapple and graham.<br /><br />Burns: Okay<br /><br />Matthau: They're in the cupboard in the kitchen.<br /><br />Burns: Maybe later.<br /><br />Or how about this:<br /><br />Matthau: When I did black, the whites knew what I was saying!<br /><br />You've got to see it in the movie to understand it!<br /><br />All in all, a refreshingly hilarious, sweet, heartfelt, warm, belivable character comedy with a heart and some of the most memorable quotes of all time. <br /><br />They just don't make them like this anymore! In a time when all the newest comedies are crude, juvenile and stupid, this leans back towards the tender core of what comedy really is--funny characters, smart and funny dialogue, and grand entertainment.<br /><br />One of the best buddy comedies of all time, right up there with \"Planes, Trains and Automobiles,\" \"Lethal Weapon,\" and \"The Hard Way.\"<br /><br />You may have a hard time finding this for rent or on TV, but trust me, it will be worth your time!<br /><br />4.5/5 stars.<br /><br />- John Ulmer"
        },
        {
            "id": "pos_223",
            "text": "in one of Neil Simon's best plays. Creaky, cranky ex-Vaudeville stars played by Walter Matthau and George Burns are teaming up for a TV comedy special. The problem is they haven't even SEEN each other in over a decade. Full of zippy one liners and inside showbiz jokes, this story flies along with a steady stream of humor. Good work also by Richard Benjamin as the harried nephew, Rosetta LeNoire as the nurse, and Howard Hesseman as the TV commercial director. Steve Allen and Phyllis Diller appear as themselves. Trivia note: The opening montage contains footage from Hollywood Revue of 1929 and shows Marie Dressler, Bessie Love, Polly Moran, Cliff Edwards, Charles King, Gus Edwards, and the singing Brox Sisters."
        },
        {
            "id": "pos_224",
            "text": "The Sunshine Boys is one of my favorite feel good movies. I first saw it when it as the Christmas attraction at Radio City Music Hall when it first came out and loved it ever since. I ended up seeing it 6 times in the theaters, and if it was playing today I'd go out to see it again.<br /><br />Now a lot of the reviews here mentioned the wonderful performances of the leads. Matthau was brilliant, but had the misfortune of being nominated against Jack Nicholson's Oscar winning performance of Randall P. MacMurphy in \"One Flew Over the Cuckoo's nest. Burns did win, though Richard Benjiman deserved at least to be nominated as well. Even the smallest roles were played to perfection, like Fritz Feld auditioning for the potato chips commercial. <br /><br />Which brings me to my reason for reviewing this film, the direction of the greatly underrated Herbert Ross. Ross who previously brought a two person play, \"The Owl And The Pussycat\" to the screen and made a full movie out of it, does it again. He opens the plays out without making them look like a photographic stage play. He fleashens out the story and the characters.<br /><br />Here we're 20 minutes into the film before we get to the scene that opens the play, where Ben Clark comes to see his uncle and tell him about the comedy special. Though there are dialogue from the play during the first twenty minutes, the sequence itself is totally new. A few years ago I did see at the broadway revival of the play with Jack Klugman and Tony Randall, which was wonderful. But I think that Ross and screenwriter, playwright Simon improved on it. It's just a wonderful film."
        },
        {
            "id": "pos_225",
            "text": "This film reminds me of 42nd Street starring Bebe Daniels and Ruby Keeler. When I watch this film a lot of it reminded me of 42nd Street, especially the character Eloise who's a temperamental star and she ends up falling and breaks her ankle, like Bebe Daniels did in 42nd Street and another performer gets the part and become a star. This film, like most race films, keeps people watching because of the great entertainment. Race films always showed Black Entertainment as it truly was that was popular in that time era. The Dancing Styles, The Music, Dressing Styles, You'll Love It. This movie could of been big if it was made in Hollywood, it would of had better scenery, better filming, and more money which would make any movie better. But its worth watching because it is good and Micheaux does good with the little he has. I have to say out of all Micheaux's films, Swing is the best! The movie features singers, dancers, actresses, and actors who were popular but forgotten today. Doli Armena, a awesome female trumpet player who can blow the horn so good that you think Gabriel is blowing a horn in the sky. The sexy, hot female dancer Consuela Harris would put Ann Miller and Gyspy Rose Lee to shame.<br /><br />Adding further info... Popular blues singer of the 20's and 30's Cora Green is the focus of the film, she's Mandy, a good, hard working woman with a no good man who takes her money and spend it on other women. A nosy neighbor played by Amanda Randolph tells Mandy what she seen and heard and Mandy goes down to the club and catches her man with an attractive, curvy woman by the name of Eloise (played Hazel Diaz, a Hot-Cha entertainer in the 30's) and a fight breaks out. Then Mandy goes to Harlem where she reunites with a somewhat guardian angel Lena played by one of the most beautiful women in movies Dorothy Van Engle. Lena provides Mandy with a home, a job, and helps her become a star when temperamental Cora Smith (played by Hazel, I guess she's playing two parts or maybe she changed her stage name) tries to ruin the show with her bad behavior. When Cora gets drunk and breaks her leg, Lena convinces everyone that Mandy is right for the job and Lena is right and a star is born in Mandy. Tall, long, lanky, but handsome Carman Newsome is the cool aspiring producer who Lena looks out for as well. Pretty boy Larry Seymour plays the no good man but after Lena threatens him, he might shape up. There are a few highlights but the one that sticks out to me is the part where Cora Smith (Hazel Diaz) struts in late for rehearsal and goes off on everyone and then her man comes in and punches her in the jaw but that's not enough, she almost gets into a fight with Mandy again. In between there's great entertainment by chorus girls, tap dancers, shake dancers, swing music, and blues singing. There's even white people watching the entertainment, I wonder where Micheaux found them, there's even a scene where there's blacks and whites sitting together at the club, Micheaux frequently integrated blacks and whites in his films, he should be commended for such a bold move.<br /><br />This movie was the first race film I really enjoyed and it helped introduced me to Oscar Micheaux. This movie is one of the best of the race film genre, its a behind the scenes story about the ups and downs of show business.<br /><br />No these early race films may not be the best, can't be compared with Hallelujah, Green Pastures, Stormy Weather, Cabin In The Sky, Carmen Jones, or any other Hollywood films but their great to watch because their early signs of black film-making and plus these films provide a glimpse into black life and black entertainment through a black person's eyes. These films gave blacks a chance to play people from all walks of life, be beautiful, classy, and elegant, and not just be stereotypes or how whites felt blacks should be portrayed like in Hollywood. Most of the actors and actresses of these race films weren't the best, but they were the only ones that could be afforded at the time, Micheaux and Spencer Williams couldn't afford Nina Mae McKinney, Josephine Baker, Ethel Waters, Fredi Washington, Paul Robeson, Rex Ingram, and more of the bigger stars, so Micheaux and other black and white race film-makers would use nightclub performers in their movies, some were good, some weren't great actors and actresses, but I think Micheaux and others knew most weren't good actors and actresses but they were used more as apart of an experiment than for true talent, they just wanted their stories told, and in return many black performers got to perform their true talents in the films. For some true actors/actresses race films were the only type of films they could get work, especially if they didn't want to play Hollywood stereotypes, so I think you'll be able to spot the true actors/actresses from the nightclub performers. These race films are very historic, they could have been lost forever, many are lost, maybe race films aren't the greatest example of cinema but even Hollywood films didn't start out great in the beginning. I think if the race film genre continued, it would have better. If your looking for great acting, most race films aren't the ones, but if your looking for a real example of black entertainment and how blacks should have been portrayed in films, than watch race films. There are some entertaining race films with a good acting cast, Moon Over Harlem, Body and Soul, Paradise In Harlem, Keep Punching, Sunday Sinners, Dark Manhattan, Broken Strings, Boy! What A Girl, Mystery In Swing, Miracle In Harlem, and Sepia Cinderella, that not only has good entertainment but good acting."
        },
        {
            "id": "pos_226",
            "text": "<br /><br />One of the best films I've ever seen. Robert Duvall's performance was excellent and outstanding. He did a wonderful job of making a character really come to life. His character was so convincing, it made me almost think I were in the theater watching it live, I give it 5 stars."
        },
        {
            "id": "pos_227",
            "text": "Robert Duvall is a direct descendent of Confederate General Robert E. Lee, according the IMDb.com movie database. After seeing this film, you may think Duvall's appearance is reincarnation at it's best. One of my most favorite films. I wish the composer, Peter Rodgers Melnick had a CD or there was a soundtrack available. Wonderful scenery and music and \"all too-true-to-life,\" especially for those of us that live in, or have moved to, the South. This is a \"real moment in time.\" Life moves on, slowly, but \"strangers we do not remain.\""
        },
        {
            "id": "pos_228",
            "text": "\"Convicts\" is very much a third act sort of film. All the dialogue and character interaction that occurs within it comes out of the long wind-down of a late southern day. And, by extension, the life of its main character, Soll (Robert Duvall).<br /><br />This is the first collaboration of director Peter Masterson and writer Horton Foote. Six years earlier, the worked together on \"The Trip to Bountiful\", a film that seems almost action-packed in comparison to this one. Masterson is not necessarily a good director. In fact, he's just barely this side of adequate. The slow pace leaves a lot of room for cinematographer Toyomichi Kurita, who infuses the film with just the right sense of fragile light & warmth.<br /><br />Because this is essentially a filmed play, with little in the way of editing or directing prowess, it all comes to the acting. As far as I'm concerned there's no flaws here. Robert Duvall and James Earl Jones, two of the best American actors (both born in January 1931), create characters that are wholly real, uninterested in anything besides living. Lukas Haas, a young actor who I was familiar with from \"Testament\" and \"Witness\", plays a character very much like his other early roles. He is quiet, withdrawn, slightly scared and sad, somehow. These are qualities that seem natural from him.<br /><br />Perhaps a title like \"Convicts\" is a disservice to this film. That title, along with the opening scene, seem to create an image of a far more high-strung western type picture. If slow-paced stage productions don't interest you terribly, you'll want to pass on this one as well. Otherwise, this might be exactly the film you wish they made more often.<br /><br />Enjoy."
        },
        {
            "id": "pos_229",
            "text": "In today's world of digital fabrication, there is no computer than can replace the actor and writer. Alas, this type of \"character driven\" film is far too rare these days. Duvall's performance as well as James Earl Jones are faithful to their audience's high expectations. I wonder if this movie was made for TV? It has a \"close-up\" personal quality to the narrative. It is an understatement to say that the performances are all Outstanding. The only thing that keeps it from being a cinema Masterpiece is the lack of a great Cinematographer, but pretty pictures are not everything. How can talent the likes of Jones and Duvall continue to produce such fine work in an age where actors pose for the digitizing?"
        },
        {
            "id": "pos_230",
            "text": "When I first saw this film on cable, it instantly became one of my favorite movies. I'm a big fan of James Earl Jones and Robert Duvall. The movie paints an accurate picture of the South and the racist attitudes. Most of the attitudes came from Soll, an old plantation owner who uses convicts for labor. Soll is what makes the move, his funny ramblings give us insights in to the way The South was back then. I suppose that if Soll lived today he would be diagnosed with Alzheimer's Disease. None the less his attitudes towards a little boy who comes to work for him and the convicts is complex. While he has racist views, he's grown to trust some of the convicts who are all black. The two convicts he trusts most are Jackson(Mel Winkler) and Ben(James Earl Jones). The conversations between Ben and Soll are the best in the movie, they have real chemistry. James Earl Jones and Mel Winkler both but in great performances as well as Hass.<br /><br />This movie should have gotten more notoriety. However it's on DVD and worth the money.<br /><br />Rayvyn"
        },
        {
            "id": "pos_231",
            "text": "This is a very enjoyable film with excellent actors and actresses evoking a range of emotions. It contains some really excellent humour which the whole family can enjoy. You get to know the characters quickly and experience their ups and downs. And, it ends very upbeat"
        },
        {
            "id": "pos_232",
            "text": "What a delightful movie. The characters were not only lively but alive, mirroring real every day life and strife within a family. Each character brought a unique personality to the story that the audience could easily associate with someone they know within their own family or circle of close friends.<br /><br />The story has a true-to-life flow that the viewer can assimilate into and be part of the drama, the laughter and tears as the plot of the movie develops. The script does a good job of capturing the common emotions, actions and reactions of the characters to conflict, opinion, and resolve.<br /><br />Not an epic, but it is a very nice movie to watch with loved ones. Plenty of knowing head nods and 'ahhh' moments to share and enjoy."
        },
        {
            "id": "pos_233",
            "text": "I actually found this movie 'interesting'; finally one worth my time to watch and rent. It is true... some scenes were over the top on emotionalism, shouting, etc., but what movie doesn't stress its agenda, genre or 'ax to grind'? Almost None! What surprised me is that I read a review elsewhere done by a S.Fran reviewer on another review site, but found his negative review instead a more accurate description of his \"own\" review of the movie; not of the movie at all. Anyone that watches this movie will realize that it is great to recommend to family and friends; no car chases, Yea!! Being \"in\" an Italian family myself, I can fully relate to the environment portrayed on the screen. The movie has its tear jerking parts as well. It is what real life can be in such an environment. Nice movie."
        },
        {
            "id": "pos_234",
            "text": "I've always knew Anne DeSalvo was a great character actor, now I know she is a great writer/director also. I have been a fan since I first saw her in the movies \"Perfect\", \"My Favorite Year\", \"DC Cab\" and \"Stardust Memories\".<br /><br />It's so rare to see Lee Grant these days in anything. She has been missing from the screen for far too long. It's also wonderful to see Cloris Leachman in something other than a sit-com. This is her best work since \"the Last Picture Show\". If you grew up in an Italian American family you will love this movie. I wasn't expecting a lot when I started watching this movie, so I was pleasantly surprised when I fell in love with this movie. If you get the chance, watch it."
        },
        {
            "id": "pos_235",
            "text": "A wonderful movie! Anyone growing up in an Italian family will definitely see themselves in these characters. A good family movie with sadness, humor, and very good acting from all. You will enjoy this movie!! We need more like it."
        },
        {
            "id": "pos_236",
            "text": "It is a rare occasion when I want to see a movie again. \"The Amati Girls\" is such a movie. In old time movie theaters I would have stayed put for more showings. Was this story autobiographical for the writer/director? It has the aura of reality.<br /><br />The all star cast present their characters believably and with tenderness. Who would not want Mercedes Ruehl as an older sister? I have loved her work since \"For Roseanna\".<br /><br />With most movies, one suspends belief because we know that it is the work of actors, producers, directors, sound technicians, etc. It was hard to suspend such belief in \"The Amati Girls\". One feels such a part of this family! How I wanted to come to the defense of Dolores when her family is stifling her emotional life. And wanted to cheer Lee Grant as she levels criticism at Cloris Leachman's hair color. The humor throughout is not belly laugh humor, but instead has a feel-good quality that satisfies far more than pratfalls and such.<br /><br />The love that is portrayed in this cinema family is to be emulated and cherished.<br /><br />It is no coincidence that the family name, Amati, translated from the Italian means 'the loved ones'."
        },
        {
            "id": "pos_237",
            "text": "Growing up in a multi racial neighborhood back in the 20's and 30's, I grew up very close to most of the Italian families living there. This move brought back so many pleasant memories. this is a movie most people would like who enjoy seeing more true to life movies."
        },
        {
            "id": "pos_238",
            "text": "Can Scarcely Imagine a Better Movie Than This<br /><br />Hey, before you all go \"Chick Flick\" on me. I am a very Large Strong & Masculine, Macho Man, who happens to think this was one of the better movies of the last 20 years. <br /><br />The acting was Superb and the Story was Marvelous. This is wonderful medicine for the heart and soul. The Acting could not have been better nor the movie better cast. <br /><br />I have known for a Good while that Mercedes Ruehl, along with Holly Hunter, Joan Plowright, Dame Edith Evans, Sissy Spacek, Judi Dench is among the greatest actresses ever to appear on film. And of course Cloris Leachman (also in this film) in my view may in fact exceed them all in the shear magnum of her talent and varied roles she has appeared in over the years.. At any rate this was an Amazing cast. This film was like a book that you cannot lay down, and when you have reached the last page wish for more...still more. I cannot for the life of me understand why this film here on the IMDb only rates a 3.9<br /><br />That rating here is utterly Amazing to me. Or perhaps not. Perhaps in fact I do understand it ever so well and that is what makes me really sad. It makes me ever so sad that films like \"American Beauty\" \"Leaving Las Vegas\" \"Sexy Beast\" and \"Fight Club\" ratings skyrocket off the charts in popularity when they in fact at least in this viewers opinion should have received an \"R\" rating...R that is for \"Rubbish\". Hey o.k., I realize there are a lot of different stories in this world for a lot of different audiences, but it is a sad commentary when this lovely, powerful...extraordinarily, Directed, Acted, and written film seems to be over looked. <br /><br />It obviously was at the Academy Awards as well....How Sad. And How predictable. My summation is that if you want to see a powerful, Happy, Sad, beautiful story? watch ......preferably own this film..."
        },
        {
            "id": "pos_239",
            "text": "I watched this on the movies with my girlfriend at the time and I can say that I didn't have the best time mainly because I didn't know about Ned Kelly or his story.<br /><br />But since this is a biopic, it's important to at least know what to expect from the character.<br /><br />I don't know if the manner the events are told are true, or if it everything is fictional. But the way Ned Kelly is portrayed as a hero and a fighter for justice really makes me want to believe everything is true. I don't think he's portrayed as a redneck criminal or thief, but that's just my opinion.<br /><br />This is a solid Western-type movie for everybody's tastes. Heath Ledger is great as always and the sexy Naomi Watts charms the screen.<br /><br />Give this movie a chance if it airs on cable. Otherwise, I don't think I could recommend it."
        },
        {
            "id": "pos_240",
            "text": "Fantastic movie. One to excite all 5 senses. Is not a true historical report and not all information is to be taken as factual information. True Hollywood conventions used, like playing A list and VERY attractive actors as the 'heroes', such as Naomi Watts (Julia Cook - Ned Kelly's lover), Heath Ledger (Ned) and Orlando Bloom (Joe Byrne - Ned's right hand man), and unattractive (sorry Geoffrey Rush) actors play the drunken and corrupt Victorian Police Force. This also instills a very unreliable love story into the mix between Ned (Ledger) and Julia Cook (Watts) to entice all the romantics, females being especially susceptible. Even from the first scene, when Ned saves the fat youth from drowning and his dad calls him \"sunshine\" and had a \"glint in his eye as he looked down at me, his hand on me shoulder,\" it is very romanticized and persuades viewers to side with Ned Kelly, the underdog. Besides, don't all Aussies love an underdog?"
        },
        {
            "id": "pos_241",
            "text": "I'm tired of people judging films on their \"historical accuracy\". IT'S A MOVIE PEOPLE!! The writers and directors are supposed to put their own spin into the story! There are a number of movies out there that aren't entirely accurate with the history....Braveheart, Wyatt Earp, Gangs of New York, Geronimo: An American Legend, The Last of the Mohicans....all fantastic films that are mildly inaccurate historically. If you want to see a few great actors do what they do best, then I suggest you see this film and don't worry about the accuracy of the facts. Just enjoy the quality of the film, the storyline and one of the greatest actors of our time."
        },
        {
            "id": "pos_242",
            "text": "I thought that this film was very well made, Heath Leger was very convincing and his Irish accent was flawless. Orlando Bloom and Naomi Watts were also really good and believable. How true it is to what really happened I have no idea, but it did portray why people sometimes become what they do. Maybe those in authority have always been corrupt and I did find it interesting that over 30,000 signed a petition for Ned Kelly NOT to be hanged, so maybe there was more truth in this film than at first thought? In many ways it reminded me of Cold Mountain which was another good historical film. All in all I would highly recommend this film and I am somewhat baffled why it didn't do better in the cinemas."
        },
        {
            "id": "pos_243",
            "text": "Definitely one of my favourite movies. The story is good, acting is great, all technicals (especially cinematography) are sharp and the script is clever.<br /><br />Heath Ledger is terrific as Edward ''Ned'' Kelly. He is gripping as the legendary outlaw, and is supported well by Geoffrey Rush, Naomi Watts and Orlando Bloom. All action sequences are on point<br /><br />The film is edge-of-your seat stuff right up to to the end. One of my favourite films from the late legend Heath Ledger, who has been the highlight of every film he has starred in. And makes no mistake here.<br /><br />An excellent film all round."
        },
        {
            "id": "pos_244",
            "text": "I didn't know what to expect from 'Ned Kelly', but absolutely loved it. It was dark, dramatic and gripping. It also felt very authentic, I felt that I had been transported back to the 1800's. I've never been much of a Heath Ledger fan, having only seen him in teen type movies, however he is quite compelling in this role. Ledger plays Ned Kelly with dignity and intensity, showing us how an highly spirited boy became Australia's most notorious killer. Naomi Watts is great in a supporting role as Kelly's society lover. Highly recommended - and that's from an Aussie!"
        },
        {
            "id": "pos_245",
            "text": "The only reason I wanted to see this was because of Orlando Bloom. Simply put, the movie was spectacularly average. It's not bad, but it's really not very good. The editing is good; the film is well-paced. The direction is competent and assured. The story is plodding. The film is averagely acted by Ledger, Bloom, and the normally great Watts and Rush. The accents are impenetrable if you're from the US so just sit back and enjoy the scenery (or as I like to call it, Orlando Bloom). By the end of the film, I was neither bored nor moved. Some people have asked what happened to Ned Kelly at the end of the movie. I have to say, I so did not care by that point.<br /><br />Really, the only reason I can recommend this is that Orlando Bloom kind of, sort of shows some hints of range (although the oft-present \"I'm pretty and confused\" look is prominent), so fangirls may find it worth the matinee price. Other than that, just don't see it. It's neither good enough nor bad enough to be entertaining."
        },
        {
            "id": "pos_246",
            "text": "How could I possibly pass up the chance to see Orlando Bloom and Heath Ledger together? Well, I couldn't and so, I rented this mess of a movie.<br /><br />I had never heard of Ned Kelly and was surprised by what I found out about this young man's legend. I was also surprised at how mediocre this movie was. Perhaps the fact that it was very, very late and at the end of a 4 hour movie marathon or maybe it was because it really is a little slow, I found this story difficult to follow. Not because the story is complicated, but because it is slow. Even with a slow story, Ledger and Bloom managed to create interesting, dimensional characters. <br /><br />Though I flounder to recommend this as a must see, it is a great story of Australian history (considering how young the country is, this is very rare and should be appreciated) and the film does have some good actions sequences. <br /><br />6/10 see it for historical value....(yeah right...and that's the only reason to see it... ;) )"
        },
        {
            "id": "pos_247",
            "text": "I loves this movie,because it showed that they were not killing for fun but to save the ones they loved! Heath Ledger and Orlando Bloom did a great job portraying Ned and Joe. It has a few quick inappropriate scenes but is all right other than that. The language is very mild and sometimes don't even know it is there. This movie shows that just because they are outlaws does not mean that they are vicious killers! I hope that people will watch this movie and learn about important times in history like this one. There is one thing that fascinates me about this movie is that they got their inspiration for their armor from a book Ned looked at! Also that that is how people remember them,from their armor. I hope that people will watch this movie and get interested as I have."
        },
        {
            "id": "pos_248",
            "text": "'Ned Kelly' is a wonderfully made Australian film honouring a true Australian hero. We are taken into the world of Ned, his best friend, Joe Byrne, and the other members of the Kelly Gang, as the film explains and perhaps justifies Ned's actions.<br /><br />There is an exceptional cast present, who all give stellar performances, which brings the film to life. (Great job, Heath!) Orlando Bloom was fantastic as Joe, playing the role of quiet, loyal ladiesman very well. I was swept up in the moment. For a moment I almost believed the Gang would win the battle at Glenrowan, alas, it was not to be.<br /><br />Some aspects of the film are fictional, and as an avid Ned Kelly fan (and supporter), was slightly disappointed by this. Perhaps also the film could've gone longer, to cover more of the Kelly Gang's/Ned's life - I felt not enough was covered.<br /><br />Regardless of a few flaws, this is a moving film, which stirs all sorts of emotions. (And hey, I'd assume this film would be better to watch rather than Mick Jagger trying to portray Ned...)"
        },
        {
            "id": "pos_249",
            "text": "I have seen the trailer for this movie several times over, and I have to say that Ned Kelly looks like it is going to be a wonderful film. When I saw the trailer for the first time, I could not take my eyes away from it (it got my attention for sure). Heath Ledger sticks to what he knows and what works for him, period pieces. Not to mention Orlando Bloom ,who is seen for a split second looks fantastic. I think that this movie will be a hit, and will be seen over and over again my many people."
        },
        {
            "id": "pos_250",
            "text": "Those who know who know the Kelly \"legend\" & are hoping that this film would be an accurate depiction of his life may be disappointed with the creative license taken with this film (eg. Naomi Watt's character never existed in reality), but if you look at it purely as a piece of entertainment, it holds up pretty well. Ledgers performance in the title role is quite solid, taking the mantle of cinema's best Ned (not hard considering the previous Ned's include Yahoo Serious, Mick Jagger & former Carlton champion (Australian Rules Football) Bob Chitty, a great footballer but a poor actor. Some location shooting film in the area I live, Bacchus Marsh outside Melbourne as well as Clunes & Ballarat."
        },
        {
            "id": "pos_251",
            "text": "'Had Ned Kelly been born later he probably would have won a Victoria Cross at Gallipolli'. such was Ned's Bravery.<br /><br />In Australia and especially country Victoria the name Ned Kelly can be said and immediately recognised. In Greta he is still a Hero, the life Blood of the Town of Jerilderie depends on the tourism he created, but in Mansfield they still haven't forgotten that the three policeman that he 'murdered' were from there.<br /><br />Many of the buildings he visited in his life are still standing. From the Old Melbourne Gaol where he was hanged, to the Post office he held up in Jerilderie. A cell he was once held in in Greta is on display in Benella and the site of Ann Jones' Hotel, the station and even the logs where he was captured in Glenrowan can be visited.<br /><br />Evidence of all the events in the movie (except for his love interest) can be found all over Victoria, in police records and even in the Sash that Ned was awarded with for rescuing Dick Shelton from drowning. None of this is wrong, and whats left out would further justify Neds actions. The Horse that Ned 'stole' was actually stolen by Wild Wright (the man who Ned boxes with after getting out of jail). Ned was already in prison when the horse was reported stolen so he couldn't have stolen it.<br /><br />The Jerilderie Letter is more than what has been stated before. It is not self justification it is Ned's biography, an outline of what he stood for and who he was protecting. So go ahead and read it, watch the movie and then make up your mind about what Ned stood for."
        },
        {
            "id": "pos_252",
            "text": "The performances were superb, the costumes delivered a unique feeling for the period and being a Victorian Living Historian, I was impressed with the accuracy of weaponry and attention to detail.<br /><br />I wouldn't say you need any knowledge of the Kelly saga to stay with the flow of this movie but to comprehend the happenings and attitudes of the time you will require a bit of basic historical knowledge. Do not expect, as some rather silly people do, any of the characters to have the Auzzie accent as we know it, it was, at that time, a country during infancy.<br /><br />OK, the story had some elements of fiction but these are required for a wider following of the film. Gregor Jordan said in the extra feature on the DVD that he wanted his movie to 'inspire an interest', and that is exactly what happened with me so this movie gets the thumbs up here.<br /><br />See it and you WILL NOT be sorry"
        },
        {
            "id": "pos_253",
            "text": "The story of Ned Kelly has been enshrouded in myth and exaggeration for time out of hand, and this film is no exception. What ensures Ned Kelly has a permanent place in history is the effort he went to in order to even the odds against the policemen hunting him. During several battles, he marched out wearing plates of beaten iron, off which the bullets available to police at the time would harmlessly bounce. Indeed, it is only because there were a few bright sparks among the Victorian police who noticed he hadn't plated up his legs that he was captured and hanged. The story has been told in schools and histories of Australia for so long that some permutations of the story have, ironically, become boring. The more the stories try to portray Kelly as some inhuman or superhuman monster, the less people pay attention.<br /><br />Which is where this adaptation of Our Sunshine, a novel about the Kelly legend, excels. Rather than attempting to portray a Ned Kelly who is as unfeeling as the armour he wore, the film quickly establishes him as a human being. Indeed, the reversal of the popular legend, showing the corruption of the Victorian police and the untenable situation of the colonists, goes a long way to make this film stand out from the crowd. Here, Ned Kelly is simply a human being living in a time and place where in order to be convicted of murder, one simply had to be the nearest person to the corpse when a policeman found it. No, I am not making that up. About the only area where the film errs is by exaggerating the Irish versus English mentality of the battles. While the Kelly gang were distinctly Irish, Australia has long been a place where peoples of wildly varied ethnicities have mixed together almost seamlessly (a scene with some Chinese migrants highlights this).<br /><br />Heath Ledger does an amazing job of impersonating Australia's most notorious outlaw. It is only because of the fame he has found in other films that the audience is aware they are watching Ledger and not Kelly himself. Orlando Bloom has finally found a role in which he doesn't look completely lost without his bow, and Geoffrey Rush's appearance as the leader of the police contingent at Glenrowan goes to show why he is one of the most revered actors in that desolate little island state. But it is Naomi Watts, appearing as Julia Cook, who gets a bit of a bum deal in this film. Although the film basically implies that Cook was essentially the woman in Ned Kelly's life, but you would not know that from the minimal screen time that she gets here. Indeed, a lot of the film's hundred and ten minutes feels more freeze-dried than explorative. Once the element of police corruption is established, in fact, the film rockets along so fast at times that it almost feels rushed.<br /><br />Unfortunately, most of the film's strengths are not capitalised upon. Rush barely gets more screen time than his name does in the opening and closing credits. Ditto for Watts, and the rest of the cast come off a little like mannequins. I can only conclude that another fifteen, or even thirty, minutes of footage might have fixed this. But that leads to the other problem, in that the lack of any depth or background to characters other than the titular hero leaves the events of the story with zero impact. One scene manages to do the speech-making thing well, but unfortunately, it all becomes a collage of moments with no linking after a while. If one were to believe the impression that this film creates, a matter of weeks, even days, passes between the time that Ned Kelly becomes a wanted man on the say-so of one corrupt policeman, and the infamous shootout at Glenrowan. Annoyingly, the trial and execution of Ned Kelly is not even depicted here, simply referred to in subtitles before the credits roll.<br /><br />That said, aside from some shaky camera-work at times, Ned Kelly manages to depict some exciting shootouts, and it has a good beginning. For that reason, I rated it a seven out of ten. Other critics have not been so kind, so if you're not impressed by shootouts with unusual elements (and what could more more unusual than full body armour in a colonial shootout?), then you might be better off looking elsewhere. Especially if you want a more factual account of Ned Kelly's life."
        },
        {
            "id": "pos_254",
            "text": "I'm sure that not many people outside of Australia have ever heard of the legend of Ned Kelly. I once saw a documentary about the man, but that's the only time I once saw or heard anything about him. And I guess that this might be the biggest problem this movie will have to face. No-one knows anything about it and probably not many people will care about the subject.<br /><br />The movie tells the story of Ned Kelly's life. The Irish immigrant has lived in north-west Victoria all his life, but has never been very welcome by the authorities. The police always accuses him of everything they can think of and they keep harassing his family. When Kelly is fed up with the way everything goes, he forms a gang with his brother and two other men. They start robbing banks and even hijack an entire town for 3 days. All this violence leads to a man hunt organized by the police and when they kill three policemen, they are outlawed. Finally they take over a pub in Glenrowan, where they have a party with all the visitors, waiting for a train full of police to derail at a part of the track that they tore up. But the train is able to stop in time because someone warns them and what will follow is a battle on life and death between the police and the four gunmen...<br /><br />It's very hard to tell whether all of what is shown in the movie is true or false. I guess nobody really knows, because there will always be two camps who will each tell their own truth: one camp says he was a hero, some kind of Robin Hood, the others will say he was an ordinary criminal, a murderer and a thief. I really couldn't tell you which of them is right, perhaps both are, but what I can tell you is that the facts in the movie as well as is the documentary were about the same.<br /><br />This movie was a nice addition to the documentary I once saw and I really enjoyed the performances of all the actors. Heath Ledger, Orlando Bloom, Naomi Watts, Geoffrey Rush are all actors who are pretty well known, but even the lesser known actors show in this production that they all know what good acting should look like. I really enjoyed this movie and I give it a 7.5/10"
        },
        {
            "id": "pos_255",
            "text": "There are few films that leave me with the feeling that Gregor Jordan's 'Ned Kelly' film did. Initially I had heard only half hearted recommendations, and decided to see it for myself. Since then, I have acquired both the video and soundtrack, and have to say that after several viewings, I am still very impressed with the underlying character of this film. It is also wonderful to see something Australian! I appreciate its down to earth quality, that if you ask me is a rarity, as well as the absence of tackiness that takes away from so many films. This film proves that you don't necessarily require fancy costumes and a glamorous set that absorbs how many millions of dollars to make a point. The cast was a bonus, including a variety of well known, and might I add, good looking people who did well to slip into the role of such unique characters. It is interesting to note, that much of the criticism regarding this film has been about who played what, and how they only said so many lines. However, if any criticism is due, it should constructively focus on the fact that a number of basic elements of the original events were excluded. In reality, these functioned to made it the hallmark that it is in Australian history. For example, on a closer examination it can be discovered that there was much, much more to the relationship between Joe Byrne and Aaron Sheritt, and that this was in fact responsible for many more of the final outcomes for the gang than were explored in the film. Also overlooked was the fact that it was not only Aaron Sheritt's efforts alone, that provided the Victorian police with their insights into the unfolding mystery. Yes, this is their interpretation of the story, and it is understandable that true stories require sensationalism and at times the modification of the original plot to grab the viewers attention. I feel that in this case, this is the only limitation. However, I can accept that perhaps historical accuracy is only of significance to those who have a particular interest in the realistic events behind a situation. It certainly inspired me to look more closely. So, watch it and decide for yourself. You might not like it at all, thats your opinion, and thats fine. Maybe it is a film that appeals largely to an Australian audience? For me, I'd call it a breath of fresh air!"
        },
        {
            "id": "pos_256",
            "text": "Due to reading bad reviews and being told by friends that they couldn't believe how bad it was, I didn't go and see this film at the cinema. After watching it on DVD, I have to say I regret that now. I'm not saying it is brilliant, but I would venture to say that it is a good movie. I enjoyed it.<br /><br />People have skulls thicker than Ned's helmet if they go to see a movie like this and expect it to be a documentary. If you read up the actual history behind most movies based on historical figures, there is usually a huge difference between the fact and the fictional portrayal. I don't think Ganghis Kahn has ever once been portrayed even remotely close to historical fact. What kind of man Ned Kelly actually was is a matter of debate, and quite passionate it seems. In spite of the efforts of governments and some historians, Ned Kelly has become a legend. Legends are stories, and stories say as much about those who tell and listen to them as they do about the actual figure himself. Ned Kelly has become such a popular identity because he does represent that aspect of Australian culture that doesn't trust or accept authority. A society in which there is no dissent or challenge to authority is crazier and more dangerous than any bushranger.<br /><br />So not expecting this to be an accurate recreation of the historical Kelly gang, I actually found it a surprisingly unencumbered and refreshing movie. It was sentimental and romantic, but thankfully not anywhere as cheesy as it could have been; for my fellow Australians, watch 'The Lighthorseman' and you will see what I mean (it is a pity the way that story was treated so poorly). Perhaps the love affair business could have been forsaken for a bit more detail in other areas, such as the shooting of the troopers. Ironically, I actually enjoyed the movie because of that, because it would be those details that most of the focus on Ned's story would dwell. And they are the details of the story that are best discovered by reading the different viewpoints given by the various historians.<br /><br />This movie was always going to have a hard time, having make a compromise of appealing to a global movie market (to pay the pills) and the legend as it means to Australians; perhaps a little of Ned's spirit is in this movie, because I think it rebelled against people's expectations, and unfortunately missed both targets. Fortunately it made for an enjoyable quirk of a film. For me it was an unexpected kind of movie about Ned, and that is why I liked it. Orlando Bloom's performance did a lot for the movie too - he really added something. I think he would have enjoyed being the monster instead of the pretty elf, for a change.<br /><br />When you consider some other movies that are far worse than this one, your opinion of this movie should be reconsidered. Send me this on DVD for christmas rather than Croc Dundee or The Man From Snowy River anytime."
        },
        {
            "id": "pos_257",
            "text": "***SPOILERS*** All too, in real life as well as in the movies, familiar story that happens to many young men who are put in a war zone with a gun, or rifle, in their hands. The case of young and innocent, in never handling or firing a gun, Jimmy Davis, Franchot Tone, has been repeated thousands of times over the centuries when men, like Jimmy Davis, are forced to take up arms for their country.<br /><br />Jimmy who at first wanted to be kicked out of the US Army but was encouraged to stay, by being belted in the mouth, by his good friend Fred P. Willis, Spencer Tracy, ended up on the front lines in France. With Jimmy's unit pinned down by a German machine gun nest he single handedly put it out of commission picking off some half dozen German soldiers from the safety of a nearby church steeple. It was when Jimmy gunned down the last surviving German, who raised his arms in surrender, that an artillery shell hit the steeple seriously wounding him.<br /><br />Recovering from his wounds at an Army hospital Jimmy fell in love with US Army volunteer nurse Rose Duffy, Gladys George. Rose was really in love with Jimmy's good friend the happy go lucky Fred despite his obnoxious antics towards her. It's when Fred was lost during the fighting on the Western Front that Rose, thinking that he was killed, fell in love and later married Jimmy. When Fred unexpectedly showed up in the French town where Jimmy, now fully recovered from his wounds, was stationed at things got very sticky for both him and Rose who had already accepted Jimmy's proposal of marriage to her!<br /><br />With WWI over and Jimmy marrying Rose left Fred, who's still in love with her, a bitter and resentful young man. It was almost by accident that Fred ran into Jimmy on the streets of New York City and discovered to his shock and surprise that he completely changed from the meek and non-violent person that he knew before he was sent to war on the European Western Front. Smug and sure of himself, and his ability to shoot a gun, Jimmy had become a top mobster in New York City's underworld! Not only that but as Fred later found out his wife Rose had no idea what Jimmy was really involved in with Jimmy telling her that he works as a law abiding and inoffensive insurance adjuster.<br /><br />Jimmy's life of crime came full circle when Rose, after she found out about his secret life, ratted him out to the police to prevent him from executing a \"Valentine Day\" like massacre, with his gang members dressed as cops, of his rival mobsters. While on trial Jimmy came to his senses and admitted his guilt willing to face the music and then, after his three year sentence is up, get his life back together. <br /><br />***SPOILER ALERT*** Hearing rumors from fellow convicts that Rose and his best friend Fred were having an affair behind his back Jimmy broke out of prison ending up a fugitive from the law. It's at Fred's circus, where he works as both manger and barker, that Jimmy in seeing that Rose as well as Fred were true to him that he, like at his trial, had a sudden change of heart. But the thought of going back to prison, with at least another ten years added on to his sentence, was just too much for Jimmy! It was then that Jimmy decided to end it all by letting the police who by then tracked him down do the job, that he himself didn't have the heart to do, for him!"
        },
        {
            "id": "pos_258",
            "text": "Sandwiched in between San Francisco and Captains Courageous two of Spencer Tracy's greatest parts is this very curious film about war and the effects it has on some people. They Gave Him A Gun stars Spencer Tracy and Franchot Tone in the only film they ever made together and Gladys George as the woman who loves them both.<br /><br />Tracy and Tone are a couple of World War I draftees, Tone is a weak character who almost goes over the hill in boot camp, but Tracy stops him. Tracy is still playing the lovable blowhard, younger Wallace Beery type that MGM envisioned for him when they signed him away from Fox. <br /><br />Over at the front Tone gets an opportunity and takes it when during a fight he manages to get to a church tower that peers down on a German machine gun nest. He's learned to shoot by now and he does a Sergeant York. But Alvin C. York was never changed by the war the way Tone has.<br /><br />Wounded in the fight Tone convalesces at a hospital with Gladys George looking out for him. Tracy goes AWOL himself to visit his pal and he and George get something going. Later on when Tracy is reported missing in action, Tone and George marry. Tracy's brokenhearted when he comes back and learns of the marriage, but takes sit in stride. <br /><br />The rest of the film is dealing with Tone applying the the wartime skills he's learned to the gangster trade. He's a hit-man now and George doesn't really know what he does for a living. I think you can figure the rest out.<br /><br />The part of the film that gave me some trouble is that I can't believe Gladys George couldn't figure it out. She's a street smart girl, her part is very much like the one she played in The Roaring Twenties opposite James Cagney.<br /><br />Speaking of The Roaring Twenties, Humphrey Bogart's character development there is similar to Tone's although he was not the central character of the movie. In fact there are elements of They Gave Him A Gun that are to be found in Taxi Driver and in Clint Eastwood's classic, The Unforgiven. <br /><br />The World War I battle sequences are very well staged by director Woody Van Dyke. For some reason Leonard Maltin panned this film, I think it's a lot better than he gave it credit."
        },
        {
            "id": "pos_259",
            "text": "For a danish movie, I have to say, that this is very good movie.<br /><br />It's in a class of its own, yet it has an international potential.<br /><br />The movie has a big budget, and is starring famous danish actors, and a few newcomers, who play very well. It can be watched by anyone who like adventures, and a little bit of 'ghost' movie.<br /><br />Don't be afraid, be thrilled!"
        },
        {
            "id": "pos_260",
            "text": "Wow! A Danish movie with this kind of content? I mean, the actors, the story, the pictures, the efx - everything was where it should be. <br /><br />And a Danish EFX house producing those VFX - Wow! This is like the 2nd or 3rd time a Danish FX has produces visual effects in that quality.<br /><br />*SPOILER AHEAD* The twist with the ghostly children in the submarine was quite good, but generally I did not feel the big chill which I would expect from a ghost-movie. *END OF SPOILER*<br /><br />But anyway, this is a Danish movie which I as a Dane can be proud of.<br /><br />The only \"bad\" about this, is that it wasn't a Danish director, but a Swedish..."
        },
        {
            "id": "pos_261",
            "text": "I went to see this movie expecting a nice relaxing time in the theater with my younger sister. Instead, I had to really control myself in order to convince her that I was not scared. In many ways still a children´s story, but with a screenplay that has a lot of potential. Could have been one of the scariest movies if planned for another audience."
        },
        {
            "id": "pos_262",
            "text": "***SPOILERS*** ***SPOILERS***<br /><br />This movie, \"The Divers\", is really interesting. All I roughly knew about it was that it would involve nazi history, underwater scenes and everybody would be speaking Danish. But I decided to check it out for one reason, the fact that the story evolves around a sunken WWII German submarine. I've got a fetish for German subs, especially wrecks that can be dived upon. So I was a bit sceptical about the Danish part, but reasoned that the sub could weigh up that part. Knowing that Nordic films aren't always that good and not sure of the budget size I was, to say the least, very sceptical.<br /><br />Upon viewing I was ... surprised.<br /><br />I had some thoughts on the actors being inadequate, seeing how some are very young, the two main actors in particular. This was not an issue, they both perform very well. As do the other actors, who mostly consist of people in their 50's and beyond. This makes for some interesting interaction between young and old, not often seen on the screen. Not unique in anyway, but somewhat rare. And it's all good.<br /><br />As for the Danish language, it is nearly impossible to understand. But this was no problem, it had subtitles.<br /><br />Another issue was the submarine itself, I suspected there would be interior shots as well as underwater exterior shots of the submarine. Having decided their budget was slim, I thought this could turn out adequate at the best and down right awful at it's worst. Again I was surprised, the exterior scenes of the wreck are beautiful and the interior scenes are very realistic. Having a fetish for German subs, I knew what the sub should look like, especially inside, and was not let down. The team has done some serious research. It's all good.<br /><br />I suspect more people than myself will watch this movie just to see some sub wreck scenes so I feel I must issue a \"warning\". The submarine in the movie is not an actual model that existed during the war. It's a special purpose sub. But to give you a hint of what to expect, it's a crossing between a Type VII, Type IX and a Japanese transport sub similar to I-52. It's god a good design and makes a nice wreck.<br /><br />The setting is on a Danish island or peninsula, I can't remember. It's summertime and two brothers travel to their grandfather to celebrate the coming of summer as they do every year. Their grandfather is a mariner of sorts. The cinematography is quite nice, a lot of pretty summer scenes at the island docks, some newfound teenage love, nice diving weather and a general feeling of \"perfect\". Once again, it's all good.<br /><br />Plot-wise the island gets some visitors of the suspect kind, a gathering of men hire one of the boats, an old minesweeper and it's crew. One of the visitors, a man in his 50's, has the german eagle and swastika tattooed on his back. The island's senior citizens all remember when a german u-boat was sunk towards the end of world war II and ever since then there have been rumors of nazi gold in the depths. The grandfather was one of the young men who searched for the sunken u-boat shortly after german bodies started floating ashore back in 1945. No submarine was ever found.<br /><br />WHAT TO EXPECT<br /><br />Key elements are nazi experiments, nazi history, treasure hunting, secrecy, competition, teen love, conspiracy, and ...a surprise.<br /><br />*** WARNING - SPOILER ***<br /><br />I had not expected some elements of the supernatural to appear in this movie and it caught me off guard. Not being a big fan of supernatural events, it nevertheless fitted well into the story and poses no problem. It's not like \"From dusk til dawn\" where everybody turns into vampires towards the end. This is a bit more subtle.<br /><br />OVERALL : Really good movie, I gave it an 8. Some due to the fact that it isn't a Hollywood movie with unlimited resources. I later learned that it had a fair budget and that some of the actors were seasoned Danish veterans. But even if this had been a Hollywood production, I would give it a 7 or 8. Definately worth your while. Yes, a child's story in a way, but then again a mature tale. It has a lot of suspense and a grand aura of adventure, which I found very appealing. And, again, the cinematography is really nice.<br /><br />/Medusa 2001<br /><br />"
        },
        {
            "id": "pos_263",
            "text": "This was a strong Poirot/Suchet, television mystery selection. The characters were vivid and well-acted. The plot and the main setting--a student hostel-- were excellent. Japp was nothing special but for me did not distract from story. One significant point, many Poirot watchers don't recognize good acting or good characterization. I also think they are rather harsh in their judgments of some of the Poirot mysteries. Finally, I have read few Christie novels--none in recent years-- and find it annoying that so many viewers are upset about changes from the novel. Please, viewers, consider what is presented to you on film, not what you think should be there. That said, the Poirot mysteries vary in quality, but not as much as reviewers and raters would have you believe. With the singular exception of The Five Little Pigs which was fabulous in plot, character and theme, the longer Poirot films are neither that good or that bad. For the record, I have seen all the longer Poirot/Suchet films. Finally, films without Lemon, Hastings, and/or Japp are neither good nor bad because of their absence. There presence, however, is either obtrusive (almost always with Japp) or irrelevant with Hastings. Lemon is in the middle."
        },
        {
            "id": "pos_264",
            "text": "Hickory Dickory Dock was a good Poirot mystery. I confess I have not read the book, despite being an avid Agatha Christie fan. The adaptation isn't without its problems, there were times when the humour, and there were valiant attempts to get it right, was a little overdone, and the events leading up to the final solution were rather rushed. I also thought there were some slow moments so some of the mystery felt padded. However, I loved how Hickory Dickory Dock was filmed, it had a very similar visual style to the brilliant ABC Murders, and it really set the atmosphere, what with the dark camera work and dark lighting. The darker moments were somewhat creepy, this was helped by one of the most haunting music scores in a Poirot adaptation, maybe not as disturbing as the one in One Two Buckle My Shoe, which gave me nightmares. The plot is complex, with all the essential ingredients, though not as convoluted as Buckle My Shoe,and in some way that is a good thing. The acting was very good, David Suchet is impeccable(I know I can't use this word forever but I can't think of a better word to describe his performance in the series) as Poirot, and Phillip Jackson and Pauline Moran do justice to their integral characters brilliantly. And the students had great personalities and well developed on the whole, particularly Damian Lewis as Leonard. All in all, solid mystery but doesn't rank along the best. 7.5/10 Bethany Cox"
        },
        {
            "id": "pos_265",
            "text": "A series of random, seemingly insignificant thefts at her sister's boarding house has Miss Lemon quite agitated. A ring, light bulbs, a rucksack, a lighter, a stethoscope, a shoe  there seems to be no rhyme or reason to any of it. Miss Lemon asks her employer, the great Belgian detective Hercule Poirot, to look into the matter. But what Poirot sees is something far more sinister than Miss Lemon could have imagined. And Poirot's fears are confirmed when one of the students living in the boarding house if found murdered. It's up to Poirot to bring a killer to justice.<br /><br />Hickory Dickory Dock is a solid, but not spectacular, entry in the long running Poirot series. I appreciate how faithful the script is to Agatha Christie's original story. I realize that certain liberties had to be taken, but I appreciate the effort nonetheless. The major points of the mystery are all there  the petty thefts, the boarding house, the students, the ripped rucksack, and, of course, Poirot's ability to see something sinister going on before it actually happens. With a few exceptions, the cast of students is almost as I pictured them. Damian Lewis and Jessica Lloyd standout among the group. As mush as I always enjoy David Suchet's Poirot, I get a real kick out of the episodes with Phillip Jackson's Inspector Japp and Pauline Moran's Miss Lemon. This episode is a real treat as Miss Lemon gets more screen time than usual. Finally, I enjoyed the use of the ever present mouse as an observer of the activities in the hostel. It's a fun little play on the Hickory Dickory Dock title.<br /><br />I realized while re-watching Hickory Dickory Dock just what a tremendous influence Agatha Christie's work was on the highly stylized Italian mystery films, or Gialli, of the 60s and 70s. Take the murder of Mrs. Nicoletis as an example. If you were to bump up the graphic nature of the scene, you would have something straight out of an early 70s Giallo. In fact, the entire plot of Hickory Dickory Dock could have been used in a Giallo. It's just convoluted and interesting enough to have worked."
        },
        {
            "id": "pos_266",
            "text": "This story was never among my favourites in Christie's works so I was pleasantly surprised to quite enjoy this adaptation. The mouse motif was effective if a little overdone, the bones of the story are there although more emphasis is placed on the 'crime in the past' subplot. The students were all pretty much as I imagined them although its a pity they weren't a more cosmopolitan bunch - perhaps the revised thirties setting didn't allow for that! I thought some very daring risks were taken with the filming; perhaps its because I've not long re-read the book but it seemed pretty obvious to me who the murderer was from their appearance in some reveal shots quite early on.<br /><br />Humour was much more prevalent in these early Poirots. Sometimes it works but I found a lot of it rather heavy handed in this episode (though I did smile at the 'Lemon sole' throwaway line). Altogether though, a solid entry in the series though not one of the best."
        },
        {
            "id": "pos_267",
            "text": "It all begins with a series of thefts of seemingly unrelated objects in a hostel for students on Hickory Road, London. Concerned for her sister, who is the housekeeper there, Miss Lemon asks Hercule Poirot to look into the matter. He agrees, but soon the stakes get higher when a girl, who had admitted that she was responsible for most (not all) of the thefts, is found murdered.<br /><br />\"Hickory Dickory Dock\" is a solid brain exercise, without being as mind-numbingly complicated as \"One, Two, Buckle My Shoe\". Murder, theft and diamond smuggling are the crimes involved, and the final twist that ties everything together is revealed only in the last 2 minutes! The characters are interesting, particularly the psychology student Colin McNabb and the mysterious American girl Sally Finch, Inspector Japp has his funny moments (in perhaps the closest this series has come to \"toilet humor\"), and Miss Lemon gets a more integral part to the story than usual. (***)"
        },
        {
            "id": "pos_268",
            "text": "I loved Dedee Pfeiffer (is that spelled right?) in Cybil. Haven't seen her for awhile and forgot how much I missed her. I thought she did a great job in this. The supporting cast was pretty good too. In some angles, the daughter even looked like a young Nicole Kidman. The abductor was pretty creepy and the story generally had some good twists. The young boyfriend was a hottie. I thought the husband definitely had something to do with it for sure.<br /><br />Just got the Lifetime Movie Network for Christmas and am loving these movies. Kept my interest and I'll watch it again when they rerun it. Can anyone else recommend any similar movies to this? You can post on the board or send me a private email if you want. Thanks in advance. Aboutagirly."
        },
        {
            "id": "pos_269",
            "text": "I'm a fan of TV movies in general and this was one of the good ones. The cast performances throughout were pretty solid and there were twists I didn't see coming before each commercial. To me it was kind of like Medium meets CSI.<br /><br />Did anyone else think that in certain lights, the daughter looked like a young Nicole Kidman? Are they related in any way? I'd definitely watch it agin or rent it if it ever comes to video.<br /><br />Dedee was great. Haven't seen in her in a lot of things and she did her job very convincingly.<br /><br />If you're into to TV mystery movies, check this one out if you have a chance."
        },
        {
            "id": "pos_270",
            "text": "I have to say, Seventeen & Missing is much better than I expected. The perception I took from the previews was that it would be just humdrum but I was pleasantly surprised with this impressive mystery.<br /><br />Dedee Pfeiffer is Emilie, a mom who insists her daughter, Lori (Tegan Moss), not attend a so-called graduation party one weeknight, but Lori ignores her mother's wishes and takes off for the party anyway. When Lori does not come home, Emilie knows something is wrong and she begins to have visions of her daughter and the events that led to her disappearance.<br /><br />Seventeen & Missing is better than so many other TV movies of this type, as it is not so predictable. Pfeiffer is the reason to see this movie, and most of it comes off as believable. This LMN Original Movie premiered last night. 10/10"
        },
        {
            "id": "pos_271",
            "text": "It's all about Mitzi. I loved her in this. And didn't she look fantastic?! I love these Lifetime Sunday afternoon popcorn movies. This is like one of those nailbiters where they always go to commercial at the most annoying times. The Richard character was completely creepy. I've dated guys like that. Well, not totally like that lol. I wish Zack hadn't have gotten killed. He was a cutie and very easy on the eyes. I LOVE these stalker type stories. It always makes me get up and make sure my doors are locked. My husband doesn't usually like these types of movies but actually sat through the entire thing with me and actually enjoyed it. I can't wait to see what Mitzi does next!"
        },
        {
            "id": "pos_272",
            "text": "Loved it but still have nightmares over the hotel manager.The movie, was presented well, with the choice of actors carrying their roles to reality of the writing. Many scenes gripped the imagination and created a nail biter. The progression of situations were cleverly written,making me believe the story was headed one way only to find a new twist on what I thought might be the obvious. Too bad there have to be commercials.I have told many friends to watch for further showings and I of course will view again.I enjoyed the scenery of the film and felt this added to the plots and intrigue. Husband and wife heated discussions(or should I say fights?) were very realistic.The initial situation is a common one but the escalation into the story presented fortunately is not.I want to thank all who were involved in this great entertainment film. Thank you! Looking forward to the next films---when? Whidbey"
        },
        {
            "id": "pos_273",
            "text": "It's hard for me to criticize anything that Mitzi Kapture does. She just radiates beauty and grace on the screen and is a phenomenal actress. That notwithstanding, yes, the plot was predictable. I think perhaps if Jill HAD slept with Richard then it may have made him a little crazier than he already was, which would have added more to the suspense. It would have also been nice to see Jill and her husband find out about Richard's little problem with his ex-wife, maybe a bit more back story. I was a little disappointed with the ending of the movie. I would have liked to have seen more closure with Zack's death and possibly closure with her husband. I do have to say though, I will never be able to look at a flare gun and not picture her standing there. It was a very fitting end for Richard. Of course, Mitzi ROCKED! I am so looking forward to her future projects."
        },
        {
            "id": "pos_274",
            "text": "I watch most movies that Nick Mancuso is in because, frankly, I love the guy, even though as he ages he is typically cast as the baddie (long-time fans should note that he is for some reason blond in this flick). It's a fairly familiar movie in terms of plot (but then most movies these days aren't exactly original), but Rick Roberts is appealing as the imperfect husband, Martha MacIsaac is equally appealing as the daughter, and Mitzi Kapture does a good job, if that was her goal, of being angry and sometimes pretty hard to like. Nick has still got it in terms of being able to demonstrate both charm and psychosis. However, too much of the plot takes place off-screen -- like motivation, prior behaviors, good times and bad times -- and things that seem apparent to the characters never quite make it to the audience (i.e., me). The final scene leaves everything to be desired in the \"but what about...\" category, and overall, I can't say that I cared much about any of the characters. That being said, it was what it was -- a reasonably entertaining way to spend the afternoon -- and I still like Nick."
        },
        {
            "id": "pos_275",
            "text": "This film starts out with a family who were all going in different directions and their teenage daughter Martha MacIssac (Olivia Dunne) was very much in love with Joe MacLeod,(Zack). The mother is played by Mitzi Kapture,(Jill Dunne) who suddenly walks in on her daughter and Zack making out and then all kinds of problems seem to surface. Jill Dunne has a husband who is always traveling or staying away from the home quite often. There are also big problems that occur when the family decides to go on a camping trip which their daughter Olivia dislikes and just cannot adapt to sleeping outdoors and requires a tent to be kept out all the bugs. In many ways, Olivia does an outstanding performance as the teenage and Nick Mancuso,(Richard Grant) gives a great supporting role as a hotel owner. This film will keep you guessing how it will end and you will enjoy a film filled with plenty of horror and terror. Enjoy"
        },
        {
            "id": "pos_276",
            "text": "When you actually find a video game to be scary or disturbing, you know that the developers have done some very serious and hard work to make the whole thing work. Undying used the Unreal engine but had very little resemblance to that game when it came to actual gameplay. Speaking of gameplay, the pace is slowed down and the sheer difficulty in progressing through the very hard to kill enemies makes for a very unqiue gameplay experience. The production values are so high that you may even forget that it is a video game. The game itself is also packed with loads of secrets that you have to uncover using special vision. The level design in fantastic and the weapons as well as the enemies will really shock you."
        },
        {
            "id": "pos_277",
            "text": "Not being a fan of first person shooters I was very hesitant to play this game. After having played the demo however I was sold. \"Undying\" really manages to pull you in the game and be part of the universe that your character is in. You have this green amulet,called the \"Gel'ziabar Stone\" that has special powers and warns you of particular events or things to look at. With a special spell \"the scrye\" you can see certain things that otherwise would be invisible to you. Walking in a hallway you suddenly hear the magical stone whisper:\" Look\",with the stone glowing at for example a painting. And then using the scrye spell you can see some weird and creepy stuff on the painting. Let me tell you to witness something like that is scary as hell. People who expect to finish this game in a few hours can forget about that even with the use of cheats. This game relies on the character using wits and walking carefully around. Because like in any horror movie your surroundings are usually pretty dark. And ghosts and monster appear at random when you don't expect them and can kill you very quickly. There is this one scene where you want to enter a room where you are pushed back with such great force that it takes moments for you to realize what happened. This was a scene that could have come straight out of the horror classic \"Evil Dead\"! To experience something like this is a real accomplishment. There are a lot of elements that take \"Undying\" to the level of the best classic horror movies ever produced. But sadly I have to report that there are some flaws. For one thing the universe you are playing in is huge. You start out in a big mansion with all sorts of hidden,secret rooms and even a hidden hell dimension called \"Oneiros\". That is all fine in the beginning. But with all the loading times and some difficult enemies in between that can become frustrating. And there is no map. The game demands you memorize your surroundings. So patience is required. Also there are some jumping puzzles that you have to do otherwise you can't progress. I don't mind jumping on platforms in third person adventures. But in first person mode that can be an annoying task. Luckily you can save at anytime and anyplace. And trust me you will need it. Overall \"Undying\" is an extraordinary first person shooter that deserves to be played by any horror or game fan."
        },
        {
            "id": "pos_278",
            "text": "I gotta say, Clive Barker's Undying is by far the best horror game to have ever been made. I've played Resident Evil, Silent Hill and the Evil Dead and Castlevania games but none of them have captured the pure glee with which this game tackles its horrific elements. Barker is good at what he does, which is attach the horror to our world, and it shows as his hand is clearly everywhere in this game. Heck, even his voice is in the game as one of the main characters. Full of lush visuals and enough atmosphere to shake a stick at, Undying is the game to beat in my books as the best horror title. I just wish that this had made it to a console system but alas poor PC sales nipped that one in the bud."
        },
        {
            "id": "pos_279",
            "text": "I love the way that this game can make you literally jump out of your seat while you are playing it. The way that the screen jumps and flashes when you get hit, its very realistic while at the same time you have to remember that its just a game and your not really there. The sound effects and audio are amazing. There are a lot of weapons and different spells to cast and you can even choose which spells to make stronger or not. You get this stone that can knock back enemies while you recover mana to blast your foes with even more magic. The best part is that the whole time you are playing it you are really jumpy and afraid of what might lurk around the next corner or what might jump out behind you. If you want to get the full experience, try playing it with head phones on."
        },
        {
            "id": "pos_280",
            "text": "Undying is a very good game which brings some new elements on the tired genre of first person shoot em ups. It tells the story of Patrick Galloway an expert of the occult and a formidable fighter who is summoned by a friend to his estate in Ireland to investigate some weird phainomena. The game is set in Ireland after World War one so don't expect to find weapons like chainguns or rocket launchers.All the weapons in the game can be considered antiques but the real fun in the game are its spells and the system they operate on.Our hero is ambidexterous so he can use both his hands at the same time: he casts spells with his right arm and uses his guns with the left.So you can shoot and cast spells at the same time which as you understand very fun and also unique to this game! The graphics are great and they can run very well on a medium power P.C..Level design is also cool and atmospheric. Mostly the game revolves around the Covenant estate and the mansion but there are many other locations waiting to be discovered as you progress. Thanks to the talent of Clyve Barker the game has an excelent storyline and plot (something very rare for a First person shooter) and i said before a great and very spooky atmosphere the voice acting is also good but not excellent. But the game has two main flaws. First of all it is quite linear so when your mission says for example go to that room all the doors in the house will be locked apart from those that lead to the room of your mission this may save time but it restricts your liberty of exploration.Secondly the fact all the weapons are antiques may not appeal to most fps players who are used to high tech weaponry. As far as difficulty is concerned the game is very well balanced. Most of it is of medium difficulty but sometimes it gets more difficult but not frustratingly difficult. Overall undying is a great game. Definitely one of the best fps out there."
        },
        {
            "id": "pos_281",
            "text": "This game was really great and quite a challenge. It has a great, spooky story line and the graphics are also very good. I would recommend this game to all Horror fans and is very gripping from start to finish. The only problem with this game is that i would have liked more weapons but thats just me.<br /><br /> A truly great game for RPG and Shoot'em'up fans.<br /><br />>"
        },
        {
            "id": "pos_282",
            "text": "This is undeniably the scariest game I've ever played. It's not the average shoot-everything-that-moves kind of fps (which I usually don't care much for), but the acceptable gfx, interesting weapons and magic, great surround soundeffects (\"Scryeeee, scryeeee..\") and above all incredible atmosphere. I love the Scrye, which enables you, at certain places in the games, to see or hear events that happened there in the past. The only game I've had to take regular breaks after a few minutes of playing just because of the intensity of the atmosphere. I'm a great horror fan, escpecially of Clive Barker's stories and movies, and participating in a horror story like this makes me yearn for more games that emphasizes atmosphere and a more involving story. 9/10 (-1 because I'm no fps fan, and perhaps the game was a bit short?)"
        },
        {
            "id": "pos_283",
            "text": "\"The Days\" is a typical family drama with a little catch - you must relate to the character's emotions in every way possible in order for you to truly appreciate the show.<br /><br />[Possible Spoilers For Those Who Are Unfamiliar With the Show]<br /><br />The story, obviously, for all the people who has watched the show, is the world of Cooper Day, the middle child of the family. He records his days with his family and hopes to become a rich and famous writer one day because of his observations. His family includes a mother, a father, a perfect sister, and a genius-little-brother. The first episode, which is going to sound a bit stupid since John Scott Shepard has created this situation - both the sister and mother gets pregnant. That's the first situation the writer hits. Then the father quits his job at the law firm. The youngest son gets a panic attack. The middle child gets in a fight with the sister's boyfriend. This is all in a day's work.<br /><br />[/Spoilers]<br /><br />I admire this show. I don't know. It's a bit crappy but I like it. First I thought the camera-work was a ripoff but then I got used it and started to like it. I liked the quiet conversations under a dark light. I liked the intimate feeling of the show. I liked the low-budget style. I liked the acting. I admire the story. Then I find myself wanting a second season of The Days. I slowly became a fan of it as the 6-episode airing on ABC came to an end. It's a really good show and it's nothing like The OC. The two have nothing in common. So I hope fans will stop comparing them.<br /><br />And if you can relate to either Abby, Jack, Natalie, Cooper or even Nate, you'll like this show. A lot."
        },
        {
            "id": "pos_284",
            "text": "the one and only season has just aired here in Australia and i thought it was absolutely brilliant! i love it! all the story lines are so good! and its a much more realistic view on teen and family life today. yet it still kept strong family values of sticking together and being there for each other. their problems were real, and it really drew you into the show. the show is basically about this family called 'the Days' and their lives. the family consisted of Abby Day (mum), Jack Day (dad), Natalie Day (sporty daughter), Cooper Day (outsider son), and Nathan Day (boy genius son). each episodes a day of their life, with coopers perspective on things throughout it. i loved cooper his insight through out the show was just great. he was by far my favorite character. it ended with so many things it could've continued with, I'm really sad another season wasn't made. it was a great show I'm gonna miss it."
        },
        {
            "id": "pos_285",
            "text": "I would just like to say, that no matter how low budget the film is, it needs to be shown throughout this world the point to these movies. We don't read that much anymore, instead people want to see movies. Having this series out on DVD, has made me want to read the whole series, and want more. PLEASE MAKE ALL 8 MOVIES. Please don't change any of the characters either, it ruins the effect. Because I have grown to love the actors who have played the characters. PLEASE MAKE ALL 8 MOVIES. I want to see the message, and watch the message that these books and now movies are here to portray. We don't get that enough anymore. AWESOME JOB!!!"
        },
        {
            "id": "pos_286",
            "text": "I read many commits when it was in the theaters and they were all bad....I think you have to be a certain type of person to enjoy these movies. If you are not a person that enjoyed the Waltons or Little House...U will not understand nor enjoy these movies...<br /><br />Now about Loves Abiding Joy...I knew HE was bad news from the start of the movie....I wish it would have shown more of the end instead of letting you just think it. This movie has a lot to do with Jeff....it is 6 years later so you know he will be interested in Girls.<br /><br />I want to say that I have enjoyed all 4 movies so far....Was not crazy about the books...Cant wait until the next movie. The way Clark talks will get you every time. I would love to see January Jones do an appearance...Maybe a family reunion or something."
        },
        {
            "id": "pos_287",
            "text": "We loved the movie. I am a mother to two little men. I love having a movie I can watch with them where men have integrity and character. Moveis where money is not the most important thing. And family's are forever and love means more then words. <br /><br />I do wish we saw more of the Davis family. But over all I loved it left me with the same feeling the others did \"please don't be over\". We both wish actors would not change.The new actors were good replacement tho.<br /><br />My 9 year old son loved this movie too. asked me to go buy them all. He is a movie critic so for him to say this tells me something. Family should all see this move buy it for friends . Help bring back a time of values. We will be Reading the books now that we are hooked. really hope to see more. Be Blessed happy moving"
        },
        {
            "id": "pos_288",
            "text": "This movie was so great! I am a teenager, and I and my friends all love the series, so it just goes to show that these movies draw attention to all age crowds. I recommend it to everyone. My favorite line in this movie is when Logan Bartholomew says: \"rosy cheeks\", when he is talking about his baby daughter. He is such a great actor, as well as Erin Cottrell. They pair up so well, and have such a great chemistry! I really hope that they can work again together. They are such attractive people, and are very good actors. I have finally found movies that are good to watch. Lately it has been hard for me to find movies that are good, and show good morals, and Christian values. But at the same time, these movies aren't cheesy."
        },
        {
            "id": "pos_289",
            "text": "I love all of the movies by Michael Landon Jr. And Michael Landon Jr's casting of Dale Midkiff as \"Clark Davis\"could not of been any better. Dale Midkiff has the ways to pull off this character.<br /><br />This movie kept me spellbound from start to finish.<br /><br />The death of Missie & Willies baby girl with the timing of Clarks visit was only Gods timing. How they dealt with the death and how Clark helped them do so was that of a fathers love.<br /><br />Although there are 3 movies before this one [ Love Comes Softly , Loves Enduring Promise & Loves Long Journey], I feel you can see this movie and understand it easily. Yet leave and want to see the previous 3 movies due to the history all the characters have behind them.<br /><br />Michael Landon Jr. is an excellent director<br /><br />I look forward to many more movies from him in the future."
        },
        {
            "id": "pos_290",
            "text": "Edmund Burke said that \"all evil needs is for good me to do nothing.\" Hollywood often gives us trash because not enough families go to see quality films. This movie was uplifting story of the loss and restoration of faith. It had no violence, no lewdness, and did not deserve a PG rating. The western scenery was filmed well, and some of the vistas were simply breathtaking. Actors were a bit young for their parts, but otherwise believable and talented. Music score was too loud, and in some places drowned out the dialog completely. I'm seldom surprised by movie endings any more, but I was pleasantly surprised by this one. Sometimes the good guys do win, and they win by honest efforts. We liked the movie and the message, and would recommend it for the entire family."
        },
        {
            "id": "pos_291",
            "text": "Zombie Chronicles isn't something to shout about, it's obvious not a award winning movie but it is a entertaining B-movie directed by Brad Sykes who directed Camp Blood which was another entertaining low budget flick. The acting is bad like most cheaply made movies but that's what makes it more entertaining, the zombie make-up is cool and effective especially with the budget, the gore is also great and gross, the film is sort of like a zombie version of Tales from the Crypt since we get two tales about zombie encounters in the woods, the stories are fun and do leave you guessing especially the first tale. Zombie Chronicles is a lot better than some low budget zombie movies out there, if you love low budget B-movies or cheaply made zombie flicks then check out Zombie Chronicles."
        },
        {
            "id": "pos_292",
            "text": "Okay, first of all I got this movie as a Christmas present so it was FREE! FIRST - This movie was meant to be in stereoscopic 3D. It is for the most part, but whenever the main character is in her car the movie falls flat to 2D! What!!?!?! It's not that hard to film in a car!!! SECOND - The story isn't very good. There are a lot of things wrong with it.<br /><br />THIRD - Why are they showing all of the deaths in the beginning of the film! It made the movie suck whenever some was going to get killed!!! Watch it for a good laugh , but don't waste your time buying it. Just download it or something for cheap."
        },
        {
            "id": "pos_293",
            "text": "What could be more schlocky than the idea of private detectives getting involved with the women they're supposed to be spying on? And most of the dialogue as written is perfectly banal.<br /><br />But the actors turn the dialog into something that makes sense. You can see real people behind the unreal lines. And the directing is wonderful. Each scene does just what it has to and ends without dragging on too long.<br /><br />I showed this to several friends in the mid-80s because I was perplexed at how such bad material could be made into such a good movie. The friends enjoyed it too."
        },
        {
            "id": "pos_294",
            "text": "A critical and financial flop when first release, the critics have turned around and stated that this film ison of the Director's best. A La Ronde like feel to the film quickly develops as the guys from a detective agency (Ben Gazzara, John Ritter and Blaine Novak) persue, fall in and out of love with some of the most quirky and beautiful women seen on film (Audrey Hepburn, Colleen Camp, Dorothy Stratten and Patti Hansen). Much of the script was ad-libbed or re-written on the day of shooting which gives the film a breezy feel. Ben Gazzara is excellent as the head detective persuing Audrey Hepburn after dropping singer Colleen Camp and seeing cab-driver Patti Hansen on the side. John Ritter ineptly follows Dorothy Stratten and immediately falls in love with her. Blaine Novak has a few girls he is chasing (including Joyce Hyser and Elizabeth Pena). This film has some great performances by a supurb cast. Standouts are Audrey Hepburn (she doesn't have a line in the first half of the film). Ben Gazzara has never been better (and an inspiring choice for a romantic lead) and Colleen Camp has one of her best roles as the manic country singer Christy Miller. She is a delight to watch as she fires off her lines in a rat-a-tat-tat delivery. Highly Recommended! ********* stars!"
        },
        {
            "id": "pos_295",
            "text": "Bogdonovich's (mostly) unheralded classic is a film unlike just about any other. A film that has the feel of a fairy tale, but has a solid grounding in reality due to its use of authentic Manhattan locations and \"true\" geography, perhaps the best location filming in NYC I've ever seen. John Ritter reminds us that with good directors (Bogdanovich, Blake Edwards, Billy Bob) he can be brilliant, and the entire ensemble is a group you'll wish truly existed so you could spend time with `em. One of the few romantic comedies of the last 20 years that doesn't seem to be a rip-off of something else, this is the high point of Bogdanovich's fertile after- \"success\" career, when his best work was truly done (\"saint jack\", \"at long last...\", \"noises off\"."
        },
        {
            "id": "pos_296",
            "text": "Sublimity is the way we have to reach for The Beauty. And sublimity is the stuff this film is made of. If not his best, it's my most loved of all Bogdanovich movies.<br /><br />This unique masterpiece remind us, as most of the other films from the director, what life is (or should be) about: love, lost (or failure) and hope and faith and charity. As the song from whom the films takes its title (Gershwin's well known composition) the film makes the impossible true, and tries to make us aware that no-one is able to judge anybody; all this with the lightness of a comedy and the timing of a masterful direction (the first ten minutes, with the detectives following the ladies, almost without a line of dialogue, constructed upon the looks and views of the characters --with that \"Bogdanovich touch\" based on the point-of-view-- is a class on Cinema Language, something that P.B. learned well from his admired directors from the Golden Age of the Movies). With a superb cast and a glorious soundtrack (including the best of Sinatra's \"Trilogy\"), this movie, full of self-consciousness and compassion, and far away from self-indulgence and emptiness (as some critics wrote), deserves a better place on the History of American Cinema than where it have been placed. It's not \"long on style, short on substance\": it is complex in its simplicity, and beautiful, absolutely beautiful."
        },
        {
            "id": "pos_297",
            "text": "I am glad other people enjoyed this movie, cause I know it doesn't have the greatest reputation and it made no money at the box office. I thought it was terrific and there are several reasons why - Bogdanovich directs with the lightest of touches, the cast (especially Coleen Camp) is perfect and the Big Bad Apple never looked better on film. You've seen worse movies!"
        },
        {
            "id": "pos_298",
            "text": "New York has never looked so good! And neither has anyone in this movie. While the script is a bit lightweight you can't help but like this movie or any of the characters in it. You almost wish people like this really existed. The appeal of the actors are what really put it over(John Ritter, Colleen Camp and the late Dorothy Stratten are particularly good.) Go ahead and rent or buy this movie you'll be glad you did."
        },
        {
            "id": "pos_299",
            "text": "Peter Bogdonavich has made a handful of truly great films, and THEY ALL LAUGHED is one of his best. The cast couldn't be better equipped to play this light but slightly bittersweet screwball comedy. Interestingly enough, the witty, light touch Bogdonavich so effortlessly employs gives the film a rather disarming emotional core. Fresh and immediate, the film starts with absolutely no explanation. There's no soundtrack music to cue us. We meet the characters in action, and as Bogdonavich glides down the streets of New York, the film unfolds effortlessly. Robby Muller's camera captures it all with an understated simplicity that seems accidental, but surely isn't. The cast is terrific. In every way, a classic."
        },
        {
            "id": "pos_300",
            "text": "With various Bogdanoviches and Gazzaras scattered throughout cast and crew \"They all laughed\" is very much a family affair.If you add the fact that B.Gazzara and Miss A.Hepburn had a brief but passionate affair in an earlier picture it has the air of almost a private movie made for the enjoyment of the participants and that the entertainment of a wider audience merely an ancillary consideration.If this all smacks of smug \"in - joke\" self gratification you will be pleased to hear that Mr Bogdanovich sails well clear of that particular hazard and delivers a sweet and rather innocent \"I love N.Y.\" paean that is also an altar at which we can worship the ethereal beauty of the late Miss Hepburn. Make no mistake this is her picture.Mr Gazzara concedes it to her most self - effacingly in all their scenes together. The plot - a detective agency gets involved too personally in its clients' affairs - is of minimal importance,it is the performance of the two leads that dominates the movie. Mr Bogdanovich's triumph is in the way his camera seems to love his actors,from \"Targets\" onwards.There is a glow about every one of his films that only special artists can coax from an inanimate piece of optical equipment.Miss Hepburn in particular benefits from this love. Extra insights into his work can be obtained from reading the published collections of his essays on stars and directors,principally \"Who the hell's in it?\", recently remaindered in UK bookstores. The soundtrack to \"They all laughed\" varies from Louis Armstrong's 1947 New York Town Hall concert to Sinatra to Country to Latin,as eclectic as the city it portrays. Mr B,s \"Golden Boy\" image was sure to tarnish,for such is the nature of the movie business,but it is equally sure one day to be restored,and when that day comes \"They all laughed\" will be recognised for the fine work that it is."
        },
        {
            "id": "pos_301",
            "text": "'They All Laughed' is a superb Peter Bogdanovich that is finally getting the recognition it deserves, and why? their are many reasons the fact that it's set in new york which truly sets the tone, the fantastic soundtrack, the appealing star turns from Ben Gazzara, and the late John Ritter who is superb. and of course no classic is complete without Audrey Hepburn. the film is a light and breezy romantic comedy that is very much in the vein of screwball comedy from the thirties, film is essentially about the Odyssey detective agency which is run by Gazzara who with his fellow detectives pot smoking and roller skating eccentric Blaine Novak(the films co-producer) and John Ritter, basically the Gazzara falls for a rich tycoon magnate's wife(Hepburn) and Ritter falls for beautiful Dorothy Stratten who sadly murdered infamously after production, 'They All Laughed is essential viewing for Bogdanovich fans."
        },
        {
            "id": "pos_302",
            "text": "This movie is perfect for all the romantics in the world. John Ritter has never been better and has the best line in the movie! \"Sam\" hits close to home, is lovely to look at and so much fun to play along with. Ben Gazzara was an excellent cast and easy to fall in love with. I'm sure I've met Arthur in my travels somewhere. All around, an excellent choice to pick up any evening.!:-)"
        },
        {
            "id": "pos_303",
            "text": "Since the day I saw this film when it came out in 1981, it has been one of my top 3 favorites. The blurb I wrote for Amazon is below, and I'm just thrilled that it's finally coming out on DVD on 10/17/06 - the film's 25th anniversary.<br /><br />The last credit in this film explains its appeal - \"Thank you to the people of Manhattan on whose island this was filmed.\" A charming and witty romantic comedy, it is a love story written to New Yorkers (Peter Bogdanovich is a native) who can identify every location (West 12th Street, the Ansonia, the old FAO Schwartz, the Plaza, the Roxy, Chez Brigitte, and City Limits which was a country & western club). One gets the impression that the entire ensemble cast clicked as well off-screen as they do on, and this intimacy is clearly communicated. I laughed, I cried, it was better than CATS. Not only an ode to Dorothy Stratten, it was also Audrey Hepburn's last feature appearance (she had a cameo subsequent to this film) and her inner beauty seeps from the screen. Buy it, make a big tub of popcorn, and curl up with someone you love."
        },
        {
            "id": "pos_304",
            "text": "I watched it some years ago. I remembered it as very mysterious situations, and a mixture of melancholic things, like the fate of Dorothy and the personal future of Bogdanovich.<br /><br />I turn to watch on my VHS copy and then I was reviewing it more and more. Nowadays I am waiting for the DVD version, at any price, please!<br /><br />The country and easy listening music is very well chosen from the very first second, a bit of blueish, but also happy.<br /><br />All the characters are great to me, with funny situations, great acting and a lot of dialogs that have turn this as a cult movie to me and a lot of people I met on the Internet or cinema clubs. This may not be casualty.<br /><br />I think that the title is a hope about life! You have to be happy and laugh as much as possible<br /><br />I know that this may be a particular comment for the movie, but the fact is that I like it very much, I think that movie marked me and I will never forget it."
        },
        {
            "id": "pos_305",
            "text": "Screwball comedy about romantic mismatches in New York City. Peter Bogdanovich is obviously in love with all the women in his picture--he reveres them--yet Audrey Hepburn is (naturally) put a notch above the others because, after all, she's the princess Bogdanovich probably fell in love with at the movies 30 years prior. He shoots her in loving close-ups, gets right in the sheets between her and a wonderfully hard-boiled/soft-boiled Ben Gazzara, and allows her room to sparkle throughout. The love-connections made in the course of the film are fast and amusing, though I did tire of John Ritter's TV-styled klutziness. Colleen Camp, Dorothy Stratten, and the grounded, earthy-sensual Patti Hansen are all exciting to watch. But it's really Hepburn's valentine and she absolutely glows. *** from ****"
        },
        {
            "id": "pos_306",
            "text": "Well, I had seen \"They all laughed\" when it came out in<br /><br />Europe around 1982 and had kept a vague but dear souvenir of it. I 've just seen it again on tape, almost twenty years after... Bogdanovich has a true heartfelt tenderness over his characters and a kind sympathy which is difficult not to feel also. Excellent comedians and actors, good lines all over and for everyone and pretty good editing, too. I laughed and smiled all the time. Just as we all do, at times. Go get it."
        },
        {
            "id": "pos_307",
            "text": "\"They All Laughed\" is one of those little movies I am always recommending to friends seeking something out of the ordinary. It is firmly rooted in the screwball romance traditions of the past, but seems more contemporary. Even the decidedly early 80s atmosphere doesn't date it too much. Bogdanovich wisely keeps the whole enterprise so light on its feet, that reality never brings it crashing down to earth. But, that said, this sort of sweet little movie absolutely relies on the actors to keep it going, and \"TAL\" is blessed with a dream cast who understand the requirements of this sort of tale. It is a movie that wouldn't linger so long in the memory if it weren't for the little moments provided by the excellent cast: Colleen Camp's simultaneously shouting orders at John Ritter and her dog; Blaine Novak unleashing all that hair from under his hat; and especially the moment Dorothy Stratten falls for John Ritter and says, \"How...weird.\" It's such a piece of fluff one doesn't want to lay too much on it for fear of crushing it, but it is certainly does leave one with a light heart and a smile on one's face."
        },
        {
            "id": "pos_308",
            "text": "First of all this was not a three hour movie - Two hours, ten minutes... last time i checked commercials aren't actually part of a movie! Perhaps, though, it should've been a two parter for a total of about 3 hours? Yeah, would have gotten more in, been able to explore some more emotion. Overall, though, it was an interesting look into the lives of Lucy and Desi. I watch I Love Lucy from time to time and love it but never have I read or seen a biography, never knew anything about their lives off the screen. Because of this movie I do now but I'm not so sure that's a good thing. Everything here no one really needed to know. This was essentially a movie that didn't need to be made. But it was made and the reason is because Lucy & Desi are still such huge stars and certain people in American society feel that the rest of society needs to know ALL about our tv and movie stars. That is definitely so not true and very, very sad.<br /><br />Anyway, what was shown here in Lucy was pretty good. Two complaints - the actress who played Viv Vance - not great casting at all. And the switch from Madeline Zima to Rachel York.... uhhh, like Lucy had plastic surgery and all of a sudden she's a whole new person!? That wasn't too great. But the story went on and focused on the rocky relationship between Lucy & Desi. No, the kids were not shown very much at all and that wasn't necessarily a drawback to this movie because like I said, this focused mainly just on Lucy & Desi. Had there been more time, had the story been more about Lucy's entire life, then maybe the kids woulda been there more. But they weren't so we got to see the likes of Gable & Lombard, Red Skelton and Buster Keaton very briefly instead. Wow, that was one thing about this story that I thought was really cool: his presence and influence in Lucy's life. Really neat and it's too bad that wasn't explored more. Oh well. What was explored was done well, for the most part. Honestly, I don't think I'll ever watch this again and I don't think this movie'll be that memorable. For someone who digs I Love Lucy but isn't an enormous Lucille Ball fan, this should be an interesting watch. My grade for this: B"
        },
        {
            "id": "pos_309",
            "text": "Before I watched this tv movie I did not know much about one of my favorite actresses. After watching it, I realized how sad Lucille Ball's life really was. It had it's great moments too, but I didn't realize how sad it was. This movie was very good and told the story of the beloved Lucille Ball very well. I highly reccommend it."
        },
        {
            "id": "pos_310",
            "text": "Dramatic license - some hate it, though it is necessary in retelling any life story. In the case of \"Lucy\", the main points of Lucille Ball's teenage years, early career and 20 year marriage to Desi Arnaz are all included, albeit in a truncated and reworked way.<br /><br />The main emotional points of Lucy's life are made clear: Lucille's struggle to find her niche as an actress, finally blossoming into the brilliant comedienne who made the character Lucy Ricardo a legend; her turbulent, romantic and ultimately impossible marriage to Desi Arnaz; Lucy & Desi creating the first television empire and forever securing their place in history as TV's most memorable sitcom couple.<br /><br />As Lucille Ball, Rachel York does a commendable job. Do not expect to see quite the same miraculous transformation like the one Judy Davis made when playing Judy Garland, but York makes Ball strong-willed yet likable, and is very funny in her own right. Even though her comedic-timing is different than Lucy's, she is still believable. The film never goes into much detail about her perfectionistic behaviour on the set, and her mistreatment of Vivian Vance during the early \"I Love Lucy\" years, but watching York portray Lucy rehearsing privately is a nice inclusion.<br /><br />Daniel Pino is thinner and less charismatic than the real Desi was, but he does have his own charm and does a mostly decent job with Desi's accent, especially in the opening scene. Madeline Zima was decent, if not overly memorable, as the teen-aged Lucy.<br /><br />Vivian Vance and William Frawley were not featured much, thankfully, since Rebecca Hobbs and Russell Newman were not very convincing in the roles. Not that they aren't good actors in their own right, they just were not all that suited to the people they were playing. Most of the actors were from Austrailia and New Zeland, and the repressed accents are detectable at times.<br /><br />Although the main structure of the film sticks to historical fact, there are many deviations, some for seemingly inexplicable reasons. Jess Oppenheimer, the head writer of Lucy's radio show \"My Favourite Husband\" which began in 1948, is depicted in this film as arriving on the scene to help with \"I Love Lucy\" in 1951, completely disregarding the fact that he was the main creator! This movie also depicts Marc Daniels as being the main \"I Love Lucy\" director for its entire run, completely ignoring the fact that he was replaced by William Asher after the first season! Also, though I figure this was due to budgetary constraints, the Ricardo's are shown to live in the same apartment for their entire stay in New York, when in reality they changed apartments in 1953. The kitchen set is slightly larger and off-scale from the original as well. The Connecticut home looks pretty close to the original, except the right and left sides of the house have been condensed and restructured. <br /><br />There's also Desi talking about buying RKO in 1953, during Lucy's red-scare incident, even though RKO did not hit the market until 1957. These changes well could have been for dramatic license, and the film does work at conveying the main facts, but would it have hurt them to show a bit more respect to Oppenheimer and Asher, two vital figures in \"I Love Lucy\" history? The biggest gaff comes in the \"I Love Lucy\" recreation scenes, at least a few of them. It's always risky recreating something that is captured on film and has been seen by billions of people, but even more so when OBVIOUS CHANGES are made. The scene with the giant bread loaf was truncated, and anyone at all familiar with that episode would have noticed the differences right away! The \"We're Having A Baby\" number was shortened as well, but other than that it was practically dead on. By far the best was the \"grape-stomping\" scene, with Rachel York really nailing Lucy's mannerisms. The producers made the wise decision not to attempt directly recreating the \"Vitametavegamin\" and candy factory bits, instead showing the actors rehearse them. These scenes proved effective because of that approach.<br /><br />The film's main fault is that it makes the assumption the viewers already know a great deal about Lucy's life, since much is skimmed over or omitted at all. Overall, though, it gives a decent portrait of Lucy & Desi's marriage, and the factual errors can be overlooked when the character development works effectively."
        },
        {
            "id": "pos_311",
            "text": "I thought Rachel York was fantastic as \"Lucy.\" I have seen her in \"Kiss Me, Kate\" and \"Victor/Victoria,\" as well, and in each of these performances she has developed very different, and very real, characterizations. She is a chameleon who can play (and sing) anything!<br /><br />I am very surprised at how many negative reviews appear here regarding Rachel's performance in \"Lucy.\" Even some bonafide TV and entertainment critics seem to have missed the point of her portrayal. So many people have focused on the fact that Rachel doesn't really look like Lucy. My response to that is, \"So what?\" I wasn't looking for a superficial impersonation of Lucy. I wanted to know more about the real woman behind the clown. And Rachel certainly gave us that, in great depth. I also didn't want to see someone simply \"doing\" classic Lucy routines. Therefore I was very pleased with the decision by the producers and director to have Rachel portray Lucy in rehearsal for the most memorable of these skits - Vitameatavegamin and The Candy Factory. (It seems that some of the reviewers didn't realize that these two scenes were meant to be rehearsal sequences and not the actual skits). This approach, I thought, gave an innovative twist to sketches that so many of us know by heart. I also thought Rachel was terrifically fresh and funny in these scenes. And she absolutely nailed the routines that were recreated - the Professor and the Grape Stomping, in particular. There was one moment in the Grape scene where the corner of Rachel's mouth had the exact little upturn that I remember Lucy having. I couldn't believe she was able to capture that - and so naturally.<br /><br />I wonder if many of the folks who criticized the performance were expecting to see the Lucille Ball of \"I Love Lucy\" throughout the entire movie. After all, those of us who came to know her only through TV would not have any idea what Lucy was really like in her early movie years. I think Rachel showed a natural progression in the character that was brilliant. She planted all the right seeds for us to see the clown just waiting to emerge, given the right set of circumstances. Lucy didn't fit the mold of the old studio system. In her frustrated attempts to become the stereotypical movie star of that era, she kept repressing what would prove to be her ultimate gifts.<br /><br />I believe that Rachel deftly captured the comedy, drama, wit, sadness, anger, passion, love, ambition, loyalty, sexiness, self absorption, childishness, and stoicism all rolled into one complex American icon. And she did it with an authenticity and freshness that was totally endearing. \"Lucy\" was a star turn for Rachel York. I hope it brings a flood of great roles her way in the future. I also hope it brings her an Emmy."
        },
        {
            "id": "pos_312",
            "text": "Based on a true story, this series is a gem within its kind. The slave that becomes queen by capturing the heart of the most powerful man in the village.<br /><br />In the diamond mining town of Tijuco in Brazil, the diamond commender--appointed by the king of Portugal--is the ultimate authority. Having grown up in the relative security of his house, the young and beautiful Xica da Silva finds her world threatened when he decides to sell her to a whorehouse in town, refusing to recognize that a black slave girl could be his daughter. In a desperate bid to save herself, Xica steals the diamonds collected by the diamond commender for the king, intending to use them to escape. The king's army arrives to collect the diamonds the very next day, however, and when the loot turns up missing, the diamond commender is led away in chains, his family dispossessed and thrown out in the street with only the clothes on their backs. Martin, the diamond commender's son, swears vengeance. Xica and the other slaves, however, are sold at auction, and Xica ends up in the home of the Sergeant Major, an old man who bought her solely to slake his lust. To the town of Tijuco, however, comes the new diamond commender, the elegant and ruthless Joao Fernandes. Immediately struck by Xica's beauty, he manipulates the Sergeant Major into selling her to him. And thus begins a love story, filled with danger, intrigue and passion, between a willful nobleman and a crafty slave girl who rises to one day become queen.<br /><br />The series is filled with rich details of the era's beliefs, superstitions, politics, fashion, etc. etc. And it really manages to captivate your attention for every minute. At times funny with a sarcastic and dark humor, full of suspense and unexpected twists. \"Xica da Silva\" is definitely a must. I wish I could buy the whole series on DVD."
        },
        {
            "id": "pos_313",
            "text": "I am Black American and I loved this soap opera. I watched it dubbed in Spanish on Telemundo, almost 5-7 years ago. The story was a TRUE story about a black slave who's love affair with a white commander led to her leadership and candid, whimsical way of living.<br /><br />A lot of us could learn a lot from XICA. She took what she had, nothing, and saw her possibilities. Many would argue that she sold herself out - but she was trying to secure her future and that of her future children.<br /><br />It was such an excellent soap opera, that I thought it would be released on DVD, but it's not being released. This soap opera was the best soap opera EVER. We need for it to be released on DVD or broadcast on TV again. It's playing on Azteca America right now, which is only available in Mexico or in the US by paid cable. We need it released again to Telemundo."
        },
        {
            "id": "pos_314",
            "text": "This show is a great history story. It's has everything from slavery,the way they were treated, religion, the ways Jews were sent into hiding,the inquisition, the belief in the Orisha the African gods, the way women were treated,including the daughters. Even down to homosexuality. The way the characters are intertwined and that Violante, that character saddens me. She is so desperate to be loved that she destroys everyone around her.I am so glad they decided to re-release it to t.v. again. Although I would love to see the unedited version. Xica has become my Heroine. I look up to the way she uses her power to help all who seek it. I love all the characters and have found that they can relate to many people now in this century. I look forward to my Xica every night. It would be great to dub it in English so the Americans can love her too."
        },
        {
            "id": "pos_315",
            "text": "I absolutely LOVED this Soap. It has been one of my favorite. Will highly recommend :)... I just love Brazilian soaps, they deal with real life events. I'm really sad that the soap ended but I'm sure I'll be able to find it somewhere. For those of you who have not seen it, please see it. I loved the characters, the plot and how things turned out in the end for the villains. The only thing I would have changed is the end for Xica and her long life love. I can't wait to see it again and highly recommend it. Xica has been by far, the best soap I have ever seen. Forget everything else :)GO XICA.. Hope you all like it as well."
        },
        {
            "id": "pos_316",
            "text": "xica da Silva is one of the best Brazilians opera soap ever! the a black slave's story that becomes queen of a small villa when conquering the most powerful man's of the area love, in the colonial period of the brazil dominated by Portugal, that explored its diamonds. The largest xica enemy, violante, bride that it was changed by xica, is a woman of big it influences the Portugal king close to and does to take revenge of the slave of everything. Very religious person, she is a picture of the hypocritical society and religious of the time, she dedicates its life the morality of the villa that was committed by xica, that is a woman full of lusts that it faces the society of the time to preach and it helps the slaves of the area. The story also bill with forbidden loves, sorceries and vampires and religious fervor. Xica da Silva does with that you don't want to lose a I only surrender, from beginning to end!"
        },
        {
            "id": "pos_317",
            "text": "Telemundo should definitely consider making a DVD collection of the novela Xica! I know tons of people including myself who would like to be able to purchase the novela Xica! It is a very entertaining novela which is set in Brazil. The costumes worn by the actors are beautiful and the town in which the novela takes place is beautiful. Xica contains a lot of history of that time period. I wish Telemundo would televise it again even if it was a 2 in the morning. I would highly recommend watching Xica if it is ever shown again on Telemundo. I've e-mailed Telemundo a million times already to show the novela again but my pleas have fallen on deaf ears. The only cautionary statement about Xica is that it occasionally contains some harsh scenes therefore I would recommend that children under 14 do not watch Xica. Overall Xica merits a 10 out of 10!"
        },
        {
            "id": "pos_318",
            "text": "This is without a doubt the greatest film ever made. It is nearly incomprehensible even with many repeated viewings in an attempt to figure out what exactly's going on. The film was almost entirely improvised and includes random musical numbers, commercials, contests one enters by mail, and a host of other innovations. Besides, what other movies have cameos by Martin Luther King, Jr? To decipher the film, hunt down the director's book entitled I Was Curious. It'll all become clear. It's a grand and bold experiment in improvised recursive filmmaking. A triumph. Now if only someone would put out a version with the subtitles in a color *other* than white...the white subtitles tend to wash out and become invisible."
        },
        {
            "id": "pos_319",
            "text": "Wonderful film that mixes documentary and fiction in a way that makes the spectator question: what is the extent of truth in documentary films or is there such a thing as an objective documentary."
        },
        {
            "id": "pos_320",
            "text": "I am Curious (Yellow) (a film, in near Seussical rhyme, is said right at the start to be available in two versions, Yellow and Blue) was one of those big art-house hits that first was a major sensation in Sweden then a big scandal/cause-celebre in the United States when the one print was held by customs and it went all the way to the Supreme Court. What's potent in the picture today is not so much what might offend by way of what's revealed in the sex or nudity- the director/\"actor\" Vilgot Sjoman films the various scenes in such a way that there is an abundance of flesh and genitalia and the occasional graphic bit but it's always more-so an intellectual expression than very lust-like- but the daring of the attempt at a pure 'metafilm' while at the same time making a true statement on the state of affairs in Sweden. Who knew such things in a generally peaceful country (i.e. usually neutral in foreign affairs and wars) could be so heated-up politically? At least, that's part of Sjoman's aim here. <br /><br />Like a filmmaker such as Dusan Makavajev with some of his works like W.R. (if not as surreal and deranged) or to a slightly lesser extent Bertolucci, Sjoman is out to mix politics and sex (mostly politics and social strata) around in the midst of also making it a comment on embodying a character in a film. The two characters, Lena and Borje, have a hot-cold relationship in the story of the film, where Lena is a \"curious\" socialist-wannabe who demonstrates in the street for nonviolence and 'trains' sort of in a cabin in the woods to become a fully functioning one, while at the same time maybe too curious about her car salesman boyfriend. And as this is going on, which is by itself enough for one movie, Sjoman inserts himself and his crew from time to time as they are making this story on film (there's even a great bit midway through where, as if at a rock concert, title cards fill in during a break in shooting who the crew are, negating having to use end credits!) Then with this there's a whole other dynamic as Sjoman gives an actual performance, not just a \"hey, I'm the director playing the director\" bit.<br /><br />At first, one might not get this structure and that I am Curious (Yellow) is just a film where Lena is a documentary interviewer asking subjects about their thoughts on class, socialism, Spain and Franco, and once in a while we see Lena's father or Bjore. But Sjoman does something interesting: the structure is so slippery as the viewer one has to stay on toes; it's impressive that so many years on a picture can surprise with not being afraid to mix dramatic narrative, documentary, film-within-a-film, and even a serious interview with Martin Luther King, who also acts as a quasi-guru for Lena. It might not always be completely coherent analysis politically, but it doesn't feel cheating or even with much of a satirical agenda like in a Godard picture; the satire Sjoman is after is akin to a Godard but on a whole other wavelength. His anarchy is playful but not completely loaded with semantics or tricks that could put off the less initiated viewer.<br /><br />If I Am Curious (Yellow) stands up as an intellectual enterprise and a full-blown trip into exploring sex in a manner that was and is captivating for how much is shown and how comfortable it all seems to be for the actors, it isn't entirely successful, I think, as an emotional experience. Where Bergman had it down to a T with making a purely emotional film with deconstruction tendencies, Sjoman is more apt at connecting with specific ideas while not actually directing always very well when it comes time to do big or subtle scenes with the actors. Occasionally it works if only for the actors, Lena Nyman (mostly spectacular here in a performance that asks of her to make an ambitious but confused kid into someone sympathetic and vulnerable even) and Borje Ahlstedt (a great realistic counterpoint to the volatile Lena), but some 40 years later its hard to completely connect with everything that happens in the inner-film of Lena and Borje since (perhaps intentionally) Sjoman fills it up with clichés (Borje has a girlfriend and kid, will he leave her, how will Lena reconcile her father) and a heavy-handed narration from his starlet of sorts.<br /><br />And yet, for whatever faults Sjoman may have, ironically considering he means it to be a comment on itself, I Am Curious (Yellow) holds up beautifully as an artistic experiment in testing the waters of what could be done in Swedish cinema, or testing what couldn't be and bending it for provocative and comedic usage. I'd even go as far as to say it's influential, and has probably been copied or imitated in more ways than one due to it being such a cult phenomenon at its time (a specific technique used, with the film rewinding towards the end, is echoed in poorer usage in Funny Games), and should be seen by anyone looking into getting into avant-garde or meta-film-making. If it's not quite as outstanding an artistic leap as W.R. or Last Tango, it's close behind."
        },
        {
            "id": "pos_321",
            "text": "I don't know how or why this film has a meager rating on IMDb. This film, accompanied by \"I am Curious: Blue\" is a masterwork.<br /><br />The only thing that will let you down in this film is if you don't like the process of film, don't like psychology or if you were expecting hardcore pornographic ramming.<br /><br />This isn't a film that you will want to watch to unwind; it's a film that you want to see like any other masterpiece, with time, attention and care.<br /><br />******SUMMARIES, MAY CONTAIN A SPOILER OR TWO*******<br /><br />The main thing about this film is that it blends the whole film, within a film thing, but it does it in such a way that sometimes you forget that the fictions aren't real.<br /><br />The film is like many films in one:<br /><br />1. A political documentary, about the social system in Sweden at the time. Which in a lot of ways are still relevant to today. Interviews done by a young woman named Lena.<br /><br />2. A narrative about a filmmaker, Vilgot Sjoman, making a film... he deals with a relationship with his star in the film and how he should have never got involved with people he's supposed to work with.<br /><br />3. The film that Vilgot is making. It's about a young woman named Lena(IE. #2), who is young and very politically active, she is making a documentary (IE. #1.). She is also a coming of age and into her sexuality, and the freedom of that.<br /><br />The magnificence and sheer brilliance of \"I am Curious: Yellow/Blue\" is how these three elements are cut together. In one moment you are watching an interview about politics, and the next your watching what the interviewer is doing behind the scenes but does that so well that you sometimes forget that it is the narrative.<br /><br />Another thing is the dynamic between \"Yellow\" and \"Blue\", which if you see one, you must see the other. \"Blue\" is not a sequel at all. I'll try to explain it best i can because to my knowledge, no other films have done it though it is a great technique.<br /><br />Think of \"Yellow\" as a living thing, actual events in 14 scenes. A complete tale.<br /><br />Think of \"Blue\" as all the things IN BETWEEN the 14 scenes in \"Yellow\" that you didn't see, that is a complete tale on it's own.<br /><br />Essentially they are parallel films... the same story, told in two different ways.<br /><br />It wasn't until i saw the first 30 minutes of \"Blue\" that i fully understood \"Yellow\"<br /><br />I hope this was helpful for people who are being discouraged by various influences, because this film changed the way i looked at film.<br /><br />thanks for your time."
        },
        {
            "id": "pos_322",
            "text": "this movie is not porn, it was not meant to be porn, and unless my uncle runs for president of the world it should never be considered porn.<br /><br />now that that issue was sorted out, i can say i thoroughly recommend this film, as it's issues are still widely available. it's funny, the acting is great and it raises serious(curious) questions.<br /><br />i can't fully understand why this film was so mistreated, probably this is why i plan to never visit the us. Lena is the true pioneer of the modern riot-grrrl movement, confusion, curiosity and wit are her main attributes, she is occasionally angry, but aren't we all?"
        },
        {
            "id": "pos_323",
            "text": "This is truly an excellent film with a revolutionary message (both in form and content) that should not be missed by any fan of French New Wave or Underground film. There are barely opening or closing credits--we are just dropped into the world of consumerist art, revolution, and youth. This film has little to do with documentary and is more interesting in playing with our ideas of advertising and its relationship to reality. Lines of real and not real are crossed in ways familiar with films discussing documentary, but this time we do it for the sake of consuming and marketing, not for describing the real."
        },
        {
            "id": "pos_324",
            "text": "I didn't expect to like this film as much as I did. I got it simply because I saw it on the list of Top 25 Most Controversial Films of All Time. It didn't look particularly great. I was pleasantly surprised to find that it was one of the most cleverly composed films of recent memory.<br /><br />It's about a twenty-year-old woman wants to know everything. She stores every bit of information she collects in an enormous archive. She experiments with experience in sex, political activism, and human relationships. Meanwhile, film's crew is shown making the film and we view their reactions to the story and each other. Nudity, explicit sex, and controversial politics kept this film from being shown in the US while its seizure by Customs was appealed. The film is a narrative yet it's a documentary that shows us the behind-the- scenes world of the filmmakers during the narrative, the fourth wall being broken. This film is the most direct possible way of making a movie I have ever seen. The movie predominantly works as a time capsule of 1960s psychedelic goings-on, freedom-fighting and sexual liberation. I like to think of it as much more than that.<br /><br />I didn't think I would want to waste my time with the blue version of this movie, but I actually really do. This film is a buried treasure. Give it a try."
        },
        {
            "id": "pos_325",
            "text": "This is a great film - esp when compared with the sometimes wearisome earnestness of today's politically-minded filmmakers. A film that can so easily combine sex, gender relations, politics and art is a rarity these days. While the bouyant optimism of the 1960's can't be regained, I think we can at least learn a lesson from the film's breezy energy and charm. I don't know what those who label the film \"boring\" were watching - there's so much packed into it that it never remains the same film for more that 15 min at a time."
        },
        {
            "id": "pos_326",
            "text": "\"Jag är nyfiken  Yellow\" is a lot of fun. Like at least one other reviewer, I was, on numerous occasions, laughing out loud. Yellow is energetic, playful, self-aware, explorative. Don't expect Bergman here. This movie is about a youth in the early- to mid-60s in Sweden and about the issues, read *contradictions*, that the nation and the world were facing. At times Yellow appears to be an earnest social-political documentary, with Lena, the main character, and others interviewing both common people and politicians (e.g. Olaf Palme at home). At other times, Yellow seems to parody this kind of documentary. All the while, Yellow acts as a personal documentary exploring Lena's life - her home life, her loves, her political views, her view of herself. She is a complete person  complex, flawed, contradictory, happy, sad, curious. And placed over all of this is the wonderful additional dimension of the director, Sjöman, and his crew documenting themselves documenting Lena. It is this that, for me, really gives Yellow wings. Not only do they suddenly appear at some very funny times and in some funny ways, reminding the viewer that this is fiction and artifice, but their presence is itself another layer of the film; they are filming themselves filming themselves. I am reminded of a Bjork music video with this same quality  a music video about the making of a music video, ad infinitum, with each iteration getting weirder and more cartoonish. I think Sjöman may have had something similar in mind. While \"Jag är nyfiken  Yellow\" may not be everyone's cup of tea, it is certainly intelligent, witty, refreshing, ebullient, and authentic."
        },
        {
            "id": "pos_327",
            "text": "I've read one comment which labeled this film \"trash\" and \"a waste<br /><br />of time.\" I think this person got their political undies tugged a bit<br /><br />too much.<br /><br />I just rented the new Criterion DVD's of both Yellow and Blue.<br /><br />These films--although hardly great--have at least become of<br /><br />historical interest as to the so-called \"radical student<br /><br />political-social movement\"of the late '60s.<br /><br />I hadn't seen either picture and from their notorious reputation, I<br /><br />was expecting some real porn (there isn't any.) There is frontal<br /><br />nudity (including the still verboten frontal male nudity (automatic<br /><br />NC-17--the Orwellian-X) in the U.S. But I wasn't expecting the films<br /><br />in-your-face democratic socialist message.<br /><br /> Though it tends to the simplistic , I thought it occassionally made<br /><br />its points well. Both films occassionally had me laughing out loud<br /><br />and the director's commentary made it clear there was plenty of<br /><br />parody in the film. Especially the supposedly \"pornographic\" sex<br /><br />scenes. The first such scene is very realistic. The lead couple is<br /><br />clumsy, inept, funny and endearing in their first copulation scene.<br /><br />The second--which caused the most complaints--has faked<br /><br />cunnilingus and fellatio. And the last is the end of an angry fight,<br /><br />that is believable.<br /><br />The extras include an informative introduction to the film, an<br /><br />interview with the original American distributor and his attorney,<br /><br />excerpts from trial testimony in the U.S. and a \"diary\" commentary<br /><br />by the director on some scenes.<br /><br />This is the film that \"blue noses\" wouldn't let alone and led to the<br /><br />pivotal \"prurient interest with no social redeeming value\" standard<br /><br />that, thankfully, still stands.<br /><br />Those with an interest in the quirks of history will find this a must<br /><br />see."
        },
        {
            "id": "pos_328",
            "text": "Fascinating I approached I Am Curious (Yellow) and it's companion piece with great trepidation. I'd read numerous reports on its widely touted controversy and explicit sex. What I got wasn't this, but a thoroughly thought provoking and engaging cinema experience unlike any other. I sincerely believe that the majority of the commenter who felt the film was `lame' or `boring' approached the film as if it were pornography. Perhaps this is pornography, assuming pornography is something intended to titillate the senses, but it is intentionally un-erotic. Lena, the protagonist, throws her all into her performance giving it a realistic and humanity that is simply convincing and enduring. Her breasts may be saggy, her nipples unusually large, her thighs fat, and her face, chubby. But by the end of the film, the audience comes to identify with her, and accept her faults as human. This touch gives her even more believability out necessity. Had the director cast a Briget Bardot bombshell the effect would have been nullified. I cannot more highly recommend this thought provoking piece. Be prepared to invest much thought in this deliberately paced film. The patient and unassuming viewer will be thoroughly rewarded in ways most other films could dream."
        },
        {
            "id": "pos_329",
            "text": "Of all the versions of the Odyssey (or of any Greek mythological story for that matter), this in my opinion is the best of them all. Almost true to the original storyline - with some minor deviations and omissions, e.g. the absence of Scylla & Charybdis and the fact that Eumaeus the swineherd recognizes Odysseus in disguise in his hut - realistic acting and authentic scenery and costumes all contribute to make this a truly memorable masterpiece,not some Hollywoodish sword-and-sandal B-flick. Notwithstanding the fact that the dialogue and subtitles are completely in Italian, if one is familiar with the storyline, he can still make heads and tails of what is going on and what the actors are saying (provided you have a good handy text of the Odyssey at hand). At least I did, and so much so that it has inspired me to study the Italian language to better appreciate the movie even more."
        },
        {
            "id": "pos_330",
            "text": "I'm Italian and when I've recently looked again this film I astonished for its beauty: the first time I was 10 years old and I liked it, but today I can appreciate it with adult mind and feelings. Now I can understand it was a masterpiece of a special season of the Italian cinema (Pasolini etc.), by that time gone. <br /><br />The Hollywood epic films are good...for fun. Perhaps this 'Odyssey' had no English version because is not enough funny... not suitable for pop-corn and coke audience. However suitable for Homer pathos and existentialist reflections.<br /><br />In Italy was recently released a very good DVD version: INTEGRAL, with excellent colors. You can find it in some file sharing, but it's Italian only, and without subtitles. Too bad: also the dialogs and the voices of this film are remarkable."
        },
        {
            "id": "pos_331",
            "text": "This movie of 370 minutes was aired by the Italian public television during the early seventies. It tells you the myth attributed to Homer of the Journey home of Odysseus after the Troy war. It is an epic story about the ancient Minoan and Mycenaean civilizations, told at list 500 years after those events toke place, around 1100 BC.<br /><br />This is a 1969 movie, so if you buy the DVD version you would find that the sound is just mono and there is no other language than Italian, even the close caption is in Italian. Pity. Many people would enjoy this masterpiece if it had at list the English subtitles. But if this is not a problem for you, than I would strongly recommend to watch this movie."
        },
        {
            "id": "pos_332",
            "text": "Although I have not seen this mini-series in over twenty years I can still remember how the balance between character,plot and tale of marvelous adventures succeeded. The use of special effects was restrained making a more poetic rather than literal telling of the story. The two versions I've seen were dubbed (English and French)but the actors appear to speak their own language not just Italian so there is a synchronization problem. It does not spoil the story telling. Among the cast Irene Pappas as Penelope is the most recognizable to North Americans. Recommended to all followers of Odysseus' ever returning."
        },
        {
            "id": "pos_333",
            "text": "In all honesty, this series is as much a classic (as television goes) as the original poem is to the world's literature. Far from being crassly exploitative, it is a beautiful and respectful rendering of one of the western culture's defining texts.<br /><br />I was moved by the plight of Odysseus and his followers; touched by the drama of the fall of Troy (which was felt but not seen); intrigued by the way the gods played with the fate of mortals. (It should be mentioned that the gods appearing here are not ridiculous CGI creatures flitting around on their ankle wings, or poorly-cast fashion models in bikinis. As in Homer's work, they act through mortal agents or, rarely, are represented by classical statuary).<br /><br />It's a pity it's not available in DVD, especially given the vastly inferior and cheesy adaptations of the Odyssey that one can find in video stores."
        },
        {
            "id": "pos_334",
            "text": "It's very simple to qualify that movie: \"A PURE MASTERPIECE\". This opinion is formulated for the following reasons: the performance of the actors, they seem to be citizens of that epoch, 1100 B.C. They personalize perfectly the characters. A second reason is that the poetry expressed by Homere in his poem is well given by the production. Among others the narrations made by the chorus give a particular atmosphere that makes us party of the artistic rendition. Third reason: the reconstitution of the decor is absolutely perfect, in Mediterranean regions, where the action of the poem occurred. And most of all, the emotion is on the rendezvous. I repeat my appreciation: \"A PURE MASTERPIECE\"."
        },
        {
            "id": "pos_335",
            "text": "I've been trying to find out about this series for ages! Thank you, IMDb! I saw this as a child and have never quite been able to get it out of my mind. As a 6-year old, of course, I was particularly struck by the episode of the cyclops, which was absolutely chilling (I talked about it so much that my older brother made me a cyclops out of a plastic cave man figurine, which I still have) What I also remember, though, was the atmosphere, which was unusual right from the beginning - mysterious, austere, and extremely authentic. When I read the original many years later I experienced that same sensation. It's a very hard thing to capture - and probably impossible in Hollywood. Every 'Odyssey' I've seen since has been an enormous let-down. The characters in this series seemed genuine, real people - ancient Greek people - and not some Hollywood stars in costumes. This is a real masterpiece! But - Why is it not better known? And why isn't it available on VHS or DVD? I would just love to have the chance to see this again!"
        },
        {
            "id": "pos_336",
            "text": "As it was already put, the best version ever of Homer's epic. Entirely shot in natural locations in the Mediterranean. The sea and the sky are strikingly blue, the islands green and untouched. The clothing is linen, wool and fur, the settings stony and bare, everything is somewhat rugged and primitive, a bit what you would find in Cacoyannis or Pasolini movies, and it makes it all the more authentic. Although the story is based on myths and widely goes into supernatural, it gives us a good idea of what life in the 10th century BC might have been like.<br /><br />The rhythm is somewhat slow and austere, but the whole is so beautiful that you quickly get into it. Actually, it is amazingly close to the original plot by Homer, if not to the text itself. Ulysses doesn't appear until the first hour, the start being centered on his son looking after him. Then he suddenly appears lost in a storm, lands on the island of the Pheacians where the royal family takes good care of him. His adventures are told in flashback as a narration to his hosts : the terrifying Cyclop, the magic world of Circe, the Underworld, the Sirens etc. He finally comes back to his homeland Ithaca after 20 years, and it all ends dramatically with the killing of the pretenders of his faithful spouse Penelope.<br /><br />As a story, the Odyssey is an unparalleled metaphor of the struggles of a man's life. The cast is brilliant and international here. Irene Papas gives us a typical Greek tragedy style performance as Penelope, but most amazing is the Albanian actor Bekim Fehmiu as Ulysses. Really good looking and totally convincing, it seems the role was really made for him. Strange that he was never offered roles of this dimension afterwards. Also playing Nausicaa is Barbara Bach (as Barbara Gregorini) later famous as the James Bond girl in \"The Spy Who Loved Me\", and playing Athena is Michele Breton, who was otherwise noted in the strange movie called \"Performance\" with Mick Jagger.<br /><br />As it was done 35 years ago, the series was actually quite an innovation for its time, as the first big European co-production for TV (Italy, France, Germany and Yugoslavia). I have seen this mini-series in 8 parts on French television as far back as 1974. I was a kid back then, and although it was all in black and white, it left a very vivid impression. All my life long I wondered if I would ever get a chance to see it again, as it was never shown on French TV later on.<br /><br />I recently found a copy on DVD (all in wonderful color) through Internet. It is unfortunately only in Italian with no subtitles, although French and German versions existed back then. I never heard there was any English version of this film as it is widely unknown in the Anglo Saxon world, and it's quite a shame. If you ever get a chance to watch this, you are not going to forget it ever.<br /><br />There were not many versions of the Odyssey before or after that. The one by Camerini in 1955 starring Kirk Douglas is a classic sword-and-sandal like \"the 10 Commandments\", but not as impressive and very short for such a complex story. The one in 1997 by Konchalovsky is a meretricious Hollywood movie, based on special effects, sometimes quite gory, very poorly acted and grossly afar from Homer's story and atmosphere."
        },
        {
            "id": "pos_337",
            "text": "Documenting a documenter. That's one way to describe Keep the River on Your Right: A Modern Cannibal Tale. This film follows anthropologist Tobias Schneebaum, who in his late 70s went on a journey back to the places he spent time as a participant field researcher over 40 years ago, first to West Papua and then Peru. Tobias is a full-bodied character: a gay Jewish artist anthropologist who eeks out a living on a cruise ship teaching gawking tourists about the cultures he has come to have a deep respect and understanding for. Author of several books documenting his time with both the Asmat people of West Papua and the cannibalistic Amazonians in Peru, Tobias has been haunted by what happened in his time in these places and how intimate his connection and relationships had become. Yet Tobias' constant wonder and appreciation for the places he got to know is admirable and a real pleasure to watch. One can only hope to ever achieve and retain such humility themselves.<br /><br />Tobias makes a compelling subject for study as the experiences he faced in immersing himself in these two tribal societies has left him fundamentally changed. This film challenges the notions of morality and \"naturalness\"- e.g. nudity, homosexuality, cannibalism. (Watch for the graphic circumcision scene). When questioned as to why he engaged in some of the local practices that others would morally denounce, his non-judgmental nature asks: \"Why Not?\" Who is to say the way of other cultures is right or wrong? This little sleeper is a must watch for not only National Geographic types, but also those interested in the art of documentary making. This film shows what can be done shot on video. The editing provides a quiet revelation of Tobias' life that leaves you watching in fascination. At times, he despairs at being pushed by the film crew to make the emotional journey back, especially considering his age and physical frailty. We can be but grateful that Tobias allowed the tables to be turned on himself, perhaps sympathising with the desire to understand humanity and one's place in the world. The filmmakers provide some moments of critical balance, presenting for example one anthropologist who believes that Tobias predetermined his findings (of homosexuality in this case) based on his personal interests. That said, you can't decide when to stop being shocked and when to take this man home for a cuddle. Move over River Queen, this is the best river ride I've taken in a while."
        },
        {
            "id": "pos_338",
            "text": "I saw this film at Amsterdam's International Documentary Film Festival and was privileged to meet both the directors and Tobias Schneebaum, all of whom are lively and outspoken New Yorkers. The film's title in Amsterdam was Keep the River on Your Right, making the sensational aspect of cannibalism somewhat less prominent. Equally important was the loving - and gay - relationship Tobias Schneebaum had with members of the groups he studied as an anthropologist. His reunion at nearly 80 years of age and inevitable leave-taking were very moving. I can only highly recommend this film to anyone looking for a moving story that is anything but pedestrian."
        },
        {
            "id": "pos_339",
            "text": "I read Schneebaum's book (same title as this film) when it was first published and was deeply moved by his ability to see through the many ways of \"otherness\" (his own and the people of the Amazon with whom he lived and loved) to a way of living a decent life. His subsequent books were not as powerful, but showed his continuing quest. His description of his sexual relations with the men of the tribe was way ahead of its time in the early 60's, but his honesty and openness about it were welcome. This movie beautifully conveys both the quirkiness and generosity of the man, but also provides a glimpse into the inevitable destruction of innocence (which is not a morally positive term, in this case) that occurs when \"civilized\" men intrude on traditional societies. Even so, Schneebaum himself has moved into a kind of higher innocence that suggests the possibility of saving humanity from its own destructiveness."
        },
        {
            "id": "pos_340",
            "text": "I loved This Movie. When I saw it on Febuary 3rd I knew I had to buy It!!! It comes out to buy on July 24th!!! It has cool deaths scenes, Hot girls, great cast, good story , good acting. Great Slasher Film. the Movies is about some serial killer killing off four girls. SEE this movies"
        },
        {
            "id": "pos_341",
            "text": "I really enjoyed this thriller! I wanted to see it again as soon as it was over. The cast was excellent, the plot was suspenseful and entertaining, and it was just an overall enjoyable movie! I would rate this as one of the best thrillers I've ever seen! The girls in it were really cute also, especially Denise Richards. She was very ornery throughout the movie and gave her character some OOMPH!"
        },
        {
            "id": "pos_342",
            "text": "I gave it an 8 only because it had received such low votes... this is definitely really about a 5.5..... Ummm.. it was kind of bloody, had likeable, shallow characters, and it had some really hot babes in it. I like the eclectic killer, because he didn't kill people the same way everytime... that sometimes gets old."
        },
        {
            "id": "pos_343",
            "text": "Katherine Heigl, Marley Shelton, Denise Richards, David Boreanaz. Even before I knew what this film was about, these names were enough to draw me in. Gorgeous, talented and popular, these are performers to look out for.<br /><br />Ok, where do I start. We already know what the film is about. Five beautiful girls being targeted by a 'romantic' serial slasher, a guy they all turned down at the school dance 13 years ago. His trademarks include subtle deaththreats disguised as valentine cards, maggot-infested chocolates and a bleeding nose. His weapon of choice: well, take a pick - axe, knife, electric powerdrill, bow and arrow, hot iron, etc. Ok, so basically it's a horror movie with a nice twisted sense of sexuality.<br /><br />Horror movies aren't supposed to be Shakespeare, but I'm not gonna go there. I love horror movies, but not all of them. This one, I adore. It's up there with some of my other favorites. It's funny, sexy and scary. The killer's mask is childishly creepy, and seeing cupid firing a bow and arrow at a victim is really freaky. The acting is topnotch: Denise Richards, Marley Shelton and David Boreanaz are a lot of fun. I really did wish to see much, much more of Katherine Heigl. I am one of her biggest fans and would love to see her doing some leading work soon. Jessica Capshaw is a very capable actress, and Jessica Cauffiel gets to do the ditzy blonde role she perfected in Urban Legend 2. The smaller parts were also good; Hedy Buress was a hoot ('bleedmedry.com') and that younger version of Denise Richards looked frightfully like her.<br /><br />Highlights: Every death scene had a particular distinction to it. The creepiest being the opening scene in the morgue. The hottub scene, while ludicrous, was well done. And the audiovisual maze was sinister. The soundtrack is great, with creepy music and some fine alternative tunes.<br /><br />Lowpoint: I felt as though the killer wasn't featured enough, we barely saw the mask, and it wasn't featured at all during the climax. I also thought the climax was really unfocused, but fun nonetheless.<br /><br />The twist at the end wasn't that big of a surprise, but I'm really glad that the filmmakers decided to spare us that whole 'explaining killer' routine.<br /><br />I don't like to tell people which movies they should see, but if someone asked me to pick a horror movie that I thought was really worth seeing, then Valentine would be it.<br /><br />My rating: 10/10 (Bullseye!)"
        },
        {
            "id": "pos_344",
            "text": "Another entry in the \"holiday horror\" category that fills the shelves of your local video store. The *spoiler* \"wronged nerdy teen taking revenge on the 'cool' kids who wronged him\" plot will of course be familiar to those who've watched it before. And those who've seen it before will probably watch it again; those who are expecting Ingmar Bergman and will subsequently become indignant about their wasted time should just skip it. Marilyn Manson on the soundtrack and David Boreanaz, Denise Richards and Katherine Heigl as eye candy--go with the flow and enjoy it. Oh, and I loved the creepy mask."
        },
        {
            "id": "pos_345",
            "text": "The first hour or so of the movie was mostly boring to say the least. However it improved afterwards as the Valentine Party commenced. Apart from the twist as to the identity of the killer in the very end, the hot bath murder scene was one of the few relatively memorable aspects of this movie. The scene at the garden with Kate was well shot and so was the very last scene (the 'twist'). In those scenes, there was some genuine suspense and thrills and the hot bath murder scene had a nasty (the way slashers should be) edge to it. The earlier murders are frustratingly devoid of gore."
        },
        {
            "id": "pos_346",
            "text": "What an awesome movie! It was very scary, great acting, well-written, nice plot twists, interesting characters, very good direction, and a surprise ending that will leave you with a smile on your face. This is one popcorn horror flick that may not be appealing to non-horror fans, but is still (nonetheless) one of the best thrillers out there today! I highly recommend it to ONLY fans of:<br /><br />1) The horror genre<br /><br />OR<br /><br />2) An actor or actress featured in it.<br /><br />*** out of **** stars!<br /><br />PS- I am sick and tired of people comparing this, and other modern horror movies, with SCREAM. Ya know what, they didn't WANT to be like SCREAM. Everyone's like \"Oh, they copied SCREAM!\". Well, if I am not mistaking, SCREAM also copied other movies too! In fact, just about EVERY horror movie copied an earlier one. SCREAM, however, was a good film. But, still... stop comparing and enjoy it for what it is!<br /><br />GO AND RENT THIS ONE!<br /><br />"
        },
        {
            "id": "pos_347",
            "text": "Valentine is now one of my favorite slasher films. The death scenes are elaborate and the most of the acting is good. Marley Shelton did great as the female lead (much better than Jennifer Love Hewitt in the \"I Know...\" films). David Boreanaz, whom is the main reason I saw this movie, had a pretty small role, but he played it well. The exception to the list of good actors is Denise Richards. She was horrible in this. The only scene I was glad to see her in was *SPOILER* her death scene. All in all, it's a good movie to watch. You should definitely watch this before you watch \"Scream\" or \"I Know...\" again."
        },
        {
            "id": "pos_348",
            "text": "These slasher pics are past their sell by date, but this one is good fun.<br /><br />The valentine cards themselves are witty, and well thought out.<br /><br />The film has one Peach of a line... \"He's no Angel....\" when he in fact IS Angel!!! Watching Buffy reruns will never be the same!<br /><br />The cast is a sizzling display of young talent, but the story does not give them enough real depth. Denise Richards on the DVD extras seemed to think the girls on set bonded well together and this would give the feeling that you empathised with their characters. Sorry but NO!<br /><br />The direction is very good, managing to show very little actual gore, and relying on your imaginations implied threat. Much can be said also for the similar manner in which Miss Richards and Heigel do not remove their clothes...:-(<br /><br />Essentially, the main directorial plus, lies within the \"borrowing\" of various other ideas from previous slasher flicks. Psycho's shower scene is tributed, along with Halloween's \"masking\". <br /><br />Murdering someone hiding in a bodybag though is a pretty original one as far as I know!!!<br /><br />Light viewing, not very scary but a few good jump moments. If it was a choice between The Hole and this though, choose The Hole. Slasher movies have had their day, and this is just another slasher. A very good slasher, but nothing groundbreaking!!!"
        },
        {
            "id": "pos_349",
            "text": "Call me stupid, but I absolutely loved the 2001 horror movie, Valentine. It was so well-made, well-written, well-acted, well-directed, etc! Everything about it was wonderful! There were parts that were relatively routine (Lily's death), very funny (www.Bleed-Me-Dry.com), completely horrifying and creepy (Paige's death), and just plain heartbreaking (the first scene). I think the entire cast did a great job, especially the three leads: David Boreanaz, Denise Richards (both of whom I met, and got autographs from, during the filming of this movie - VERY nice people!), and Marley Shelton.<br /><br />I am very sick of people calling this movie \"another Scream clone\". This movie is, in no way, a Scream clone. In fact, this film runs rings around Scream. It actually makes SENSE! Scream was also NOT the only movie to feature a masked killer in it. Excuse me, but it looks like Scream was also a clone too (ahem..., Friday the 13th, Halloween, and many other scary movies also featured masked killers). I also think that the novelty of the cupid-masked killer is brilliant. It's so strange to see a sweet, cupid face doing all of these horrible things. Another novelty (the nose bleeding) makes way for a fantastic ending! The ending gives me chills every time I see it!!!!! So, even if you didn't like it the first time, watch Valentine again and give it another chance!<br /><br />PS- Keep an eye out for my new website (WWW.LOVE-HURTS.ORG)! Coming soon..."
        },
        {
            "id": "pos_350",
            "text": "I wanted to see Valentine ever since I saw that Denise Richards and Marley Shelton were in it because they had played in some of my favorite movies ever. When I watched Valentine, I was amazed at how great the story line actually was. It kills me to see that it has a low rating because it was not horrible at all. The actors and actresses played the parts wonderfully and the way it ended was so brilliant and cunning. Some scenes were a little unbelievable and or poor, and I admit at a few minor parts it got just a small bit boring, but overall it was non-stop entertaining and suspenseful. It had a mind-twisting story line which made you guess the whole way through and it doesn't deserve all the crap it gets. I recommend this movie to watch anytime, but especially on Valentine's Day because it's sure to give you a ton of chills. Oh, and don't even pay attention to the trailer OR rating, please, DON'T..."
        },
        {
            "id": "pos_351",
            "text": "It's a colorful slasher movie. That's about it.<br /><br />It has the mystery element that SCREAM made so popular in slasher movies, but I never care for such things. Figuring out who's the bad guy is not that interesting considering the clues are all misleading anyway.<br /><br />The death scenes were inventive and gorey, bringing back memories of 80's horror movies like Friday the 13th. <br /><br />Another nice thing about this movie is that it's hard to pinpoint the surviving girl, unlike in SCREAM and IKWYDLS where it was obvious. <br /><br />People who don't like slasher movies won't like this movie. As simple as that. I truly enjoyed it and I plan to watch it again while waiting for more of the same. <br /><br />--MB"
        },
        {
            "id": "pos_352",
            "text": "I just saw \"Valentine\" and I have to say that it was the best slasher movie that I've seen in years. Unlike the recent trend of 90's horror flicks, this movie is more concerned with being eerie than it is with being self-mocking. For those out there that hated \"Scream,\" there is not one reference to \"the horror rules\" in this movie (even though the old slasher movie rules do apply here). <br /><br />This is the perfect blend of 80's and 90's horror. You get the style, cinematography, and good acting of 90's films and the stalking-slasher madness of an 80's flick. I guess the year 2001 is going to finally give horror fans the kind of movies they were longing for. This is definitely a move in the right direction.<br /><br />Denise Richards stands out here as a fun character. You can tell she liked her role, and that makes her stand out. I loved her in this movie."
        },
        {
            "id": "pos_353",
            "text": "I'm not a follower of a certain movie genre. I classify movies only as industrial or non-industrial. Valentine is the second industrial movie of the director Jamie Blanks, after his Urban Legends. Unlike Urban Legends the screenplay and the story line is very weak. Yet again unlike Urban Legends the basic elements of the movie is so dashing and iconic, and that is what makes Valentine the best. <br /><br />As the first basic and iconic element, the growing hatred of the serial killer is so down-to-earth. Since his secondary school years, he has grown up with his wounds he had accumulated in his soul against his classmate girlfriends, who have made fun of him. When you concentrate enough on this first element while watching the movie, you will come to see this point of view of Humanism: \"Noone is entirely good or evil. In fact, somebody known as evil can be secretly kind hearted.\" Just because the story line and the direction is very weak, we are not as satisfied as we deserved. <br /><br />The second iconic element is, of course, the magnificent togetherness of the late 90s' super starlets: My favourite is Jessica Cauffiel who is killed within the coolest way to be killed. An arrow shot from a bow broaches her tummy and stays stuck in, while she was playing hide-and-seek with her blind date, never able to met with. Katherine Heigl is the first starlet getting killed in a biology laboratory while trying to hide under human body models lying on the surgical operation tables. Denise Richards is killed third, while she just found a Valentines' Day gift for her at a whirlpool bath. Jessica Capshaw is killed last in a confidential and unseen way, then she is calumniated to be as the serial killer. Marley Shelton is the unluckiest one with a vicissitude of fortune that she is going to be killed within the most confidential way that we will never know, 'cause the movie is coming to an end before she is getting killed. Finally, Benita Ha is the luckiest one since she was not a classmate of the serial killer, David Boreanaz.<br /><br />The third and the last iconic element is the soundtrack from the blind date labyrinth scene, the Valentines' Day celebration at Dorothy's house scenes and ultimately the killing themes. Everybody has loved the soundtrack as far as I know. Hard Rock never suits better within a serial killer-mystery movie."
        },
        {
            "id": "pos_354",
            "text": "A group of model-caliber San Francisco women who have been friends since elementary school are suddenly being threatened and attacked by someone sending them bizarre Valentine's Day cards. Who is the killer and why is the killer after them? <br /><br />My rating will often change on subsequent viewings of a film--sometimes slightly up, sometimes slightly down. However, I can't remember another film where my rating has changed as drastically as it has for Valentine. The first time I watched it, upon its theatrical release, I thought it was pretty awful--I gave it a 4 out of 10, the equivalent of an \"F\" letter grade. Watching it for a second time last night, I can't remember what the heck I didn't like about it. I can only assume that maybe I was really in the wrong mood to watch it, or maybe I just didn't get it. In any event, I loved it this time, giving it a 9 out of 10, or an \"A\".<br /><br />It might sound ridiculous saying I didn't get a film like this, but there is something to get. Valentine is almost a comedy/horror. Director Jamie Blanks, who was also responsible for 1998's Urban Legend, takes the stereotypical teen horror formula that became so popular in the late 1990s in the wake of Scream (1996) and pushes most of the elements up a notch, making Valentine intentionally cheesy/campy almost to the point of absurdity (where absurdism is a positive stylistic term). On top of that, he gives us a film imbued with humorous commentary on romantic relationships. The humor is unusual in that it has the same exaggeratedly campy tone as the teen horror aspects. Most of the situations in the film, and the modus operandi of the villain, humorous or not, are tied in to the Valentine's Day theme.<br /><br />Many viewers will likely subtract points from the film for its various cliché-rooted but implausible scenarios and plot developments. However, in light of the above, the film is intentionally clichéd, implausible and ludicrous. It's as if Blanks is attempting (and mostly succeeding) to transcend the typical teen slasher by mocking/spoofing the conventions of the genre while also satirizing eros. That's the attraction to the irony of basing a horror film on Valentine's Day. It's an incongruity that is cleverly woven throughout the film, and that is itself at the heart of the slasher genre, making it prime fodder for Valentine's extravagant lampooning. Scream had a similar aim with its horror material, but the twist there was that the film was \"self-aware\". Valentine's Day is intentionally not self-aware; the viewer has to rely on contextual clues for satire. Lest some think I'm \"reading too much\" into the film, it's worthwhile to note that Blanks said in interviews that he \"didn't want to just do another slasher film after Urban Legend\" and producer Dylan Sellers said he wanted to do something \"more adult\".<br /><br />Other viewers may dislike the fact that Valentine's Day differs so much from its putative source material, the novel of the same name by Tom Savage. The novel's characters, setting and plot are very different from the film. Sellers has said, \"While it was a fine book, I didn't think it was the right story for a film\". So instead the novel, which is much dryer and more serious in tone, was used as a launching pad, a motif to create variations on for a horror/thriller story centered on Valentine's Day. While those facts won't help purists familiar with the book like the film, it's helpful to understand why the film has its divergent plot and attitude. It's probably better to look at the film as an independent entity with a similar theme.<br /><br />Blanks' direction is impeccable visually. Valentine's Day has a lush look throughout, with complex, deep colors, interesting sets, and good staging. Blanks is admirable for keeping his villain and attack scenes not too dark, with clearly conveyed action. He also directs his actors with aplomb, catalyzing often slyly humorous performances. David Boreanaz, as Adam Carr, is involved in many of the funniest moments.<br /><br />While Valentine's Day is no masterpiece, it's a very good horror/thriller film that seems strongly prone to misconceptions. If you watch it expecting something more tongue-in-cheek you may find yourself appreciating it a lot more."
        },
        {
            "id": "pos_355",
            "text": "I, like many horror fans, have been force fed the same banal big budget Hollywood remakes and MTV high school slasher tripe for the last 20 years. Here, at last, is an original horror genre movie that ticks all the right boxes.<br /><br />You want a hot lead actress, you want vampires, you want cool weapons, you want cool vehicles and you want blood, lots of it, by the bucket load - you got it.<br /><br />With excellent fight choreography and a supporting role from the Hammer Horror scream queen herself Stephanie Beacham, this really is fantastic stuff.<br /><br />Despite it's low budget, by opting to use 35 mm stock and adding quality CG effects to the mix, director James Eaves has created something that feels much bigger.<br /><br />A must for old school horror fans."
        },
        {
            "id": "pos_356",
            "text": "Turned out to be a classy production with what must have been a low budget. The variety of characters is amazing, from axe-wielding dwarfs to 7ft ghouls! I enjoyed the relationship between the leads, not overly sentimental but romantic enough to keep the interest going. I also enjoyed the mix of humour (which can be very easy to get wrong, too much/not enough) which meant it didn't get too dark, nor too spoofy. It was a great step up from Eaves' other efforts, Hellbreeder and Sanitarium, in terms of storyline and production. They have a great website which is worth checking out. Can't wait for Bane, if the level of improvement continues, it should be fantastic."
        },
        {
            "id": "pos_357",
            "text": "The film is hugely enjoyable with a great cast, and excellent direction by James Eves. The movie is entertaining with a very charismatic performance from Stephanie Beecham and everyone is perfectly cast. James Eves has a good eye for casting and directs like a conductor knowing exactly when to crank up the action, fall and then rise to a climax. He does this with an element of humour, Plenty of twists, thrills and blood. This is a return of the old vampire movie, with loads of gore, blood and screams. The movie works at a great speed and the characters take you on a terrific adventure,but what makes it work is that the film doesn't take itself too seriously with plenty of tongue in cheek action.Great !"
        },
        {
            "id": "pos_358",
            "text": "The Color Purple is about the struggles of life and the love that helps those people strongly affected by the struggles of life. Every character had an element of the color purple in them. The movie touches on love, lost, hope, hate, and triumph. whether it be Celie having lived through hell and losing her sister, and Shug coming into her life to show her love again, Albert not being man righting his wrong toward Celie, Shug shunned by her father and confesses to him in the end, Sofia and her stubborness good and bad, and even Nettie, they had their emptiness and hardship through the film but was overcome in the end and that's the sign of a good movie. Good Job to all the cast and crew."
        },
        {
            "id": "pos_359",
            "text": "I can't believe I am just now seeing this film -- I think perhaps I thought it was another movie about slaves being mistreated, and I avoided Roots for the same reason -- just as I have yet to see Schindler's List -- I don't want to be \"entertained\" by other peoples' pain, not matter how authentic or informative it is supposed to be.<br /><br />So I guess the main thing I noticed about The Color Purple was that it was not about black people being mistreated by whites. The black people were perfectly capable of raping their own daughters -- or giving them away to be treated as slaves by their \"husbands\". It was painful to watch, but everyone redeemed himself in the end, and the acting was phenomenal! I couldn't believe the character Oprah played at the age of 35! And I adore Whoopi to start with - she was amazing. I'm so glad I was feeling lousy yesterday afternoon and Showtime was running The Color Purple."
        },
        {
            "id": "pos_360",
            "text": "11 Oscar nominations and zero win!!! Am yet to understand why - its not like the actors in the movie did any better thereafter that you can make it by giving them awards for trivial roles like it was done with Halle Berry and Denzel Washington - Whoopi, Oprah, Margaret Avery, Danny Glover etc- were all amazing - i am curious to get scripts of the discussions at the Oscars that year...... it should go into the Shoulda-woulda-coulda category for the judges.... <br /><br />Its an amazing book - but true to Alice Walker's style of writing she has a way of seeming like she is exaggerating her characters - so I am so glad that they screen adaptation took a few things out. <br /><br />The cinematography was amazing - the African scenes live much to be desired - the African part in the book is supposed to be set in Liberia - somewhere in West Africa - BUT oh no! Steven Spielberg thinks the world is so dumb that they cant think of Africa outside of the Safaris - so yes there had to be a complimentary Zebra and wildlife scene when we all know there are none West Africa ---- and most of all why get the people to speak Swahili --- who in West Africa speaks Swahili?? I just had to get that out of the way.......<br /><br />But as a story - amazing, film-making - out of this world - CLASSIC yes!!<br /><br />I own it and I watch it when my soul needs some rejuvenation."
        },
        {
            "id": "pos_361",
            "text": "Like I said at the top, four stars just aren't enough. It's one of the best films I've ever seen in my almost 17 years of life. For the people that don't really like it or understand it, you must not have a real appreciation for art or you might have a short attention span.<br /><br />Even if I haven't seen all his films yet, I'd have to say that this is Spielberg at his peak. It's pretty sad to see that movies as great as \"The Color Purple\" don't come along too often 'cause I think all of us are in desperate need of first-class motion picture entertainment in these hard times.<br /><br />Movies like this are more than just movies; they're pieces of art that need to be appreciated more.<br /><br />The idea that it was nominated for 11 Oscars (even Best Picture of the Year) and didn't get one trophy is a sign of how blind and stupid Hollywood can be sometimes. Spielberg wasn't even nominated for Best Director! It should have swept the Oscars that year.<br /><br />The film clearly shows you how unfair life is for some people.<br /><br />If only movies were still this good...."
        },
        {
            "id": "pos_362",
            "text": "In the year 1985 (my birth year) Steven Spielberg directed an emotionally strong and unforgettable story of a young African-American girl Celie (Debut role for Whoopi Goldberg) whose life is followed through rough times. The story begins from the year 1909 when Celie is only 14 years old. She has given birth two children for her father. Celie has a younger sister Nettie with whom she is inseparable. A widower lays his eyes on Nettie but their father gives Celie to him. It is the beginning of an era of horrible abuse and constant controlling. Women are inferior of men and especially being an African-American woman their rights are less than a zero. Celie's story is a true survival story.<br /><br />\"The Color Purple\" is a master-piece and underestimated film of Spielberg. He should make more drama which \"The Color Purple\" and \"Schindler's List\" are good notion.<br /><br />The cast is amazing. Whoopi Goldberg is known better as a ravingly funny comedienne but the introducing role as Celie is a remarkable word that she really can pull of heavy drama. Danny Glover was surprisingly nasty \"Mister\". I have never seen him in a such an evil role. The talk-show icon Oprah Winfrey is brilliant as a strong-willed Sofia.<br /><br />Warning! Prepare to have a number of tissues with you when watching this film. You can really connect to the story of the strong sisterhood. Especially if you have as close relationship with your siblings like I have with my sister.<br /><br />Big applauds to Mr. Spielberg!"
        },
        {
            "id": "pos_363",
            "text": "This movie is about development. People growing and people fading, people surprising and people disappointing. It has it all and more. There is hope, frustration, injustice, justice, love and hate. It is truly a classic drama that has fantastic performances from the whole cast but especially Whoopi Goldberg in her debut role.<br /><br />This movie made me feel very human and proud of it, and I suggest that this movie should be mandatory each Saturday in all prisons in the world - it touches your compassion. Rating: 10 of 10.<br /><br />PS: I admit it: I shed a tear of joy during the final scene."
        },
        {
            "id": "pos_364",
            "text": "Steven Speilberg's adaptation of Alice Walkers popular novel is not without its share of controversy. When first released members of the black community criticised its treatment of black men, while others questioned why a white man was directing this film about black women.<br /><br />This is the story of a young black woman named Celie, growing up in rural America after the turn of the century. She has two children by her abusive father which are snatched from her arms at birth. Her only solace in her miserable life comes from her sister.<br /><br />Celie (played in later years by newcomer Whoopie Goldberg) is married off to an abusive husband (Danny Glover). The husband is humiliated by the sister and so she is quickly removed from Celie's life.<br /><br />The story is often heartbreaking as Celie keeps up hope that she may one day be reunited with her sister and with her children. Throughout her life she meets an assortment of characters, including Sophia, a tough as nails wife to her step son, and Shug, a loud and luscious saloon singer, who teaches her a thing or two about love.<br /><br />Speilberg's direction is all over this picture, which offers brilliant cinematography and some stellar performances. I dare you to watch this film and not be moved! The film The Color Purple manages to capture the essence of what is a complicated story. While it tends to minimise the lesbian aspects as well as the African story, both of which were so vivid in the book, the movie remains true to its themes, allowing the voice of Alice Walker to shine through.<br /><br />I couldn't begin to respond to the controversy that surrounded this film. Suffice it to say, however, this is one of the few films that I can watch again and again, and which has left an indelible mark on me.<br /><br />"
        },
        {
            "id": "pos_365",
            "text": "This is an excellent film, with an extraordinary cast and acting. I was very disappointed with the Academy Awards when this didn't get the Oscar for best film and for best actress (Woopi Goldberg)... it certainly deserved it. In any case, take a look at it. i am sure you will enjoy it very much."
        },
        {
            "id": "pos_366",
            "text": "This movie is so wonderful, it's hard to find words to describe it. This is the only time I can't decide which was better, the book or the movie.<br /><br />Whoopi Goldberg is awesome, and Oprah Winfrey, such a good actress, she could be funny, happy and miserable all at the same time. All together the movie was well directed by Steven Speilberg, and should not be passed up. 9/10"
        },
        {
            "id": "pos_367",
            "text": "\"The Color Purple\", is truly amazing. There is none like it, and I don't think there ever will be. It's a roller coster of emotion and pain that the viewer takes on. The actors are flawless and the directing is superb. I absolutely loved it. A movie has never made me so happy. It is beautiful, that's the best way to explain it."
        },
        {
            "id": "pos_368",
            "text": "The Color Purple is a masterpiece. It displays the amazing acting abilities of Whoopi Goldberg, Oprah Winfrey, and Danny Glover. Not only is Steven Spielberg the most incredible director of all time but his versatility shines through in this film. If you ever want to see what a movie can do watch this. It's a beautiful portrayal of one of the most moving stories of all time!"
        },
        {
            "id": "pos_369",
            "text": "Absolutely one of my favorite movies of all time. I have seen it at least a hundred times and I can't go through it without crying. I defy anyone to watch the reunion of Celie and Nettie, or Shug and father and not feel your eyes getting misty. Whoopie Goldberg should have one an award for amazing portrayal. And for the person who said you can't love the movie if you loved the book, wrong! Im a testament to that."
        },
        {
            "id": "pos_370",
            "text": "I've seen this movie at least fifty times and after watching it last week for the first time in a long time I still FELT it.<br /><br />The story itself was incredible but came alive by Spielberg's expertise and the fabulous cast including Whoopi Goldberg, Oprah Winfrey, Danny Glover, and Margaret Avery. Akosua Busia deserved an Oscar nomination for her short but powerful portrayal of Nettie.<br /><br />You'll experience every human emotion while watching this film. I laughed, cried, and got angry. Like most great movies it was looked over by the Academy with a host of nominations but no wins. But this movie, without a doubt, is definitely one of the best films of all time."
        },
        {
            "id": "pos_371",
            "text": "I remember when this film was up for the Academy Awards and did not win in any category. For the life of me, I cannot remember what it was up against, but one thing I can say: It was one of the best movies I have ever seen. And the fact that Steven Spielberg directed the film did not persuade me one bit.<br /><br />Essentially, it is about a black woman's trials and tribulations as she is growing up from a girl to a woman. There are a lot of insinuations that are disturbing and horrifying, but all of them are needed to see how much this woman has put up with. Along the way, we see other women who have had to put up with their hardships and walk with them to redemption. Whoopi Goldberg gives her best performance ever in this movie. Danny Glover should have also gotten at least nominated for his role in this film. <br /><br />And the best part of this movie is that it treats its subjects humanely, not like some sideshow freak shows like the more recent \"Beloved\" did. I encourage anyone of any race to see this film. 9/10"
        },
        {
            "id": "pos_372",
            "text": "Steven Spielberg wanted to win an Oscar so bad that he figured that he wouldn't win by directing special effects epics (he was nominated for three of them: \"Close Encounters of the Third Kind\", \"Raiders of the Lost Ark\", and \"E.T.: The Extra-Terrestrial\". So he decided to get very serious by directing \"The Color Purple\", a period film with no special effects. Spielberg's first serious drama is a remarkable movie. But the Academy voters who voted back in 1985 still didn't give Spielberg any respect. \"The Color Purple\" received 11 Oscar nominations including Best Picture, but Spielberg was unfairly snubbed when he wasn't nominated for Best Director. It got worse on Oscar night when this film didn't win a single Oscar. It got completely shut out. That wasn't right. \"The Color Purple\" should have won a couple of Oscars including one for Whoopi Goldberg's spectacular film debut as Celie, a woman who suffers at the hands of an abusive husband (frightfully placed by Danny Glover), then gets stronger throughout the film thanks to some special friends. Oprah Winfrey also made her film debut here and gives a great performance as Sofia, one of those friends' of Celie. Since I'm from Chicago, I had already known Winfrey from her talk show (which at the time of this films' release hadn't gone nationwide). Like Goldberg, what a film debut! Margaret Avery is terrific as Shug Avery, another friend who also happens to be the mistress of Celie's rotten husband. All three actresses received well-deserved Oscar nominations for their work here (Goldberg for Best Actress; Winfrey and Avery for Best Supporting Actress). Set in the south during the first half of the 20th Century, \"The Color Purple\" is a film so strong that it made me cry at the end. It also made me laugh at times too. Why Academy voters were so hard on not nominating Spielberg for Best Director is a mystery that still puzzles me today. But Spielberg would eventully go on to win two Oscars years later for \"Schindler's List\" and \"Saving Private Ryan\", making him one of the best movie directors of all-time. But he should have gotten nominated for this movie. The job that he did going from special effects blockbusters like \"E.T.\" to a serious drama like \"The Color Purple\" was remarkable.<br /><br />**** (out of four)"
        },
        {
            "id": "pos_373",
            "text": "this movie is such a moving, amazing piece of work. i saw it at the theater when it came out, but i was only 13 & didn't really quite \"get it\"... i saw it again when i was 20 (on video of course & i now own it) & was just blown away. Steven Spielberg created a wonderful movie that keeps you wrapped up in it from beginning to end. i have read the book as well, but there is just something about the movie that really brings it to life. the casting, acting, music, costuming, scenery, everything, it just wonderful. you laugh, you cry, you cheer... it brings out every emotion imaginable. it is one of his finest pieces of work & should not be missed!"
        },
        {
            "id": "pos_374",
            "text": "Rating \"10/10\" Master piece<br /><br />Some years ago, i heard Spielberg comment that he would redo the movie here and there if he had a chance. Well, Mr Spielberg, i guess nothing is perfect, but this movie - together with schindler's List - is your best. Even Oprah acts well in this one !<br /><br />What got me most is the realism of the story and drama. Stuff like this happened and is still happening in the world."
        },
        {
            "id": "pos_375",
            "text": "this was one of the most moving movies i have ever seen. i was about 12 years old when i watched it for the first time and whenever it is on TV i my eyes are glued to it. the acting and plot are amazing. it seems so true to reality and it touches on so many controversial topics. i recommend this movie to anyone interested in a good drama."
        },
        {
            "id": "pos_376",
            "text": "Spielberg's first dramatic film is no let-down. It's a beautifully made film without any flaws about the life of an African-American woman. It also proves that not all movies that have the African-American ethnicity as the center of the story have to be helmed by an African-American director.<br /><br />What I love about this movie is Spielberg's ability to make it very realistic despite the fact that it was based on a book. Furthermore, Danny Glover was excellent as Mr. And usually, he's just himself throughout most of his movies. But in this, he completely branches out and is someone else for once. But, the performance de resistance of the whole film comes from Whoopi Goldberg. She is excellent as Celie. You will never forget these characters once you've seen this movie.<br /><br />Now, I heard that the musical version of it is going to be a film as well, and all I can say is: I hope it's about as good as this one is, because this one is a film that shouldn't be missed."
        },
        {
            "id": "pos_377",
            "text": "Genteel, softly spoken drama from Steven Spielberg was his first real venture into this genre. A departure from his normal adventure/fantasy fare, it paved the way for his 1993 success, \"Schindler's List\".<br /><br />Based upon Alice Walder's Pulitzer Prize winning novel, the story concerns a young girl's arranged marriage of hardship to a brutal, angry farmer and her painful separation from her beloved younger sister Nettie. While the plot - about compassion, abuse and the power of love to heal all wounds - is often powerful and moving, it loses its way through the fault of continuity and Menno Meyjes' scrambling screenplay. \"The Color Purple\" is at times hard to follow and on one or more occasions tends to be a little erratic in regard to time frame. This lapse in scripting has cost the viewer the depth and detail obviously present in Miss Walker's novel. A real shame that maestro Spielberg was unable to pick out and rectify these problems, as most of the show is a wonderful example of his prowess as a director.<br /><br />Performances are strong throughout, with Whoopi Goldberg making a debut - which she's never matched since with regard to acting accomplishment - as the heart broken Celie who just yearns to be loved. Danny Glover lends solid support, though his \"Moses\" was a superior turn for him in \"Places in the Heart\". The standout showing comes from the unheralded Oprah Winfrey as Miss Sophia, the single minded, fighting black woman whose spirit is crushed by a terrible incident involving a patronising, upper class white woman. Good support also from Margaret Avery, Adolph Caesar and Rae Dawn Chong.<br /><br />Quincy Jones ( co-producer with Spielberg, Kathleen Kennedy and Frank Marshall ) has penned a beautifully melodic score and also provided some original blues for the occasion. Editing from Michael Kahn is sound as always, while director of photography Allen Daviau shows consummate skill in capturing some glorious Southern scenery.<br /><br />This true affair of the heart will surely bring a tear to your eye, it is just unfortunate we are left with so many unanswered questions.<br /><br />Wednesday, January 15, 1997 - Video"
        },
        {
            "id": "pos_378",
            "text": "These days Spielberg's \"The Color Purple\" is mostly remembered for being nominated for eleven Oscars and winning zilch. What's even more alarming is that Spielberg himself wasn't even nominated for Best Director. Needless to say, the film-makers deserved more acclaim than they were accorded.<br /><br />The story concerns the trials and tribulations of Celie Johnson (Whoopi Goldberg), an African-American woman dominated at first by her incestuous father and then by her abusive husband. The film spans several years and focuses mainly on Celie's relationships with the women around her. It's told from a decidedly female perspective but you needn't fear that it's a saccharine 'chick flick'.<br /><br />The story is an interesting one, livened with humour at times although the central character's struggles are paramount. Some may not appreciate the change in tone towards the film's end but I didn't mind even though similar content in a lesser film would likely have me rolling my eyes.<br /><br />The film received three Oscar nominations for acting: Whoopi Goldberg (Best Actress), Oprah Winfrey (Best Supporting Actress) and Margaret Avery (Best Supporting Actress). I think that Goldberg and Winfrey were certainly deserving and Danny Glover was unaccountably stiffed.<br /><br />As already mentioned, Spielberg didn't receive a Best Director nomination for his efforts. Such an omission beggars belief, since Spielberg's direction here is top-notch. I'm not especially crazy about Quincy Jones's score but it's not below average by any means.<br /><br />In the end, the story is a satisfying one, well-told by a master film-maker working from Pulitzer Prize-winning material. Give it a try and you'll probably be as baffled as I am about how it could be so poorly treated on Oscar night."
        },
        {
            "id": "pos_379",
            "text": "1985 was a good year for films - maybe even great - but this one missing out on a gong went a long way to convincing fans that ol' Oscar is little more that a hood ornament for good party members.<br /><br />11 nominations and not a single title: such was the Academy's disdain for one of their greatest directors; and one who had to wait another 8 years before whatever prejudices had prevented them from handing him the statue before allowed them to give him 7 for Schindler's List, which is, arguably, not as good (and I'm half-Polish).<br /><br />Don't get me wrong, Schindler was a classic. And I'm not knocking 'Out of Africa' (which won that year) either; but it was, in my mind, a class behind this one: an epic story of suffering and hope that brought me to tears - and I'm not a big cryer.<br /><br />Maybe it was the music (superb), or the cinematography (sumptuous), but more likely simply the acting: Whoopi, who proved to all of us that she was much more than just a comedienne; Danny Glover, who I'd never heard of before; and, of course, Oprah.<br /><br />The rest is history; but, at the time: who knew?"
        },
        {
            "id": "pos_380",
            "text": "Taking a break from his escapist run in the early '80s, Steven Spielberg directed Whoopi Goldberg in an adaptation of Alice Walker's \"The Color Purple\", about about the desperate existence of an African-American woman in the 1930s. Watching Goldberg play Celie, it's incredible that this is the same woman who starred in movies like \"Sister Act\". This is the sort of movie that could easily be - no, make that SHOULD BE - part of the curriculum in Black Studies and Women's Studies. There's one scene that may be the most magnificent editing job that's ever been on screen (you'll know it when you see it). I can't believe that this didn't win a single Oscar; it may be Spielberg's second best movie behind \"Schindler's List\" (maybe even tied with it). Also starring Danny Glover, Adolph Caesar, Margaret Avery, Oprah Winfrey, Willard E. Pugh, Akosua Busia, and Laurence Fishburne."
        },
        {
            "id": "pos_381",
            "text": "I gave this film 10 not because it is a superbly consistent movie, but for it's pure ability to evoke emotions in its audience. The story of one-woman's-struggle-against-all-odds is an old cliché by now, but very few films have carried it off with so much warmth and sincerity as The Color Purple.<br /><br />It also showed a different side to the African-American experience - showing that after slaves were granted freedom many fell into the ways of the hated 'white man' and were abusive of their own people. I find this an important point as it goes against the portray-white-on-black-violence-and-win-an-Oscar trend.<br /><br />Also the acting performances are superb - especially Oprah who I now have a new found respect for.<br /><br />Well worth watching - but keep some tissue handy."
        },
        {
            "id": "pos_382",
            "text": "One of the finest films ever made! Why it only got a 7.6 rating is a mystery. This film is a window into the world of the black experience in America. Should be mandatory viewing for all white people and all children above age 10. I recommend watching it with \"The Long Walk Home\" as a companion piece. If you think Whoopi Goldberg's work is about \"Homer and Eddie\" or \"Hollywood Squares,\" think again. Don't miss this movie, which should have won the Oscar. (And read the book, too!)"
        },
        {
            "id": "pos_383",
            "text": "This film captured my heart from the very beginning, when hearing Quincy Jones' first notes or seeing the wonderful color of purple of the flowers in the meadows. This is truly a film to cry and die for...! The whole cast gives the best performance in a film I've seen in years and Spielberg has really outdone himself! Whoppi Goldberg, Margaret Avery, Oprah Winfrey(oh lord!), Danny Glover, and the others, all give us their best and you can feel it - almost touch it! Goldberg IS Celie, she gives her that insecurity and feeling of inferiority that is needed for the character, and we grow with her, we grow strong together with her, throughout the movie, and we triumph with her. Margaret Avery is wonderful as Shug Avery, even when she's at her most arrogant, and shows us that \"sinners\", indeed, \"have souls too\". The always sympathetic, charming Danny Glover makes a marvellous job at making people hate him and the magnificent music of(I'd say sir)Quincy Jones adds even more beauty to this splendid film! The photography, the music, the director and the music makes this beautiful, soulful movie into an experience of life. You don't want to miss it! \"Sista'...remember my name...\""
        },
        {
            "id": "pos_384",
            "text": "The film version of Alice Walker's hugely emotive and influential 1983 novel (written largely as letters from the central character Celie to God) was a massive Oscar success, and rightly so.<br /><br />In the role of the abused and awakened Celie, Whoopi Goldberg gave her best screen performance by miles. Not far behind her was Oprah Winfrey as Sofia, the fiery woman tamed by fate. Others in the cast fleshed out the characters Walker had introduced so clearly on the page - Danny Glover as Albert, Celie's abusive husband; Margaret Avery as Shug, a force of change for the good; Willard Pugh and Rae Dawn Chong as Harpo and Squeak; Susan Beaubian as Corrine, the preacher's wife; and the much-missed Carl Anderson (otherwise best known as Judas in the 1973 film of Jesus Christ Superstar) as preacher Samuel.<br /><br />Beautifully paced and sensitively written, 'The Color Purple' does justice to its source while opening out the story to involve viewers of a feature-length drama."
        },
        {
            "id": "pos_385",
            "text": "A film that can make you shed tears of sadness and tears of joy would be considered quite a step in the career of a common filmmaker. The fact is, Steven Spielberg, probably our greatest story-teller, has been doing this in various movie formats for years. THE COLOR PURPLE, at the time, was considered risky, especially after action classics like JAWS and RAIDERS OF THE LOST ARK. In hindsight, this film should have come as no surprise, for Spielberg had made us cry tears of joy and sadness in E.T. Critics called COLOR PURPLE his entrance into intellectual fare. It is quite an entrance. No special effects, no swashbuckling, just brilliant story-telling based on a literary classic by Alice Walker. One surprise is how Spielberg could present such a moving film about African-Americans in the deep south. Slavery is gone, but in the south depicted here, it seems as though blacks are using other blacks as slaves. <br /><br />Spielberg is always put down for sentimentalizing his pictures or adding an element of childishness to please the audience. This is really the first of overlooked films from his career that you cannot make these observations. It is the first in a line of films people either didn't see or wouldn't see because there are no aliens. EMPIRE OF THE SUN, ALWAYS, SCHINDLER'S LIST, etc.. His awesome talent is obvious with this specific picture because A) he uses mostly untrained, first-time actors, B) he tackles a subject most felt was unadaptable to the screen, and C) it is pure drama with no strings pulled where characters grow and change over the passage of roughly 30 years. It is almost epic-like in look and scope and the fact that it did not garner a single Academy Award from 11 nominations is a travesty and an insult.<br /><br />Whoopi Goldberg is fabulous as the tortured Celie, an unattractive woman given away by her incestuous father to an abusive Danny Glover, who she only knows as \"Mister\". The film follows a path of occasional beatings and mental torture she goes through while with \"Mister\". The PG-13 rated film is pretty open to the sexual issues raised by the Walker novel. This is not \"The Burning Bed\" in Georgia by any means. There is no blatant revenge taken as might be expected. It happens gracefully. Goldberg perfectly plays a human being, someone in need of love and someone who deserves it. The films' most poignant and heartbreaking moment comes when Goldberg and her sister, Nettie (played by Akosua Busia) are separated, maybe forever. (Possibly foreshadowing Holocaust separation of child and parent?) You may have to check for a pulse if you are not moved by this sequence.<br /><br />The color purple stands for the beauty of the fields and flowers surrounding these poor people. There really is something to live for, but love triumphs over all. Spielberg bashers take note: the guy can make an unforgettable classic without any cute aliens.<br /><br />RATING: 10 of 10"
        },
        {
            "id": "pos_386",
            "text": "Tsui Hark's visual artistry is at its peek in this movie. Unfortunately the terrible acting by Ekin Cheng and especially Cecilia Cheung (I felt the urge to strangle her while watching this, it's that bad :) made it difficult to watch at times.<br /><br />This movie is a real breakthrough in the visual department. When I first saw this, my jaw dropped repeatedly and I thought to myself that I've never seen anything remotely like it but this is how it should be done in order to do full justice to the mythical world of Chinese historical kung-fu novels! Without a doubt this is one of the best-looking Chinese historical kung-fu epic ever made.<br /><br />But alas, Tsui Hark hasn't improved much in the writing department, and the story and dialog are rather juvenile (his apparent obsession with the silly and overly-long depiction of the evil guys didn't help either). To make it worse, this movie is very badly cast. They decided to use the \"hot\" popular Hong Kong idols as lead characters, but unfortunately both Ekin Cheng and especially Cecilia Cheung are totally unsuited for historical kung-fu dramas because they lack the nobility and mystique that such characters are supposed to embody. Adam Cheng Siu-Chow and Brigitte Lin in the 1983 version are infinitely better.<br /><br />I wish that someday Zhang Yi-Mou and Tsui Hark can join forces and produce a movie that has the visual artistry of Tsui but with the maturity and story-telling poetry of Zhang..."
        },
        {
            "id": "pos_387",
            "text": "This movie is good. It's not the best of the great CG kung fu flicks but its pretty good. First thing first, the story is actually good. The whole idea of gods vs fallen gods type deal with super powers is pretty cool. My problem is theres too many characters! It got very confusing when they switched scenes! The special effects were INCREDIBLE! The fighting scenes were very fast paced and complex. This movie practically all computer generated. The acting is superb, as always expected from such high profile players. Ekin Cheng makes an excellent protagonist, loner character. Zhang Ziyi did nothing for me in this movie. I thought she would have a bigger part but she did one fight scene and a whole lot of yapping. The bad guy, the whole skull army and the whole blood cloud thing is very frightening. The music is also excellent. To me this story deserve at least a mini-series and not just ONE movie. Theres too much story to cram in 2 hours. Maybe if there was a book or something, I would be able to keep up with all the characters and the details. This movie sacrifices story integrity for action. I reccomend Storm Riders over this any day."
        },
        {
            "id": "pos_388",
            "text": "...and I love it. Lots of special effects, and for a movie that's not made on mega budget, this movie really does great job of creating a fantasy masterpiece. I'm one of the guys who didn't understand the story at all, but this was still a great flick to watch. It's definitely up there in standards surpassing Bored of the Rings, and on par with movies like Harry Potter. Which is saying a lot for a movie again, made on a fraction of the budget of these international hits.<br /><br />One thing I really love about this movie is that it so stretches the envelope of adventure movie to come out of Hong Kong. The topic is exotic and original. Production quality is unlike anything seen coming out of HK for fantasy action movie, and acting is great.<br /><br />One of the best movies to come out of Hong Kong, this is the Infernal Affairs of Hong Kong fantasy movie, and I hope they'll continue working in this area, until they surpass Hollywood adventure movies.<br /><br />Just fantastic."
        },
        {
            "id": "pos_389",
            "text": "yeah right. Sammo Hung already acted in the main role in 1983's \"Zu Warrios from the Magic Mountain\". Now, 2001, he does it again with \"Zu Warriors\". But this time, he finally does it right. You seldom see him in wuxia, more often in classic eastern or crime slapstick. But this role simply does fit him! The ancient Chinese legend about zu mountain is not often represented in movies (as far as I know about movies translated for the west). Although, the legend contains a vast of interesting stories and possibilities. Straight said: you haven't seen a story alike yet in a modern movie! And that makes it so great! And wow: all the colors plus the enormously deep, right-into-the-heart going story makes you fall for this movie in an instant. The first time I watched it, I had to watch it again instantly, and I did. OK true, I didn't understand all of it the first time. But that makes it only better! You know, you didn't understand all of it, because there is so much spice in it! Therefor it is a pleasure for one self to watch it over and over again. And yeah, it grows deeper in your heart, the more often you watch it.<br /><br />Summary: A story to love, characters you cry with, and truly: a movie you never forget! -- Editors note: well, I think I must watch it right now again :D"
        },
        {
            "id": "pos_390",
            "text": "The first thing I thought when I saw this films was: It is not really a film, at least it is not what we imagine spontaneously when we hear the word \"film\". it is entirely symbolic, everything in it has a figurative meaning. So if you are not used to express thing in a symbolic way, you will find it strange, if you are not acquainted with philosophy, religion, spiritual life, you will think it's just a fairy-tale... and even a weird one, chaotic. For me \"The legend of Zu\" is perfectly transparent. And I do like it. It tells us in images the story about the fight between light and darkness, the fight that is as old as humanity, and every one who is in search of the sens in this life is confronted with it. The film is obviously made by Buddhists. I am not a Buddhist. My religion and the vision of the world and human is different. But as far as we are all humans and have the same human nature we necessarily have common experiences and can understand each other. It is a really beautiful film! And I which we had more films like this - films that have a meaning. There are too many empty stories which are good only to make time pass more quickly."
        },
        {
            "id": "pos_391",
            "text": "\"Zu:The warriors from magic mountain\" was and is an impressive classic! You never would have guessed it was made in 1983. Tsui Hark's use of special effects was very creative and inventive. (He continued doing this in the Chinese Ghost Story trilogy and later productions.) Even now it can measure up to other movies in this genre. \"Legend of Zu\" is connected to \"Zu\"warriors from magic mountain\"! It is not necessary to have seen this movie to understand the plot of this one. The plot is a bit hard to follow. But to be honest it doesn't matter. It is all about the action and adventure! I always was wondering what Tsui Hark would do if he got his hands on CGI. Now we know,he made this movie. Maybe it sometimes is too much but the overall result is so beautiful that I am not going to be critical about that. There is so much happening on the screen,you simply won't believe! I think it is a big shame that this movie wasn't shown in theaters here in Holland. Because this movie is screaming for screen time in cinemas! This movie easily can beat big budget Hollywood productions like \"Superman Returns\" or Xmen 3. The only thing I do have to mention is the lack of humor! In most of Tsui Harks's movies he combines drama,fantasy,martial arts and humor. Somehow it is missing in this movie. Again I am not going to be picky about these small matters. \"Legend of Zu\" delivers on the action front with the most beautiful special effects you will see. A true classic!"
        },
        {
            "id": "pos_392",
            "text": "The Legend of Zu, as I saw it, was a very interesting story. I think many of the people who didn't like it were not seeing the underlying mythology behind the film. They were expecting something akin to Star Wars, and it was not that. Joseph Campbell, I believe, would have liked this film. There were a number of metaphors and hidden meanings that an average viewer might have overlooked. We all have a mountain of swords within us. We all have to go into our own cave of blood sometime in our lives. We all have to face our own insomnia someday. Granted some of the narration was a bit confusing, and some of the action got a little hokey at times, but I think other points of the film easily made up for it. I'd watch it again. <br /><br />I don't know if there's a difference between The Legend of Zu (which I saw in Mandarin with English subtitles) and Zu Warriors (The dubbed USA version.) It might have been dumbed down for American audiences, which really would have detracted from this film."
        },
        {
            "id": "pos_393",
            "text": "for those of you who love lord of the rings and love special effects, watch this movie! this will be sure to keep you glued to the screen. you will probably even like it if you like watching people fight with magical stuff."
        },
        {
            "id": "pos_394",
            "text": "This is an incredible comeback from movie director mastermind, Tsui Hark. It is one of a few movies that deserves to come a face to face match to Steven Chow's Shaolin Soccer. From the moment the movie started,there was astronishing backdrops at every edge which were<br /><br />deplicted with superb style. If you are a science fiction or chinese martial arts \"geek\", you'll love the excessive amounts of many 3D effects and realistic computer generated weapons. There, comes a fine performance(as always) from Ekin Cheung who plays \"Sky King\". He teams up with Louis Koo(Red) who i was very impressed by his flexible \"wing\" which deflected incoming attacks. The fighting movements of these actors were proficient in every way. Not only is the action superb but the has a somewhat complex storyline. Many Criticisers of this movie complain of the lack of story/theme or just \"shoved in random bits of debrise\" and even describe as \"The Legend of Poo\". However, the viewer cannot rely on watching Dragon Ballz and other similar Manga Cartoons to understand this movie. Others who are famarialy with \"Wu Xia\" movies will have a better appoach. In due respect. there can be one weakness that could be foreseen. The blow that was deliveried to the enemy at the very last fight scene could of been more substantially and devastiingly made.In spite of all this, its a must see."
        },
        {
            "id": "pos_395",
            "text": "Visually stunning and full of Eastern Philosophy, this amazing martial arts fantasy is brought to you by master director Tsui Hark, the man behind some of the best films Hong Kong cinema has produced. The special effects are beautiful and imaginative. The plot is a bit on the cerebral side, but is a refreshing change from films that treat their audience as if they were morons. If thinking is not your forte, however, this may not be your movie. Maybe you should go see the latest from the Hollywood studio's no brain club, but if you are looking for something more, he's where you will find it."
        },
        {
            "id": "pos_396",
            "text": "Legend of Zu<br /><br />I remember well Tsui Hark's original Zu Warriors made 18 years earlier. Over one Christmas, on a rare week when Channel 4 in the UK showed a week of Hong Kong movies, Zu Warriors was so gripping for a very young viewer and his brother and so memorable, that it's been etched into the memory of the now grown up sprog...<br /><br />In fact, I think the original Zu Warriors is one of the earliest films I saw as a kid that I can clearly recall the story line and action scenes from. And the memories of seeing Yuen Biao, Sammo Hung and others in their classic prime.<br /><br />So when I saw this remake of Zu Warriors, there was a feeling of apprehension. Could it beat the dreamy childhood memories I had of the original, or will it follow the road of other remakes and die a death more horrible than the baddies and their broken necks you find in those kung fu movies?<br /><br />Well the answer is I can't say. But that was because this isn't really a remake. The stories (and styles) are almost completely different.<br /><br />The Legend of Zu tells of the story of King Sky, a lone warrior, whose master, Dawn, declares her love for him but her life is taken from her by a monster called Insomnia. Two hundred years later, Insomnia returns, Dawn is reincarnated as Enigma, and Insomnia has returned to destroy Zu. Meanwhile White Eyebrows and Red try, with the help of King Sky, to stop Insomnia.<br /><br />The plot isn't one full of twists and turns, but had enough detail in it to keep me interested. But I can see this film as one you either love or you hate. The film is very much about the special effects, with the majority of it involving several computer generated environments, much like The Storm Riders and A Man Called Hero. But unlike the other two, this film was one which didn't overdo the graphics and the whole thing was tasteful. Nothing appears rushed - unlike Hero. The backgrounds were complementary to the acting and not at all overpowering the scenes.<br /><br />The story also involves plenty of characters and the intermingling of so many individuals does make the film intriguing. It was possibly on the verge of 'too many cooks', but generally each character had its part in the story. But some of the roles appear to be 'extended cameos' in my opinion, and I somehow am left to slightly question the necessity of this.<br /><br />Ekin Cheng and Louis Koo play very central roles in the film, but I couldn't say this film showed their best performances. Cecilia Cheung appears to at least have matured in her acting, but it is still quite raw. Kelly Lin was the new revelation for me. Despite her very short role, I have apologise and admit to ogling!<br /><br />Overall, I have to say, did enjoy this film as much as I enjoyed the 'original'. Given that both movies are made by the legendary Tsui Hark, the two films together are part of a chronicle showing how film making in Hong Kong has changed over two decades. And one beauty of that is the fact that you can't really compare the two films at all, as much as apples are apples and pears are pears.<br /><br />Ultimately, both are thoroughly enjoyable films in their own right. And I'm going back to reminisce by watching the original again.<br /><br />Two to watch, but not compare."
        },
        {
            "id": "pos_397",
            "text": "I have to admit that Tsui Hark is one of a kind, you can't top a person with a strong style of movie presence. A Chinese fantasy picture may not be easy to present to an audience, the director attempted to bring back the classic fantasy tales of Zu Mountain and this is what he displayed.<br /><br />The new Legend of Zu has truly improved from the one in 1983. From this new millenium update, we could see Tsui Hark's vision of the Zu mountains. Spectacular visual designs, amazing action-fantasy epic made beautifully well. Kept me glued through the entire picture. Great cast with just fine acting. It's truly a fun movie to watch, but is it too weird?<br /><br />Now the down side is people will definitely get confused with it's broad story line shortened down into a 95 minute movie. Plot may not have much relation among characters, but by rewatching the movie, you'll have a better sense of understanding the characters itself. Some can complain there isn't too much physical combat, besides with characters that have supernatural powers to defeat foes, spirits fighting by hand-to-hand wouldn't really make sense at all. <br /><br />I appreciated this nice stylish picture. It may have a thin story, but hey look at Tsui Hark's \"Time & Tide,\" we got confused by the plot as well, but it was truly something stylish and awesome. Tsui Hark always attracts something different into H.K. Cinema. American audiences, may have some difficulty to understand while watching this movie, cause this ain't no Crouching Tiger, Hidden Dragon, this is a whole new genre. Although it may not be a masterpiece, but it's special effects is truly better than Storm Riders. This is really worth checking out."
        },
        {
            "id": "pos_398",
            "text": "I'm stunt, I must admit I never saw a movie with such good story and none stop high special effect martial art fighting scene. If you like the fantastic genre, like me, you will certainly be more than satisfied! All character have very cool power and the special effect are near perfection, in one word, flawless! I will listen to this movie a lot in the next years."
        },
        {
            "id": "pos_399",
            "text": "This movie is very cool. If you're a fan of Tsui Hark and Chinese fantasy films, you should love this. This film is the Asian Lord of the rings: A high fantasy story, based in actual Chinese mythology. (I realize many critics have called this film plot-less, I think they probably have zero knowledge of Chinese mythology.) If you liked Stormriders or Warriors of Heaven & Earth, this one should be right up your alley. This film is still very difficult to find in the U.S., even though it was purchased for U.S. distribution along with Crouching Tiger, Hidden Dragon and Iron Monkey. Well worth the search!!! This DVD is also worthy of owning."
        },
        {
            "id": "pos_400",
            "text": "When Tsui Hark experiments, nothing and no one can withstand him. Legend of Zu is possibly 6Hours condensed into 1h40. One does not understand all, but like at \"2001 A Space Odyssey\" you also don't have to, but one feels the power of the film to every second, every picture. An extraordinary vision of the future of the 7th art and the one of the most pioneering, astounding, rejoicing in the recent years. VITAL severe MASTERPIECE! It's absolutely perfect as it is.<br /><br />When Tsui Hark experiments, nothing and no one can withstand him. Legend of Zu is possibly 6Hours condensed into 1h40. One does not understand all, but one feels the power of the film to every second, every picture. An extraordinary vision of the future of the 7th art and the one of the most pioneering, astounding, rejoicing in the recent years. VITAL severe MASTERPIECE! It's absolutely perfect as it is. 10000000000000/10000000000000"
        }
    ]
}